{
  "name": "Altra_Owen_Retro_Desk", 
  "price": "EUR 64.97", 
  "reviews": [
    "There's really not much to say about this table/desk \u0097 what you see in the pictures is pretty much what you get. It's a nice mid century-ish option if you need something small and are into the \"fake wood\" look that was prevalent in the 60s. Plus, it's quite a bargain \u0097 just remember that you're not paying for a keepsake piece of furniture.Very easy to put together. Like some people have mentioned, this is a fairly small desk \u0097 particularly in height. If you have a chair that's a little lower to the ground, it's not an issue. So, buyer beware.", 
    "I needed a small width desk and this fit the bill but did not have the right look. I would have returned it but return shipping was 1/4 of the cost of the item, so I will be repurposing it. It's only redeeming quality is the hairpin legs, which cost $25-plus per leg online. I plan to attach the legs to a thick slab of reclaimed wood when I find the right piece.PROS: The height is good for keyboarding, hairpin legs can be repurposed, easy to assemble, holes drilled in the right placesCONS: Looks too short like a kid's desk, the tabletop itself looks nothing like wood, It looks cheap", 
    "My expectations were pretty mild given the price, but I was pleasantly surprised that the desk was \"as expected\". CONS: The table top is digitally printed and embossed to look like wood. Not ideal, but for $XX you can't expect real wood. I use this as more of a secondary table, not a desk. The height is a little low for normal to tall people (I'm 5'9\"). But I do use it as a craft table sometimes without a problem. PROS The quality of the wood reproduction is good enough that no one will take notice. And I actually really like the grey color. Yes it's GREY, fyi. As another reviewer mentioned, the hairpin legs are worth the price of the table alone. In fact, I bought this table half assuming that I would use the legs with another tabletop. (Thought they would look better on a bigger surface as well.) But in the end the small table fit nicely in the house. Overall I think this is a great accessory piece, but not ideal for a desk.", 
    "I was pleasantly surprised at how beautiful this table is. I was skeptical that I would like it. This table is constructed well. Very nice!", 
    "Everything about this desk is great...nice construction, looks nice, good solid weight, the only problem...it's too short! At only 27 inches high, sitting at this desk felt strange (I am 6'4\"), as if I was playing office while sitting on children's furniture. Just didn't work for me, so I am using it as a media table now. My record player looks great on it!", 
    "Legs are sturdy and top is of good quality.", 
    "What's shown in the picture is what you will get. Very easy to assemble, and looks great! Very happy.", 
    "Very good purchase; I had another desk from ****** which took my friend 1 and 1/2 hrs. to figure out and put together. This one took me 5 minutes. Looks good, saves me space, fits well. It had a small dent on the table but kept it anyway as returns are a pain and not that noticeable. It's under my computer right now, good price,and have extra space, Good choice. Would recommend.", 
    "Overall a very good table. Good construction, nice table top. The table height is also good for normal size people.", 
    "I actually love the fake wood look this desk has. I ordered the grey with black legs for my sons star wars room. Desk is the perfect size for his small space and looks so cool.I accidentally ordered 2 and was always planning on returning the other but I may repurpose the extra into the adult space bc it's so cool looking. Great price and very easy to assemble (7 minutes)!!", 
    "Nice desk good quality. Easy to assemble", 
    "This desk is perfect for limited space- I love it!", 
    "These are exactly what we were looking for! They're small but you have enough room to put your essentials on them.", 
    "This is a child size desk... I read the measurements and even used a ruler to envision it... but that's not my strong point, haha. If it were taller. longer, and wider it would have been perfect.", 
    "We purchased 4 of these to line up for a craft room, and they're just perfect. They look just like they do in the photos, and were ridiculously easy to assemble.", 
    "A little bit shorter than what I expected but all in all it was perfect and a beautiful finishing touch to my bedroom. (The assembly was super easy too)", 
    "Great table/desk for the price. Very sturdy. I'm using it as a plant stand and the size is perfect. I would highly recommend this item.", 
    "Looks great in my office area", 
    "pretty sturdy and easy to put together", 
    "It fits perfectly in the corner of my room", 
    "easy to assemble extremely happy very inexpensive but i can a lot I love itI did red and black fabulous", 
    "Received this desk quickly and it was easy to assemble. Just what I needed for my home office.", 
    "Easy assembly (even tho I put 3 legs on wrong lol ) just make sure the legs point outward! Its very study, doesn't seem cheaply made at all", 
    "it is a really stylish desk, great for its price.", 
    "I love the desc and the chair is now a printer table", 
    "Looks great, easy assembly", 
    "Easy to build, and a great addition to my study", 
    "I needed a smaller desk to fit between my boys beds and their shared room. The price was great and my 12 year old assembled it all by itself!", 
    "easy to assemble and as pictured, good for writing or a laptop otherwise may be too small", 
    "It's the best... and then some!", 
    "As others have stated, it is very low to ground. It works for me, but would have like if it were a few inches higher.", 
    "I needed something small enough to fit in my small room at the end of my couch and this is perfect. Sturdy enough, but not sure I'd use it as a desk.", 
    "Perfect for my laptop, just what I ordered. Easy to assemble and sturdy.", 
    "Bought this for my 9yr old daughters room, perfect for a tween room.", 
    "perfect little desk, great price, great look!", 
    "very good quality for the price, easy to put together, sturdy, just the right size, I am probablly going to order one more. For my craft room, just the right table.", 
    "It looks exactly as it does in the picture and was a great and inexpensive way to update my office area without committing to a large investment. The delivery was fast, and the desk was extremely easy to put together. Because of it's simple design, it lacks in functionality and size. I find my workspace getting cluttered really easily so I needed to pair with additional storage. If you're looking for something uncomplicated for just for simple activities, this is for you. I tend to craft a lot and find myself needing more room, but this is my own personal preference.", 
    "Small desk/table. Very easy to put together - everything fit exactly as it should. It is an inch or so lower than other desks, which I like as a comfortable height for my laptop, especially using the matching stool. I don't hunch up my shoulders to type. I am 5'6\". Clearly is not wood, but for this price point, an excellent value.", 
    "Perfect for my spare room.", 
    "its a smal desk, with ovely design, but a little low", 
    "Fits my purpose of a basic work from home desk. Easy to assemble, and stable. Great simple desk for the price.", 
    "This desk looks good and is easy to assemble. However, the only problem is that the height is slightly lower than regular working desk. It is not the most ideal height to work with for long periods of time because you have to couch down a little in order to see you computer in a comfortable manner. The table top also peels off pretty easily, even just when you put tape on it for a second, it will peel off. Overall, it is sturdy enough to hold all my stuff but the height is definitely a problem.", 
    "I've gotten a lot of compliments on this desk and everyone seems surprised when I tell them what I paid for it. It's easy to assemble and great for working on...very sturdy.", 
    "we wanted a modern, simple printer table and this was perfect, easy to put together and sturdy too.", 
    "Desk was good for the price", 
    "I wanted a low desk, and this is perfect. It takes about three minutes to attach the legs. I have a big, wide, cushioned swivel chair as a desk chair, and it didn't quite fit between the front legs, but it was super easy to drill new holes and change the angle of the front legs so I could fit the chair under there. It's solid, well-made and attractive. I have my computer on it, and it's totally solid. I don't know what the weight limit is, but it feels very solid and secure. Looks great, too!", 
    "Nice desk, easy to put together. Liked this one so much I bought a second one for my son", 
    "I bought this for my teenager to match the color of her artist created & painted headboard for her bed. The black legs are a nice contrast to the teal and the desk is well built and lasting.", 
    "I like the desk for the price and what I need it for. Very light and looks nice both in bedroom & living room. Easy to carry", 
    "It's perfect for the price point, and easy to put together.", 
    "I give this five stars because it was as expected. A great small desk at a good price. And easy to assemble.", 
    "Easy to put together and super cute!", 
    "Just what I expected! A sleek, edgy desk that holds everything I need to have a successful study session.", 
    "Easy to assemble, very chic looking yet sturdy desk. It's a bit small for everyday office use, but my 12-year old does her homework on it and it's just fine for that.", 
    "Great Item, but the item came chipped. :(", 
    "Perfect for small office/sunroom.", 
    "We use this to eat dinner in front of the couch for movie nights. Looks way nicer than the price suggests and cleans up easy.", 
    "My son has a smaller room but needed a place for homework and this desk works perfectly. Soooooo easy to put together, seriously took less than 5 minutes and looks great. Enough room for books, paper and a lamp. Very happy with purchase!", 
    "Not thrilled with the way it was packed for shipping. Has a chunk missing out of one side. Not going to send back but will be more careful next time I order.", 
    "Just big enough for my grandson to do his homework!", 
    "Simple design. Easy to put together.", 
    "really nice desk, could use alittle more room on it, but I like it anyway. Just not enough space for computer, printer and space to write.", 
    "Cute, goes with other Owen pieces. We use this as TV stand with matching Owen end tables. Table is a bit green/grey - not taupe at all.", 
    "Again great price and excellent quality.", 
    "The desk looks great and is very easy to build. I recommend it!", 
    "Cool look, easy setup. Laminate material but for the price is a tremendous deal", 
    "I ordered this to use with my sewing machine. It's the perfect height. I was afraid that the legs would be wobbly, but it is very stable and it went together very easily.", 
    "This desk is pretty sturdy and slim I currently have a monitor, keyboard and mouse on top. I just wish the sides weren't laminated, as the wood has a texture and the sides don't.", 
    "This is the second piece I have purchased from this line. I also have the matching coffee table. Assembly is quick & easy & the quality is much better than expected for such a low price. The laminate is realistic looking & has a wood texture to it. It's lightweight, sturdy, & very attractive.", 
    "It was easy to assemble, although the small hex wrench needed to assemble wasn't included in the hardware. The legs are sturdy, and it doesn't wobble. My wife wanted a little desk to set her laptop on. It's perfect for that purpose.", 
    "Fun, little writing desk, great for smaller rooms", 
    "Love this desk perfect size for small rooms. Matches stool I use it as a crafty table.", 
    "Super easy assembly - I could do it by myself. Using it for a desk top computer and it works nicely for what I paid.", 
    "we have this table in our living area to hold our iPod dock. It looks great and was easy to set up.", 
    "Needed to set up my computer with limited space, it worked out perfect and is very sturdy.", 
    "Very sturdy..Easy to assemble. Presently holds a heavy printer, could be used for many purposes.", 
    "sturdy little desk. retro stand looks like the picture. IT is a little small but chair fits under it.", 
    "Desk is sturdy but so simple to put together- took me about 5 minutes! The only problem was that it was shipped to me with no bolts and no wrench... so no hardware at all. I called the manufacturer who was very easy to work with and they shipped me the hardware in 2 days for free. I live in a cramped inner-city apartment, so this was the perfect thing for me. Weight limit is only 80 lbs, however, so this may not be the perfect desk for people who keep their desks very cluttery.", 
    "this desk fits a lot of needs as a table as well as a desk.Very well designed , love the reclaimed wooden top", 
    "a great deal for the price , very sturdy legs and easy to put together", 
    "Purchased the desk and stool together! The desk is sturdy and space saving. The retro styling really updates the look of my room. Love the red/black color combination!", 
    "Perfect for my needs. Great price, solid, looks good!", 
    "Taller buyers take note of the height on this desk. I'm 6'3\" and ended up having to put risers on the legs to get it to a comfortable level.", 
    "This isn't a fancy desk and it's small (both size and height). But great value for the price and exactly what I wanted for my sun room. I love the legs and the Oak top is laminate, but looks like wood from afar. Seems water and sunproof. I figure I'd use it a few years, then take the legs off and attach them to a nice piece of reclaimed wood when it's time.", 
    "Easy to assemble, great price. If you are tall, this won't be a good fit for you. I'm 5 ft, 1 inch and it's great for my height and doesn't take up a lot of room.", 
    "Sooo easy to assembly! Family loves the modern look for our computer. Purchased a Barclay Organic chair to go with it. Super combo!", 
    "Love this desk! It is the perfect size for our space, the color was true to the picture, and the hairpin legs are sturdy. Easy to assemble.", 
    "This table is cute and serves the basic function of being a desk. It was easy to assemble. It runs on the short side, it looks way taller in the photo for some reason. And when I finally assembled it, I noticed that one leg is shorter than the others. So, I had to fold some paper under the leg to even it out. That being said, I'm keeping it.", 
    "These desks are perfect for small spaces and still look chic! Super easy to put together and looks really high quality!", 
    "This is a great desk for the price. It's smaller than I was thinking but it actually works out great for the den/office space I have. It fits my laptop and a few items nicely.", 
    "I was specifically looking for a shorter than average desk with a minimalist style and footprint. At 27 inches in height (exactly as described in the listed dimensions), note that this is a good 3 inches shorter than your average table or desk. I'm 5'4\", and this is the perfect ergonomic height for me to place my laptop keyboard (I pair it with an external monitor & riser). I am also able to use this for sewing, as it puts the working surface of my sewing machine at just the right height.The work surface is constructed of MDF/laminate (again, exactly as described), but the printed surface is attractive and the legs are sturdy and stylish. I can totally see myself replacing the top with nicer wood down the road, but it's exactly as described, took about 5 minutes to assemble, and perfectly suits my current needs. Be sure to read the fine print on the dimensions and materials on this, and if they meet your approval you will not be disappointed.", 
    "Some of the reviews of the desk being too short haven't really affected me since I'm just 5'7\", but note it is low. I really like the design and look of the desk. A plus is it can easily convert to a console table as well. The wood is very grey-ish in color, and cheap looking. Despite that, the desk is functional and stylish.", 
    "My grand son uses it. Good size for elementary school age.", 
    "you get what you pay for! very small and looks cheap. I will use it as a printer station instead of a desk.", 
    "I really like this desk.The item exactly looks like on a picture.Perfect for small places.Great Quality!", 
    "looks great, easy to assemble and was what I had expected", 
    "I think this one is priced a little high", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Owen-Retro-Desk/9086627/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9086627/Altra-Owen-Retro-Desk-e3483a02-b9ed-4a52-801e-d9f7c7c20b06_600.jpg"
  ], 
  "description": "Give your home workspace a retro look with the Altra Owen desk.\nThis metal desk features minimalist style and sturdy support,\nmaking it ideal for schoolwork or business. This retro-style desk\nholds up to 80 pounds, so it easily supports your computer and\nperipherals. Choose from a variety of finishes to suit your home\ndecor. Brand: AltraMaterials: Engineered wood, metal, paperColors: Sonoma Oak/gunmetal, black/red, espresso/tealRetro-style desk with hairpin legsGreat for small spacesMatching bench for red and teal desks sold separatelyAssembly RequiredWeight: 25.76 poundsDesk weight capacity: 80 poundsDesk dimensions: 27 inches high x 40 inches wide x 19.49\n  inches deepMaterialMDF, MetalFinishBlack Finish, Wood FinishDesk TypeComputer Desks, Craft Desk, Student Desks, Writing DesksAssemblyAssembly RequiredColorBlack, Blue, Brown, Neutral, RedFurniture Frame MaterialMetal"
}