{
  "name": "Altra_Owen_Retro_Mid-century_Style_Coffee_Table", 
  "price": "EUR 98.54", 
  "reviews": [
    "First of all, this is an inexpensive piece of furniture so I wasn't expecting much. I was pleasantly surprised. It looks almost exactly like the picture. It's very solid and was easy to assemble. I'm so happy with the purchase and would recommend it to anyone looking for an inexpensive, trendy coffee table. It isn't solid wood and it's easy to see that but for the product, I'm completely satisfied.", 
    "love it very easy to assemble the color is great", 
    "Nice medium sized table. Legs are minimal which looks nice in an office. Easy to assemble.", 
    "This table is very stylish. easy to put together. solid. I am a little concerned about the corners peeling but so far seems ok. I do like them and think they were worth the money. easy delivery and only minor assembly.", 
    "Nice, simple and contemporary. Easy assembly", 
    "Simple and functional. Great for a small room.", 
    "Sturdy and affordable. I was unsure about buying this because I thought it was too cheap, but it works and looks perfect in my mid century living room. It is not real wood, but that doesn't bother me, because I don't have to worry about people putting cups/glasses on it without a coaster. Perfect for a house with kids.", 
    "bought it for the living room and it looks great. excellent quality", 
    "Looks just like the picture, is sturdy and good quality. Looks great for a great price!", 
    "very easy to put together. For the price good item. Try not to spill anything on it. I didin't realize the top was paper and rubbed too hard to get a stain out, some of the paper came off and I have a 2\" white spot there now.", 
    "So happy with this table. Great price. Great product. We live in a small apartment and this coffee table doesn't dominate our living room like our last one did. I love it. One warning: if you have young kids that can't resist the urge to climb on tiny tables and furniture, this table will not beat their weight well.", 
    "It was super easy to install. Love the color.", 
    "I ordered the end tables as well, the coffee table is simple, clean lines, easy to put together. I will more than likely get the desk to top the set off.", 
    "This table is exactly what it looks nice. It's simple, easy, nice-looking, modern. It was easy to put together. The only downfall is that the finish is easily scratched (a small piece of tape resting on the table for a matter of seconds took off a small strip of the finish on top of the table). All in all, it's great", 
    "great table perfect midcentury feel", 
    "The table is sleek and stylish, and not at all difficult to put together. I'm happy every time that I see it.", 
    "Returned because it did not fit in our office", 
    "After finally getting this table (first order the table was broken in half!) It is exactly what a wanted. It is well built (to spite the shipping issue) and fits with my retro decor.", 
    "The table looks as advertised. Easy assembly and sturdy. Great addition to a room.", 
    "Simple. Easy to put together. Nothing fancy but will work nice for my son's first home.", 
    "Just got this table and I love it! Very solid, pefect size and color. Contrasts well with greens, browns and orange (my rugs and couch). Took about 10 minutes to assemble. Perfect for a laptop, some books, etc.", 
    "Not high quality, extremely easy to build - comes with top and legs and screws. My 10 year old built all these Owen pieces himself. It looks like dorm or first apartment quality, not for a family.", 
    "Simple and clean looking nothing fancy but does the job!", 
    "great deal and looks clean and chic.", 
    "I ordered this table as a cheap addition to my living room.", 
    "Looks like the picture provided, though it has a bit more brown in it than shown. It's more of a grayish brown than a light gray. The design is just what I wanted, very easy to assemble, and sturdy.", 
    "Very sturdy and easy to assemble. Looks exactly like the picture.", 
    "table top got chipped before installing it. planning to paint the surface to make it look nicer.", 
    "Easy assembly. Nice wood finish. Exactly as presented. Good for the low price. Love the hair pin legs!", 
    "Nice table for the price.", 
    "I'm really pleased with this table considering what I paid for it. This was an absolute bargain. I don't expect it to last me for years and years, but for my current apartment it works great and looks great. The veneer in the corners is somewhat delicate and has already been slightly damaged on mine during a cross-town move.", 
    "Item arrived in excellent condition. Very pleased with this item and looks fantastic in my new living room.", 
    "This table is much better looking in person. Very good quality. I would recommend.", 
    "Very sturdy. Excellent material. Table top is thick and heavy. Very great product for the price! I love it!", 
    "Not quite what I expected - too rustic - returned", 
    "I broke sisters coffee table so I replaced it with this one. It was easy to assemble and it's a nice color.", 
    "very happy. Nice retro look. Nice quality too. You pay for what you get.", 
    "Easy to assemble, and felt sturdy, looks like the picture", 
    "I was hesitant to purchase this table because of its simplicity. \"why not just get a table top and purchase the cast-iron hairpin legs and build one so I get exactly what I want right?\" I thought. Nope. This table IS exactly what I want, it's very, very sturdy and the legs are not flimsy hollow metal tubes like I assumed, they're nice sturdy metal with a lovely finish. The table surface is thick and solid, with a beautiful texture. This is way nicer than I expected, and the color is definitely a neutral gray (though slightly warm toned). Has the look of oak. Really nice, totally worth the money. I'll have the desk and the end table that match in no time.", 
    "Nice product for the low price! The picture holds true to the product.", 
    "Table is an excellent value. Looks like a much more expensive purchase. Super easy to assemble, less than minutes to attach the legs and that was it. Highly recommend", 
    "I was pleasantly surprised by the quality of this table, for this price I expected a medium/low quality laminate, but this is great, the wood-look laminate can appear fake & very tacky, but this one is beautiful & very well crafted, legs are sturdy too & it was very quick & easy to assemble. I planned on attaching the legs to a different top, but now I think I'll keep the top too!", 
    "I received this table yesterday. For the price you pay for it it is very sturdy. It does not shake. It weights over 30lbs. I love everything about it, except the wood scratch mark design. I think it is meant to look more like \"wood\" but it looks like cat scratches. Except for this, I love the color, size, sturdiness. About the color, it is not as ash grey as in the picture. In reality it is more of a warm/french grey.I would recommend this product to a friend.", 
    "It was easy to assemble , took me 10 minutes and table was ready. Its absolutely awsome !", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Owen-Retro-Mid-century-Style-Coffee-Table/9079814/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9079814/Owen-Retro-Coffee-Table-1a8ac69a-3320-4d72-88a2-6d11f5010264_600.jpg"
  ], 
  "description": "This Altra Owen retro-style coffee table features clean lines and\naminimalist design for a sleek appearance. The hairpin legs\narecrafted from solid metal for added stability, and the\nspacioustabletop provides plenty of room for displaying your\nuniquetreasures and photographs. This oak-finish coffee table has\nawood-grained appearance for added sophistication. Mid-century StyleMaterials: Engineered wood, metal, paperFinish: MetalColor: Sonoma OakIncludes One (1) tableDimensions: 18 inches high x 41.97 inches wide x 19.49 inches\n  deepRetro-style table with hairpin legsSonoma oak wood grain finished top with gunmetal grey metal\n  legsCoordinates with additional Owen pieces (sold\n  separately)Assembly requiredStyleMid-Century, Modern, VintageMaterialLaminate, MDF, MetalTypeCoffee TablesFinishMetal FinishShapeRectangleAssemblyAssembly RequiredColorBrown, Grey"
}