{
  "name": "Altra_Metal_Frame_Coffee_Table", 
  "price": "EUR 92.04", 
  "reviews": [
    "Just recently received this table, it came chipped in two different parts. the top and bottom of the coffee table are made of particle wood and the laminate on top seems to crumble when you drill the screws into the table. This is NOT a good table. Ordered replacement parts, so let's see if they are any better, if not than I will be returning the table.", 
    "The actual \"wood\" on these tables is pretty cheap, but still looks really nice. Since it's just screwed onto the metal frame (which is quite sturdy) it would be pretty easy to switch it out with some hardwood plywood or something if at some point I wanted something of higher quality.For the price, though, awesome and I'm quite satisfied.", 
    "I purchased in the ash color and it is much more grey in person (which I actually love and it fits even better with my decor than I expected). Assembly was easy and quick, the table is sturdy and is a gorgeous piece. I'm not giving 5 stars because after using it for about a month the surface is already starting to \"bubble\" a little from moisture (we have a 3 year old and use this table HEAVILY so there are always drinks on it). It is only noticeable from certain angles and is very slight but still disappointing after such a short time.we got some coasters so hopefully that solves it because otherwise I love this table. Its also a little heavier than I expected so its not the easiest to move.", 
    "I needed a new coffee table to update my living room space. I was looking for something that was simple and modern with a lot of extra storage space at the bottom. I received the coffee table yesterday from UPS. It took me ten minutes to assemble. It was well packed. It's strong and sturdy. Great piece for any size space.", 
    "nicely packaged, super easy to assemble-only took about 10 minutes, looks really nice for the price. Goes great with my grey, white and black schematic. Smaller than most coffee tables but still plenty large enough. Easier for my toddlers to move around in our living room-it's a smaller space. Also, I love that it's 3 inches higher than a lot of coffee tables that tend to be 16\" tall. Can't say enough so far. Easy to clean too!", 
    "Easy to assemble, looks great and super sturdy.", 
    "it's held up with all the dance families :)", 
    "Arrived with the tip wood veneer chipped in multiple places. Wood veneer is never a good look for furniture, purchase something else.", 
    "Too small for my sofa. Cant really give a bad reciew bc I didn't assemble it. Itl opened the box and saw the top and realized it was too small.", 
    "It started to fall apart during assembly.", 
    "Easy to put together. Durable, easy to clean top", 
    "The table is very nice, long and sleek. Not bad for the price at all.A bit disappointed with the delivery method, the box was open and cardboard smashed on one side. Luckily the table was not damaged but the package was a disaster.", 
    "Great bang for your buck. Fits very nicely with the decor of my apartment and was very easy to assemble.Having had the table assembled for a approximately a month as of this post, it appears to be a very sturdy table that carries a fairly decent level of durability. I do not have a single complaint about the product and is a steal at this price.", 
    "Very easy assembly and looks decent for the price. Definitely not a super high quality piece of furniture but you should be able to tell that by the pictures and low price. Overall good value for what it is.", 
    "I've been searching for a box frame coffee table everyone online and settled on this one for the price and color. It far exceeded my expectations. it is very well built, sturdy, the frame and surface aren't junk and are really durable. It was easy to put together, and gives the living room a really nice contemporary look. I am very satisfied with this purchase, not only for the great price and value, but also because this is a really nice table. Other competitor tables on other websites had really bad reviews and were 5 times the price!! Buy this table, you will not regret it.", 
    "Really proud of this purchase. It cost way less than what it looks and feels like. It has a cozy yet contemporary look that I quite enjoy. One reviewer mentioned that the Sonoma Oak color is more grey than what is shown in the picture, and I second that.", 
    "Easy to put together, stable and color matches picture for the ash grey.", 
    "Easy to assemble. Perfect height. Very modern or country. However u want to decorate it", 
    "Very nice for the price. Very modern and stylish.", 
    "We've owned this coffee table for about a year and we continue to love it. The price is great for the quality of the table. It is a nice, contemporary coffee table that ties together black and wood tones. Good height, not too low or too high.", 
    "fits well in my living room. pretty solid for the price", 
    "We needed a coffee table that was durable but with a rustic look to it & this fit the budget also. Thought it would look \"cheap\" because of the faux wood but it actually looks good!! Easy to put together!", 
    "The table is decent enough for the price, but the packaging is terrible. The two main boards arrived with tons of scratches and few deep gouges because they just threw a plastic bag full of screws between them.", 
    "very easy to put together, and looks good", 
    "Exceptionally poor quality", 
    "Table was exactly as shown.. We love it!", 
    "Sure these arent top of the line and are cheaply made but they came just as they look in the picture and you cant beat the price!", 
    "easy to put together, great looking!", 
    "I expected a different color", 
    "Love this coffee table! sturdy and goes well in my living room and has an entire collection", 
    "I bought this for staging houses. It is small, and very attractive. I really can't say enough great things about it for the price. Coffee tables are as ridiculously overpriced as bikinis, this one is a home run as far as looks /style with price", 
    "Sturdy and easy to put together.. The \"wood\" scratches easy and is not durable.", 
    "among all the stuff that i bought on overstock.com this one is the worst quality. many cracks on the two boards. biggest one is almost 10cm which is unbearable. if it is not because i really need a coffee table for friends came over during thanks giving will no doubt return this crap. the outside package from UPS is intact so don't blame the shipping company. seriously? nobody check the quality before shipping this out?", 
    "You get what you pay for in this table. Quality is poor. Within the week, the veneer was scratched up. Would not recommend.", 
    "Perfect coffee table for my son's basement", 
    "I ordered this coffee table because I really loved the simple design and the reasonable price tag. The FIRST one came so scratched and chipped that I couldn't believe that it had been allowed to be shipped out to a customer. It took over a month to get a replacement from overstock, but the second one finally arrived.....only slightly less abused then the original. I have had to strategically place candles, baskets, remotes, etc. to cover the many scratches and chips in the wood veneer.I'm incredibly disappointing in the lack of quality in this item. But I guess, you get what you pay for.", 
    "The metal looks good & is sturdy....but the faux plastic coated MDF looks exactly that. Plus with the slightest friction it flakes off to reveal white spots. Could replace that with actual wood & it would be nice. Small, just what I needed for staging small houses.", 
    "Extremely easy to set up. Looks great and I get a ton of compliments. It is very sturdy.", 
    "Love the look; fits great in small apartment. Just feeling \"eh\" about it. The \"wood\" is very noticeable in that it's NON-wood with a \"photo-laminate\" over pressboard (no coasters required). Both top & bottom pieces are identical in appearance - maybe they could have mixed up the \"photo laminate\" a bit for a more realistic woodgrain appearance? But hey, between a $500 * & * real-wood table, and this option for now, it works just fine. Add decor, and it's not bad! I'd recommend it, just finicky today I guess. :-)", 
    "For the price, this is a great purchase! I love the mixed media aspect and the color of \"wood\" for the top and bottom look great- it is more of a pale grey. I use this all of the time for staging. It is easily made to look modern or traditional. Great piece!", 
    "Easy to assemble and looks great!", 
    "lots of scratches on wood", 
    "I love this coffee table. Very simple look and light to move around as needed!. I love how i get the 'extra' table at the bottom for temporary stow away", 
    "This is a quite nice cocktail table. Like the under shelf for magazines and the top for serving. Easy to put together. Quality seems good.", 
    "Really easy to put together, had a few scratches on the base and top but nothing a retouching pen won't fix.", 
    "Excellent price and quality.", 
    "simple and elegant the wood isnt that good quality", 
    "Great little sleek coffee table, easy to construct", 
    "Looks good in my living room", 
    "Just perfect...price and quality for a college apt.", 
    "This coffee table is fine for the price. A little difficult to put together but I'm usually not good at putting things together.", 
    "this coffee table is soooo sturdy and but light to move around. looks great but it did come with a huge scratch, coffee table is so nice i don't want to fuss with returning it.", 
    "it's okay for the price you pay. not great but not bad either.", 
    "Good table for the price, seems very sturdy. The wood does look fake but is to be expected for such a cheap price", 
    "Very heavy, and very good piece", 
    "perfect addition to my livingroom. Looks just like the picture on the website.", 
    "nice size coffee table. fits perfect with chaise sides on sofa and in smaller room. easy to put together.", 
    "Very easy to assemble. Sturdy and solid. I use it as a wall table.Goes well with my hardwood floors.", 
    "This coffee table is great. It is easy to assemble and looks awesome. I would definitely recommend for rooms with lighter wood floors.", 
    "It took me fifteen minutes to assemble. Looks more expensive than what I paid . Arrived 3 days after I ordered it. Great job overstock!!!!", 
    "nice looking table yet it both sections had chips on the corners", 
    "My husband and I were looking for a coffee table to go into our little apartment and we could no be more pleased when we got it. It's stylish, durable and gets the job done. Also, you can't beat the price!", 
    "Wanted something that was not huge looking and making the walls closing in. Wanted something that would add warmth to the room. This is it. Like the second shelf on the ground giving more space to put things and still giving a open/airy feel to the room. Light enough to move on the carpet if needed. With care of course will like last forever. It was very easy to put together. It was money well spent."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Metal-Frame-Coffee-Table/9079827/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9079827/Altra-Metal-Frame-Coffee-Table-5069187c-346b-4e57-9ed5-35928ea7b3cf_600.jpg"
  ], 
  "description": "Maintain the open, airy feel in your home with this metal frame\ncoffee table from Altra. The open-frame design of the table allows\nyou to create stunning decorative displays that guests can see from\nany angle in the room. Ideal for small spaces, the open concept\ndesign of this table allows you to store similar items in an\norganized, cohesive fashion.Metal, paper and engineered wood construction provides\n  long-lasting useStriking metal finish is perfect for modern or industrial\n  stylesAvailable in your choice of Sonoma oak, cherry or espresso\n  finish to enhance your existing decorIncludes one table that is ideal for use within your living\n  room seating arrangementDimensions measure 17.72\"H x 41.34\"W x 20.87\"DSlim, sleek profile perfect for minimalist design\n  schemesVersatile design allows for coffee table or accent piece\n  useStyleContemporary, Modern, TransitionalMaterialLaminate, MDF, MetalTypeAccent Tables, Coffee TablesFinishEspresso Finish, Grey Finish, Metal Finish, Oak FinishShapeRectangleAssemblyAssembly RequiredColorBeige, Black, Brown"
}