{
  "name": "Altra_Rade_45\"_TV_Stand", 
  "price": "EUR 179.76", 
  "reviews": [
    "matches great with my coffee table", 
    "made of cheap pressed board", 
    "Although I love the look of this stand, it is not sturdy. Among construction, I slightly moved it and the entire leg ripped off breaking the corner piece of the wood.. I had to order a replacement part and rebuild it. It definitely cannot be moved around as it is cheaply constructed.", 
    "This tv stand is amazing for the price. Much better quality than what I was expecting and fairly easy to assembe. I love it."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Rade-45-TV-Stand/8230106/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8230106/Altra-Rade-45-TV-Stand-3a7b4fbf-b93b-4c85-8b9e-bafc7cb91747_600.jpg"
  ], 
  "description": "Spruce up your living room with this 45-inch TV stand from the Rade collection by Altra. Fashionable and functional, this TV stand brings modern flair to any room with its sleek edges and polished base. The black woodgrain design lends a timeless look to this piece, while the silvertone metal legs exude contemporary style.Made of durable engineered wood, metal and paperAttractive black oak and silver finishOverall dimensions are 24.02\"H x 47.24\"W x 18.90\"DTop shelf dimensions are 47.2\"W x 13.4\"DSturdy top shelf boasts a 100 pound weight limitOffers ample and versatile storage with open shelves on each side of the tableOne large open shelf is perfect for organizing media componentsHutch shelf lifts TV up for more enjoyable viewingAccommodates most flat panel TVs up to 45\"Rade collection companion pieces, which are sold separately, are great for putting together a coherent lookAssembly requiredStyleMid-Century, ModernMaterialMDF, Metal, Oak, WoodTypeStorage, TV StandsFinishBlack FinishAssemblyAssembly RequiredColorBlackNumber of Shelf5Weight CapacityUp To 100 Pounds"
}