{
  "name": "Altra_Rade_Black_Oak_Finish_Console_Table", 
  "price": "EUR 133.19", 
  "reviews": [
    "sturdy and holds a 40 inch flat screen, dvd player, cable box etc I like the sleek look that it adds to my living room space", 
    "Very easy to assemble! ! Instructions were perfect and even listed website has videos for help if needed. I didn't but thought that was a bonus if I did. Love the dark blackish finish. Only 1 small scratch on inside support wood. Bought for a tv stand in my living room. I will say it would make a lovely desk if your taller like me. Room in center for laptop.", 
    "We purchased this console table for our entry way. Perfect fit for the area needed and it has plenty of room on the lower shelf for additional storage baskets.", 
    "It took me forever to assemble and once done I wasn't too crazy about this piece especially since it is not sturdy enough...I bought it for the guest bedroom to hold a small TV. It does the job but it is definitely not my best purchase.", 
    "arrived promptly. Easy instructions and assembly. Looks nice", 
    "it's beautiful and looks very nice. Good material and easy .", 
    "Perfect for our mid century mod area, nice \"put together\" item! Good quality.", 
    "Very easy to put together and looks great in our office.", 
    "Bought 2 as side tables in a modern bedroom work really well as they have little side shelves that hide stuff :)))) Easy to assemble ! would give them 5 but both arrived with a slight ding on one piece but that part faces the back wall so no problems .Maybe packing could be a bit more substantial. Great versatile pieces", 
    "This table looks as good as it looks online as it does in person, if not better. It is very sturdy and definitely compliments my modern vibe that I have going on in my living room. I definitely love it.", 
    "very good quality and super easy to build! a must for sure!", 
    "I purchased this item for my home office. I needed a table that would be sturdy enough for a flat screen TV, with a shelf underneath for storage, and a unit that did not take up too much room. This fit the bill perfectly! The opening in the front was an exact fit for our cable box. We are very pleased.", 
    "Love this table it fits perfect in my entryway. I like the little storage areas also!", 
    "Good product easy to assemble, modern look and materials are all high quality", 
    "I have this table in my sunroom an love the cubby holes. Great to hide the remotes or magazines. Was well made.", 
    "It's beautiful and functional. Perfect size for what I needed.", 
    "It's just what I was looking for sleek design and stylish Fits perfect in the area II purchased it for Very easy to assemble I did it myself in 30 min I love it only issue was the screws with the alan key was hard to get the screw all the way in", 
    "I like that there is enough space to fit basket on the shelf and under! You can really maximize your storage with this console. It looks great behind out loveseat. I was amazed at how easy it was to put together.", 
    "nice sturdy stylish piece of furniture for the price. my first purchase with overstock. I quickly made 3 more.", 
    "The console table is exactly what I'm looking for. I was a bit worried about the quality as the price is cheap. But the quality is very good and it's very easy to put it up. Fast shipping and very nice product! Couldn't ask for more!", 
    "Easy to assemble (took me about 30 minutes from unopened box to finished table). The wood veneer has visible graining, which gives the finished piece a \"non-***\" look and feel. The finished table is sturdy and stylish and looks like it cost 2-3 times Overstock's price"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Rade-Black-Oak-Finish-Console-Table/8202539/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8202539/Altra-Rade-Black-Oak-Finish-Console-Table-154931ac-ac1a-4189-82ea-5706148a7dc4_600.jpg"
  ], 
  "description": "Add a contemporary touch to any room in your home with this\noak-finished console table from Altra. This black console table\nfeatures retro hairpin legs and clean lines, making it an ideal\naccent piece to any mid-century modern collection. Its open shelves\non the sides and front, as well as an additional bottom shelf,\nprovide ample storage space to help keep your living quarters\norganized and uncluttered. Lower shelfSide compartmentsMaterials: Engineered wood, metal, paperFinish: Black oak/ silvertoneDimensions: 30.08 inches high x 38.98 inches x 15.79 inches\n  deepStyleContemporary, Mid-Century, ModernMaterialMDF, Metal, Oak, WoodTypeConsole TablesFinishBlack FinishShapeRectangleAssemblyAssembly RequiredColorBlack"
}