{
  "name": "Altra_Owen_Retro_Stool", 
  "price": "EUR 51.43", 
  "reviews": [
    "I love it. I actually knew when I ordered it that I wanted to cover the top with marble-look contact paper and it worked out wonderfully! I'm using it as a low table next to a swivel rocker chair. It's great.", 
    "I bought it only because of the hairpin legs.I put the legs on ikea table top to use is as coffee table and it looks perfect.", 
    "Will get plenty of writing done here .", 
    "This little bench is a great accent piece for the MCM lover. Simple assembly and clean minimalist look. I love the look.", 
    "The legs are great, top is so so but looks alright.", 
    "Looks good. Well built. Quality built. Easy assembly", 
    "The stool chipped after we took it out the box", 
    "Perfect for small room . Matching desk is a great set", 
    "Purchased this stool with the desk. Really sturdy and updates my space!", 
    "Perfect match to desk. Good looking", 
    "Hard to beat for the price! Cute little stool with bright teal legs, easy to assemble and all parts were included. Not sure how comfortable it would be for a bench, however it is great for a printer stand!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Owen-Retro-Stool/9086625/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9086625/Altra-Owen-Retro-Stool-4d1c4132-96f7-4e24-8977-32885ebd1d1c_600.jpg"
  ], 
  "description": "Hairpin legs and retro-style make this stool from Altra Furniture a must have for those who have an affinity for all things vintage. Simple and fresh, this stool is sure to accent any room with unique pizzazz. Brand: AltraMaterials: Engineered wood, metal, paperColors: Black/red, espresso/tealDimensions: 17 inches high x 22 inches wide x 14 inches deepRetro-style stool with hairpin legsGreat for small spacesMatching Owen Retro Desk sold separatelyMaterialLaminate, MDF, MetalAssemblyAssembly RequiredColorBlack, Blue, Red"
}