{
  "name": "Altra_Owen_Retro_End_Table", 
  "price": "EUR 61.72", 
  "reviews": [
    "I recently moved and am going with an industrial style, with a rustic and modern feel. This end table looks the same in-person, as it does in the picture. It's a little larger than we expected but I didn't measure out the dimensions. Overall, great table for a good price!", 
    "Love my new end table. It's very stylish and has that mid century feel.", 
    "Looks awesome with the rest of the modern decor in my house. Exactly what I was looking for.", 
    "They look greet in the guest room", 
    "right size and fits my retro decor...used them in the bedroom as side tables by the king size bed.", 
    "Still loving them a year later!!", 
    "Just what I needed, easy to put together and enforces our FLW modern look .", 
    "We love this side table, its the perfect accent piece to our neutral colored couch. Its modern and simple! Assembly took 2 minutes and the quality is great.", 
    "Love the teal legs and dark top, has held up well for over a year!", 
    "As long as you go into it knowing that it doesn't even make an attempt to be real wood, it's fine.", 
    "I love these end tables. I bought two for our family room. The only complaint I have is it does scratch very easily and water from cups etc will damage it - but for the price you can't beat it!", 
    "Great size and bigger than many nightstands we've found. Color is very accurate and it's strong and sturdy.", 
    "I love these little tables in my modern living room.", 
    "Sturdy table. The color was not what I expected, lighter than I thought. Hairpin legs look cool. Overall, happy with it.", 
    "I have had so many compliments on this table. It looks so trendy, but is so affordable. You won't be disappointed!", 
    "I purchased two and placed them on either side of the sofa. They look great, sufficient space for a lamp and more. They look nice with my contemporary style furnishings.", 
    "I bought this end table and it looks great in my apartment.", 
    "Sturdy, affordable and easy to put together. I was unsure about buying this because I thought it was too cheap, but it works and looks perfect in my mid century living room. It is not real wood, but that doesn't bother me, because I don't have to worry about people putting cups/glasses on it without a coaster. Perfect for a house with kids.", 
    "Nice looking table! Well made. I like it a lot.", 
    "Really cute table... easy to assemble, look great.", 
    "Very nice very sturdy looking piece very easy to put together", 
    "The tables are exactly as advertised. Perfect addition to the living room, very well made , good looking, at a great price. Highly recommend them.", 
    "Easy to put together and looks great. Seems like a solid piece.", 
    "This table is so easy to put together (took me about 5 minutes) and looks so nice! Sleek and sturdy.", 
    "Modern and simple. Just right height. The first one came with missing screws and box was damaged but overstock immediately sent out another one. Great service.", 
    "I like this table. It looks good with my furniture. I'm glad I made this purchase.", 
    "Great quality at amazing price", 
    "Got the version with teal base and espresso top. Nice table, easy to assemble, holds a laptop or a lamp and coaster, and really great look.", 
    "These are nice looking and very easy to assemble. I am using them as bedside tables in a guest room so didn't need anything more.", 
    "Perfect small end table. Highly recommend.", 
    "I love these! Yes, you can use a modern table in a traditional home. I did and it looks great!", 
    "Love this table! I added gold rub to legs to up the rustic glam factor!", 
    "Easy assembly. Color is a nice gray/brown. It will work with either decor. I have it in a mainly gray room and it looks gray, but up against other decor, I can see this working with a more taupe color palette.", 
    "Perfect side table if you want to add a touch of mid century modern to your room. Easy to put together with a great look.", 
    "Came packaged well, looks simple, clean. Easy to put together.", 
    "Bought this for my sons room and it looks perfect with his grey walls, its adorable.", 
    "looks nice, went together easy. i dont know how long the top will hold up but can re-purpose the legs down the road if need be.", 
    "Perfect for the price. The table top was some sort of compressed product that damaged easily and warped in standing water ( like a glass of water left on table. Ring got mushy). When the top got too shabby looking i repurposed the hairpin legs by using them with an old teak table top..for a brand new retro look side table. Easy", 
    "This is so cool, it makes your home feel so retro. The furniture back then is so much cooler than todays", 
    "Simple design and easy to put together.", 
    "These tables are cute for what they are. I was a little shocked that they were square as the pictures makes them look rectangular. I would have preferred rectangular as a side table.", 
    "I really like this table. It is sturdy, the \"wood\" grain is interesting. The table does not take up any visual space, which is nice in our small space. Looks great with mid century modern decor.", 
    "Just what we wanted. Great price. A good size for an end table--holds books, a plant, with room for a cup of coffee.", 
    "I ended up returning. A little too simple. Didn't go well with my existing décor.", 
    "Very sturdy and practical.", 
    "Simple and easy to put together", 
    "We have a pair of these in our family room in our midcentury home. We mixed them with a modern couch and other midcentury pieces. Neutral light gray tops with black metal hairpin legs are worth the very low price indeed. Not fancy for a living room, but perfect for our family room. They are lightweight neutral pieces that blend well with our decor.", 
    "Unique style love the color and the modern look", 
    "I like this table but it came damaged on top. Very easy to put together.", 
    "Looks great but not very steady on hardwood", 
    "Just what I wanted. I was looking for anything other than brown, in this oak gray and black metal legs are perfect look for my living room.", 
    "I needed little end tables and these fit the job. The top is kind of blah but is ok with a candle and a vase on it. Someday I will get some old wood and use if for the top with the hairpin legs", 
    "The table goes well in my living room, easy to put together. Heavy wood top, I got 2 and they look great.", 
    "The product looked exactly as pictured. Not as substantial as I would have liked but it fit the bill for the space.", 
    "It is a good price. The legs look nice. I don't love the top.", 
    "Great item especially considering the price!", 
    "If you are looking for the least expensive end tables you can get, like I was , these fit the bill. They are sturdy and the neutral color will fit in with any room.", 
    "simple lines but can go with all kinds of rooms", 
    "Simple and functional. Good reasonably priced end tables", 
    "Its just like the picture. very easy to assemble", 
    "Just as picutred but the \"distressed\" top looks like a machine ran over it and made some repetitive marks. But with stuff on it like a lamp is just fine. Sturdy and easy to put together.", 
    "Small table for a small space. Easy to put together just add legs. Top is easy clean surface with gray tones.", 
    "Nice product for the low cost. Picture holds true to the actual product. Love the hairpin legs!", 
    "great looking and easy to put together.", 
    "Satisfied with this purchase - the tables are sturdy and basic, exactly what we were looking for.", 
    "This is a great side table for the price. I bought it for my new loft and it fits in really well with the industrial feel. The wood is not top quality but it doesn't look cheap either.", 
    "This is a good basic piece. The wood finish is very neutral and it looks like real wood. Blends nicely with my grey sofa and white lacquer pieces. For the price, you can't beat it.", 
    "These are more square than they look in the pictures, but like the style.", 
    "Very happy with our side table. It arrived quickly and putting it together was super easy. The color is more ashy gray than the pictures but we still like it very much!", 
    "I am a designer and just used this table for a short term vacation rental I designed. I love the teal legs as a pop of color. Modern and fun.", 
    "Great usually great price!", 
    "Item arrived on time, as described and it exactly what I was looking for. Easy assembly.", 
    "I was worried that this would look cheap but it looks great as a night stand in our guest bedroom. We paired it with the Emily Full Headboard and it looks very stylish.", 
    "makes nice first impression. easy to assemble", 
    "Got these for my living room, and they are perfect. Just the right size for a lamp and to put the TV remote on. good quality and good price.", 
    "Easy to assemble, sturdy and attractive. Looks just like the picture and fits in with our urban loft decor.", 
    "It is 5 pieces and simple enough. However if your floor is not level you will quickly know. I am still now sure if my floor is really off as much thi product says it is or if one leg is slightly at a different angle..It matches the Simple Living Seneca Grey set product line which is good to know as we were hoping it would.Not much more to say really. I guess if my floor was level it would be pretty sturdy..", 
    "The simple but unique design makes it a good fit for multiple aesthetics. One of the tops I had came in with a crack at the edge so I am waiting for a replacement. I guess that says something about potential longevity but it looks good and it will work for now.", 
    "Bought the ad a side table for my therapy office. It is a simple stylish design and serves its function. Does not hold weight so be aware. It works great to hold a few light objects and was a cinch to assemble. Would recommend", 
    "Simple and a great size for any extra side table. I bought the dark brown table-top with blue teal legs because for my daughter's room which matched perfectly with her blue and teal accessories. She love it and the legs are stylish and clean. GREAT buy.", 
    "Hairpin legs intrigue me, and I needed two tabled to set my speakers on. I could buy a set of 4 legs from *** for ***, buy some plywood, and attach them. Or I could get this table, which has an MDF top, but the legs would be painted. Hairpin legs are hairpin legs, right? Wrong. Every other table I've seen in the market is made from cold or hot pressed steel. Not these Owen Retro table - these are hollow and weigh a few dozen grams per leg. Also, the angle on each is not correct, and so when assembled, the tables wobble. Save yourself some hassle. Get a sheet of plywood from a local hardware store and buy some hairpin legs from ***. The resulting assembly will be 100x better than this rubbish table.", 
    "The table was just as the picture showed, no surprises. It is a very nice table and the price was very good.It makes a nice addition to my retro den!", 
    "Easy to assembleGreat table for the moneyHigh quality.", 
    "LOVE the color of this \"wood\"--its a grayish/brownish rustic color almost. The legs look really nice too. The piece was not too big or bulky which is what I fear a lot of times when ordering online. The picture was very accurate. Easy to assemble. LOVE IT -- couldn't be happier.", 
    "Great Modern Side Table and a great price. Easy to put to together.", 
    "Love this little table! It goes so perfectly with our modern-styled living room. It's such a great value, too. My friends keep going, \"where did you GET that!\". It's just perfect for our space and truly accents the sofa set rather than overpowering it like a lot of table sets do.", 
    "While the table appears to be nice, I'm sending it back before assembling because the top really is more of an oak color than the gray color shown on the website.", 
    "I was actually looking for just the legs which would have cost more to purchas. I go tht etable and the legs for less and much faster than I expected. It is great value", 
    "Not high quality, extremely easy to build - comes with top and legs and screws. My 10 year old built all these Owen pieces himself. It looks like dorm or first apartment quality, not for a family."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Altra-Owen-Retro-End-Table/9079812/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9079812/Altra-Owen-Retro-End-Table-0b3da4a0-1be1-447f-bbeb-d54bd073a6c7_600.jpg"
  ], 
  "description": "Take a step back into a more stylish era with this whimsical Altra\nOwen Retro End Table. Thanks to its open design and space-saving\nconstruction, the metal end table fits in well in even small\nspaces. Use it as a resting place for your favorite cocktail, or\nadd a small lamp to create a cozy reading area.Enhance the enjoyment of your living space when you place\n  this functional end table next to your cushy sofa or coziest\n  armchair.This piece gives you a practical surface for setting down a\n  beverage or book or maybe displaying a plant or two.Durable materials are used to make this handy table, ensuring\n  stability and lasting use.Materials: Engineered wood, metal, paperFinish: MetalColor: Sonoma oak/ gunmetal grey, espresso/ tealIncludes One (1) tableDimensions (overall): 22 inches high x 19.49 inches wide x\n  19.49 inches deepRetro-style end table with hairpin legsUse as an end table or accent pieceCoordinates with additional Owen pieces (sold\n  separately)StyleContemporary, Modern, VintageMaterialLaminate, MDF, MetalTypeAccent Tables, End Tables, Side TablesFinishGrey Finish, Metal Finish, Oak FinishShapeSquareAssemblyAssembly RequiredColorBlue, Brown, Grey"
}