{
  "name": "Astro_End_Table", 
  "price": "EUR 259.90", 
  "reviews": [
    "Color was more mid- cherry than darker color espresso that I was expecting. But we had both colors in office so it worked.", 
    "I bought this third piece in the Astro collection for the retro look, ease of assembly (only have to add the legs) and sturdiness yet casual. P.S. I turned mine sideways between the recliner and couch so I can access the mags and remotes I store in it. The other two pieces are the media center and coffee table, both of which I'm using for TVs in different rooms.", 
    "The tables are cuter than I expected and were very easy to put together (only the legs need to be attached). They look great with my mid-century style sofa. The only disappointment I had with the purchase is that they are a little lighter than I expected from the photos, more of a cherry with a slight reddish tint rather than a dark brown as shown in the photos. So, they don't match the rest of my furniture, but I think I will keep them and stain them darker.", 
    "I was initially hesitant about these tables because they look a bit more fiber wood from the pictures (and smaller). Was really happy when I took the main piece out of the box. Not sure what type of wood it's listed as, but it looks great (and rich). And super easy to put together.The tables are also bigger than I was thinking they were. Happy.", 
    "Very nice piece, great price, fast shipping! Thank you Overstock!", 
    "Its a great accent for a room. I placed a wooden grain cut out tray on it, i set my keys, and charge my cellphone on it, along with a wood wick candle. The inside i leave empty to create a minimal mid century- modern look in my room. its ultra clean and the perfect height and size.", 
    "You will love this Astro End Table! It is a very sturdy and high quality piece of furniture. It goes so well with my retro decor!", 
    "These are just great end-tables. I was afraid they would look cheap because they are not 100% wood but they look great and go well with our furniture. Simple and functional design. Very well made overall for the price, in fact I think they are a good buy for the dollar amount. They are surprisingly sturdy even on carpet, but just be careful, these are not heavy like real wood blocks so there is some shaking if you push them. The color is a rich brown/red color vs the mocha brown in the photo, which I actually think is better. Pretty good surface area for items. The legs are not too industrial or overwhelming. The only thing we didn't think of was that because it is hollow, if you put it up against the wall, it will showcase your electrical outlets if they are present on your wall. I say showcase because you can't help but notice the outlets in the hollow frame. So be prepared to put something there to hide it, or put the endtables in the middle of the room.", 
    "I had reservations spending this much on an end table, but it's sturdy, built with reasonable quality wood and goes great with our modern-to-midcentury aesthetic. The legs are the only assembly one has to do, and that's very easily and quickly done!", 
    "LOVE this table! Bought it for my office and get so many compliments. It's sturdy and such a nice funky shape. Folks say the shape reminds them of an old TV from the '50s or '60s.", 
    "Very nice piece. Heavy and sturdy. Only legs need to be attached on arrival. Great mid century feel!", 
    "Looks fab with mid-century furniture. Very easy to assemble.", 
    "A little smaller than I would like with my furniture, but for most would be perfect. Good value", 
    "Good quality modern piece. Easy to assemble. Looks great and easy to maintain. Happy with the purchase.", 
    "Perfectly fits my style and was easy to assemble. I love the clean lines and industrial detailing in the wire legs.", 
    "Love this table. Looks fabulous with the mid-century modern look I have going on. great piece.", 
    "the whole things looks like an \"old TV\", great quality and very appealing. The size is slightly bigger than expected, may serve as a coffee table. Assembly was super easy, packaging was great. Very pleased with the purchase.", 
    "Simple assembly, feels solid, looks great with the rest of our mid century furniture.", 
    "The table arrived quickly and very well packaged although the packaging excessively used Styrofoam in my opinion. Maybe a friendlier source could be used?The table is very well built and substantial and the quality is impressive. Easy to put the legs on and good directions should you need them.Groovy!!", 
    "Beautiful end table. Just want we wanted.", 
    "I got rid of our entertainment cabinet tower when we moved into a mid-century modern house. This end table was a perfect fit for my stereo receiver, blu-ray player, AppleTV, & HTPC. Perfect minimalist furniture. I was surprised by how much you can put inside of it.", 
    "The table seems larger in rel life than the photos but because it is so airy, the scale is great. Perfect addition to my mid-mod room", 
    "Delivery was prompt. Product was well packed. The wood used and how they were joined was done OK. The overall simply was easy as was the appearance was great it fits and nice with our decor.", 
    "Love this! It's high quality and adds something unique to my living room.", 
    "So glad that I made this purchase!", 
    "I am very pleased with this purchase. It was very easy to assemble and looks great. I'm going to buy a second one!", 
    "I live in a house built in 1958 and love the mid-century modern look. These are perfect. They are sturdy and look high-end. People think they are original pieces from the 50 or 60s.", 
    "This is the perfect nightstand with my MCM decor, a close match in color to a vintage walnut bookcase I own (my iMac monitor is showing it quite accurately). Well packaged and easy to assemble: it took me about 20 minutes to unpack and attach the legs. Very well made at this price point.", 
    "Still in great condition after a year of use", 
    "These are very substantial in person and very easy to assemble. I have them as side tables in my guest room. They really make a great accent without being kitschy.", 
    "Very pleased with this. It looks better in person.", 
    "These side tables stand out while providing a lot of surface and so easy to build.", 
    "Really cute shaped end table. Easy assembly, good height for a lamp.", 
    "We ordered two of these end tables for our office reception area and they are great. Very high quality construction - heavy base makes them feel substantial and much more expensive than they were. The shape fits our retro style perfectly. These look great with the Engage 90.5\" sofa with cherry legs.", 
    "Great Table for the price, especially. Very study, easy to put together (just attach legs) - everything fits together perfectly. Very clean lines - very well made.", 
    "different...... was looking for retro and it fit the bill", 
    "This was the perfect side table for the mid-century modern look we're going for. Assembly was easy.", 
    "The design is cute but it's somewhat bulky. Easy to put together.", 
    "The table is nice but the color isn't the same as the picture. Other reviewers have described is as a rose color, which would have been okay. Mine showed up and is more of a gold... I'd say it is as light or lighter than the floor color in the description picture.", 
    "Great product and good quality", 
    "It's beautiful! I'm so pleased with this purchase I ordered the matching Coffee Table as well. Looking forward to seeing the two of them together.", 
    "Love it, easy to put together and fits wonderfully in my living room!", 
    "This table looks nice, however the color is NOTHING like in the picture. It appears a dark espresso brown online but is actually a cherry finish. It's much lighter than the picture and to top it off, one of the legs was over an inch longer so the entire table was lop sided. Highly disappointed.", 
    "I bought the coffee table and the end table together. This feels like solid furniture. If it's veneer, it's a pretty good quality veneer - it would have fooled me. It has a very slight wood grain texture that looks a little bit \"plastic\" or embossed, but other than that it's totally acceptable as far as veneer goes. My biggest disappointment is that the photo on the website does not accurately reflect the actual color. I expected a dark brown walnut-like color, but it's much redder, like a dark cherry. Also, the coffee table looks smaller in person than on the website.", 
    "Very attractive, good quality, easy to put together. Makes me smile every time I look at it.", 
    "If you're looking for something unusual, this is it. Quality in line with price. Easy assembly, well packaged.", 
    "Came well packed, and very easy to assemble. I loved the tool included so Ididnt have to break out the tool box.", 
    "I bought the table for the waiting area of my office, it looks great with the two new chairs I bought from Overstock."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Astro-End-Table/7501953/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7501953/Astro-End-Table-adb10c36-478e-4eb6-81b4-45b8c55a993e_600.jpg"
  ], 
  "description": "Add a mid-century aesthetic to your home with this Astro square end\ntable. The smooth lines and soft corners on this walnut-finished\nend table exude a retro feel that looks great with a variety of\nhome decor. The legs feature a scratch- and mar-resistant\npowder-coated finish that lasts for years. The innovative design of\nthe shelf remains open on both sides to allow for quick and easy\naccess to stored items. Product features: Sturdy construction, retro design, rich,\n  medium walnut finish on table, scratch and mar resistant charcoal\n  grey powder coat finish on legsShelf for storage, matching coffee table and media center\n  sold separatelySet includes: End tableMaterials: Steel wire, MDF, wood veneerFinish: Medium walnut wood stain, charcoal grey powder coat\n  finish on legsDimensions: 23 inches high x 23.25 inches wide x 19 inches\n  deep       StyleMid-Century, Modern, VintageMaterialMDF, Steel, Veneer, WoodTypeEnd TablesFinishWalnut FinishShapeSquareAssemblyAssembly RequiredColorBrown"
}