{
  "name": "Astro_Coffee_Table", 
  "price": "EUR 281.56", 
  "reviews": [
    "I am pleased with this new coffee table. I expected a certain degree of quality for the price and am very satisfied with it. The oval shape is goes well with my mid-century decor and is unique. The table is study and best of all, super easy to assemble. All you have to do is attach the hairpin legs. It took me about 15 minutes.", 
    "The first table was damaged, have to say Overtock did a great job of getting me a replacement very quickly. Its the look I wanted for a staging job and for that it was a good buy.", 
    "Overall good (not excellent) coffee table for the price. Cool mid century look. It's perfect for our decor. My only issue is the \"joints\" where the table connects its flat pieces to its rounded pieces. Its seems a little weak. Weak as in I wouldn't put my feet up on it OR anything heavier than 10 pounds.", 
    "This is a great, sturdy table. It feels very solid and looks like a way more expensive product. Very easy to put together, just attach the legs. I use it as a TV stand instead of a coffee table.", 
    "Love, love, love it!! Excellent table, arrived on time and looks so modern. I have been searching for months and I very happy with this purchase.", 
    "This table is so funky and cool and looks awesome in my living room ! Seen elsewhere for much more money... this table is an excellent deal!", 
    "I purchased this table to use with my mid century furniture. It is not very well made. The stain was uneven one curve very light the other ok. I did not like the legs although another reviewer said they were ok. I did not put them on my table. I thought it looked clunky. I like the style in the pictures but was disappointed. I returned it.", 
    "First of all I tracked my purchase, which I've never done before. Overstock made it very easy. Second, the ** driver was kind enough to carry it up the stairs for me. Thirdly, I couldn't be more pleased with my Astro coffee table. I live in a condo and the size and weight of the table is absolutely perfect. The color was the same as the picture. I've purchased two other coffee tables over the years made of glass and wood. They were too big and heavy and the gaps between the glass and wood always had to be cleaned out. And I always regretted the purchases. However, this Astro table is beautiful and perfect and the price was good.", 
    "This is a nice quality and a really cool look- I get lots of compliments on it", 
    "Sturdy, very easy to assemble. Great table!", 
    "I bought this after buying the media center and finding it was retro looking, yet new, sturdy and very easy to assemble with the provided hex tool. I used the media center for my larger TV and I'm using this coffee table version in another room for a smaller TV (an idea from another reviewer...thanks). Good value.", 
    "The Astro coffee table and matching end tables were our first purchase for our mid-century modern living room make over. They look great! Very pleased with this purchase. Our guests always admire them!", 
    "Purchased this coffee table a couple of years ago for my mid-century office sitting area, which gets very low usage. It looks great and is exactly as pictured, but I wouldn't expect it to hold up to frequent use.", 
    "It is a nice table. Slightly smaller then expected. Color is very nice not reddish. And I wouldn't bank on the sturdyness", 
    "I have no complaints about this table...very pretty and easy to assemble!", 
    "I looked for months to find the right look/price and this was by far the best deal I could find for a modern-looking coffee table. I was a little bit worried by the other reviews that it would be too flimsy. It was SO quick and easy to put together, and definitely durable enough for a coffee table. It looks fantastic and is exactly what my den needed. I'd definitely recommend- great deal and great table.", 
    "Great design, good quality. Only gripe - the wood is a bit soft, hence scratches easily.", 
    "Works for its price.aaaaaa", 
    "Pretty much says it in the title of my review. The thing looks retro and like one of those little alien spaceships from Batteries Not Included. Love the table. Came out way better than I anticipated. Super sturdy and solid. Doesn't feel cheap in weight and is oozing with all the mid-century feels you can ask for.", 
    "Simple assembly, feels solid, looks great with the rest of our mid century furniture.", 
    "Love this piece, was a bit smaller than I had expected, which actually worked out for the best, in my cramped space. Been getting lots of compliments, sturdy industrial meets modern but retro feel.my fiancé and I love it!", 
    "Easy to assemble. Came with damage to the finish and had to use a furniture market to fix it a bit. Still noticeable but going in the finished basement and you get what you pay for. Nice style for the price.", 
    "Really like the coffee table. We are using it as a TV stand and it looks and works great. Super easy to put together, took about 8 minutes. We had so many compliments on it, we ended up purchasing a matching end table", 
    "This was my first furniture order from Overstock and I have to say that I'm impressed. This coffee table is nicer than I thought it'd be. I was expecting a light composite wood but it's actually quite heavy and sturdy. Everything arrived in perfect condition and it was very easy to put together. Highly recommended.", 
    "Great quality, easy assembly of the legs and very handsome", 
    "This coffee table is sturdy and unique. It's just what we were looking for.", 
    "look stylish and durable . Easy to put together", 
    "Just screw the legs on and you're done. Finish is really nice and the shape and height is perfect.", 
    "Ok, it isn't the highest end table, but has huge style for the money and the size is really good and NO sharp corners for tiny residents", 
    "So glad that I made this purchase!", 
    "ontime, perfectly packaged, easy to assemblethe color is lovely and the table is quite firmis much better quality than i expected", 
    "This is a nice table, but it is smaller than I imagined. When you clean it the coloring comes off a little.", 
    "The color is great, looks very well made. Very cool coffee table.", 
    "it's unique and solid. Cool table to change things up", 
    "I am very pleased with this purchase. It was super easy to assemble and looks great.", 
    "Fun and functional. I bought this because I love the mid-century modern look, but didn't want to spend $$$ for high-end antiques. People mistake this for an original piece from the 50s and 60s. It's sturdy, easy to assemble and looks great in my groovy pad.", 
    "This coffee table is everything it says it is. It fits well in my space, color is good, and it was easy to put together. I'd buy again.", 
    "I get more compliments on this than anything else in my living room. Very cool, mid century modern!", 
    "I like this table and it was very easy to assemble but....there was a big scratch just barely on the underside...actually on the curve to the underside....that looked like someone had scribbled over it with a magic marker. Come on....if you know its badly scratched...don't send it out!", 
    "Unfortunately the table was delivered damaged. The box was open and ripped and the table was not packaged properly. No bubble wrap or Styrofoam to protect it; so the black tray was ripped and torn. I called wayfair and the company refunded me .That's good customer service, thank you!", 
    "The top wood stain didn't match at all with the side wood stain panel. The stain applied looked really cheap.", 
    "Love this table, so modern and unique", 
    "Love the design. The color is a little more red than stated.", 
    "Still in great condition after a year of use...well built", 
    "Unique piece. Good quality.", 
    "Well packaged and great product. Looks better IRL.", 
    "I was worried that this might be too big for my smaller living room, but it's perfect and it looks really good. A breeze to built, just screw on the legs and that's it!", 
    "exactly as you expect, kinda fun kinda retro", 
    "SO CLASSY and MODERN. Love the style", 
    "looking for retro and this fit the bill", 
    "honestly the cutest, easy to build.", 
    "I ordered the whole set - coffee table, end tables and entertainment. Arrived packed well, easy to put the legs on and seem sturdy enough. I am happy with all. It gives my living room the retro look I was going for, tying in with some actual 50 year old pieces I recently acquired,", 
    "Ordered it on Thursday in my living room Friday 1 day delivery amazing/the top is covered with what looks like a nice wood veneer .The color is just a little lighter than in the photo more cherry than the mahogany look ,but it looks great,", 
    "Great product. Good quality", 
    "I love this table ! Its perfect for my apt the color was a little more orange tone to it .I was expecting chocolate table but it is still beautiful.I plan to purchase the matching end table soon.", 
    "This is definitely not a walnut finish, more like cherry with orange tones!", 
    "great table! Fit well with the couches", 
    "I bought the coffee table and the end table together. This feels like solid furniture. If it's veneer, it's a pretty good quality veneer - it would have fooled me. It has a very slight wood grain texture that looks a little bit \"plastic\" or embossed, but other than that it's totally acceptable as far as veneer goes. My biggest disappointment is that the photo on the website does not accurately reflect the actual color. I expected a dark brown walnut-like color, but it's much redder, like a dark cherry. Also, the coffee table looks smaller in person than on the website. Get out the tape measure to be sure you know what you're ordering. I didn't measure, and I thought it would be larger.", 
    "We love this table and the side table to match as well. The finish is beautiful, coppery with a shimmer that you don't see on line. It was easy to put together, just add the legs. It is a nice open design, and smaller than many tables, which is just what we wanted. Perfect for a smaller sized room.", 
    "I would definitely recommend this table to anybody that likes modern furniture.It comes as one piece in the box and only the legs need to be assembled, which took 5 minutes.It is very sturdy and feels solid. Excellent deal for the price.", 
    "I love it. It looks both contemporary and retro, and ties together different styles in my living room. The wood grain is beautiful. I love the clean lines and the shelf inside. I couldn't tell in the photos, but the wood is definitely more of a cherry color. I thought it would be closer to walnut, medium brown, but it definitely has red undertones. Assembly was easy. The table is in one solid piece, and you just have to screw on the legs using 12 screws and an allan wrench. As for its projected durability: It creaks a tiny bit when I put my feet up on it, but it seems very strong regardless. I AM nervous that I will damage it though ... I have to be careful to ALWAYS use a coaster, and to not stand on it to clean my ceiling fan, as I did with my old concrete coffee table!! If you have kids, you may want to shop for something more robust.", 
    "I am very disappointment .This product is looking much better online. Color is different and I am very unhappy about this product .", 
    "The table is a great shape and very sturdy. My only complaint is the color is a little off. It is much more red than expected. Looks like a cherry rather than a walnut finish. Still a beautiful color. It just doesn't match the other walnut in my house at all. It shipped really quickly.", 
    "This coffee table is heavier than it looks but easy to put together (once I followed the enclosed instructions). I've literally been looking at coffee tables for 3 years online to find something interesting and utile. And it looks good on the orange moroccan rug also ordered from overstock."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Astro-Coffee-Table/7501952/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7501952/Astro-Coffee-Table-def5e5d7-64d3-4c56-b7f3-cf8d2100ecac_600.jpg"
  ], 
  "description": "If you enjoy furniture with graceful, elegant curves, this piece is\nan excellent choice, as it combines straight lines and soft angles.\nResting on four sturdy legs with definite architectural virtues,\nthis retro modern coffee table brings together flat surfaces and\nempty spaces, offering plenty of room for decorative items without\ntaking up too much space. Product features: Sturdy construction, retro design, rich,\n  medium walnut finish on table, scratch and mar resistant charcoal\n  grey powder coat finish on legs       StyleContemporary, Mid-Century, ModernMaterialMDF, Steel, Veneer, WoodTypeCocktail Tables, Coffee TablesFinishWalnut FinishShapeRectangleAssemblyAssembly RequiredColorBrown"
}