{
  "name": "Baxton_Studio_Glidden_Dark_Brown_Wood_Multi-use_Cabinet", 
  "price": "EUR 95.83", 
  "reviews": [
    "We were looking for specific dimensions as shoe cabinet had to fit in to our foyer closet - it had to be just the right hight and length so this cabinet fit the bill. It took about 2 weeks to rcv the item(shipping to Montreal) and once we got it it was super fast and easy to assamble. Shelves are easy to add/remove to accommodate shoe hight (which came in handy as most of my shoes are high tops)The item is exactly as shown on line and seems to be of good quality, nice and sturdy, I definitely recommend it !", 
    "I received it and put it together yesterday. Just as how other reviewers mentioned, it didn't come with any instructions so I had to find one online (just google by product name/product code). Once I had the instructions, it was not that difficult to put together.For the price, it is quite a nice product. One thing to note, is that the shelves don't give enough height to put heels in. I don't wear extremely high heels - no higher than 3 inches - but they do not fit on any of the shelves so I had to remove one bottom shelf. Bummer.", 
    "So first of all I want to say that this cabinet is beautiful as it is functional. It really makes a nice accent over the typical shoe rack. It has tons of space and is a great height. Not too tall, not too short. It's arms reach for us to grab things we leave on it. It did wobble a little because the feet were not the same lengths but I stuck three pennies under the shorter one and problem solved with no tacky looking fix. Now I do have to say that while this isn't exactly Overstocks fault, the carrier by which this cabinet came, FedEx, was the worst delivery experience. It took them a week longer than predicted delivery, claiming my address couldn't be found, even though it's a verified apartment address where multiple carriers deliver to everyday. They delayed it, said they were going to charge me for a delivery exception, to which I said \"no way you are authorized to do that\" so I wasn't charged. This thing is heavy for me, weighing about 50 lbs, so I had to carry it from the apartment office to my apartment even though he entered that he put it at my front door. Oh, and before he actually got his stuff together and found the apartment, he claimed he tried coming on a Friday, but that were were there. We were here all day and night Friday and no one came! FedEx sucks big time. This cabinet, however, is a great buy!", 
    "Good quality. I think this is definitely worth the money.", 
    "It's a little on the pricey side, but I had been searching for a place to store my shoes and this was the best option I could find. It hides my shoes, fits in with the rest of the funiture and replaced the side table that needed to be replaced. I would recommend it. Loses one star for the price.", 
    "Came with easy directions and took under an hr to put together, looks great", 
    "I had tremendous hope for this after had back to back wonderful experiences. However, not all companies the same. With this manufacture, We had such horrible experience. Poor labeling (faded marked letters on the wood vs stickers) Quality of manufactured wood is literally sawdust. Poor instructions, holes that either don't match up to the matching dowel inserts. Or holes that should be there when it wasn't. Further, holes that are too small (but because the wood is sawdust, you can create holes if need. The worst part, because of the poor labeling, they drilled the holes in the wrong section themselves and the shelves or panels are backwards). As they say, garbage in garbage out. I hope I can get a full refund and on a note, because I still love Overstock, I will be looking for another shoe cabinet with another manufacturer and perhaps with the companies I have 5 star ratings on other purchases", 
    "I love everything about it matches perfectly with everything else I have in my livingroom", 
    "Nice color and details. A little smaller than I thought but does the job", 
    "good quality and it looks great in my bathroom", 
    "This was actually easy to assemble and due to the low cost I hadn't had high expectations but they definitely exceeded them. Its looks really great in my apartment, is sturdy, and is exactly what is pictured. I'm enjoying it immensely and would highly recommend.", 
    "work well in my bad room for a over loud of shows in the closet.", 
    "I wear men's size 12 or 13 shoe, and this cabinet is deep enough for me to house my shoes! If I had room for another one, I'd order another!", 
    "I ordered this cabinet and I love it! My friends love it and now my Mom has ordered it! So pretty and handy to hide my shoes by the front door. Looks pretty and a great price! Love it!", 
    "Perfect ,great size. Love the dark color", 
    "I seen this and thought prefect! And receive it and was disappointed. I planned on putting my TV on it, but that wasn't going on o work. I decidedly to keep it to store my movies in it. It looks somewhat cheap but it will work.", 
    "Performs as expected. We needed it for our foyer to hold shoes. It keeps the area looking neat and tidy. Easy to put together.", 
    "Great quality and so useful! Its such a nice way to keep shoes downstairs without them actually being seen!!", 
    "I actually use this as a TV stand and put DVDs and other related items on the shelves. It only took around 1 hour to put together. The product looks great. I am also happy with Overstock delivery and process.", 
    "Perfect for shoe storage, and keeping our puppy away from the shoes!", 
    "Love it!! Asembling was a breeze. It looks nice worth it", 
    "I received my cabinet on time. It was very easy to assemble and is solid and sturdy. I will use it in my living room where I need a bit more storage space. I'm very happy with my purchase and I would recommend this cabinet to anyone. Btw, I love the dark, rich brown finish.", 
    "Easy to assemble. Beautiful cabinet. Great value. Only issue is that the right door is off slightly and sticks.", 
    "It looks cute and fit in the space that we have", 
    "Love my shoe cabinet wish I would have order a bigger one.", 
    "This is great!! Looks really good and hide all the shoes. The only thing I do not like is that the shelves are loose inside so sometimes they fall down. Otherwise perfect.", 
    "I bought this small cabinet for extra storage in my dining room it does the job, price is fair and it look very suffisticated, I love it!", 
    "This was easy to put together and looks elegant for the price.", 
    "This has been the perfect show holder for our 3 kids. Finally we have cleared the mess by the door! They each have their own shelf plus 1 to spare. It is easy to open and looks beautiful. Very well built that it is withstanding the grips of my kids! Highly highly recommend!", 
    "love it easy to assemble well worth it!", 
    "I really like this shoe cabinet because it definitely cleans up my shoes area. Details and usage well described . It looks good for the price. It was easy to assemble.", 
    "Poorly made, cheap cabinet. Would not buy again, especially at this price.", 
    "I was very happy with this product. It was easy to build. The colour was a rich dark brown. The shelves are sturdy and easily fit my husbands large shoes. Would recommend this product to my friends.", 
    "Fast Delivery, and it looks fabulous!", 
    "Products fit description and works well. Happy with purchase. Solid for price", 
    "Very much satisfied with the product. The assembly might have been a little easier.", 
    "Confession time: I didn't purchase this shoe cabinet as a shoe cabinet. I purchased it as an interim entertainment center so I don't have to drop too much money or put holes in my apartment walls. I thought from previous reviews that it would come fully assembled, so was baffled to realize upon arrival that it would require assembly. I'm not good with tools, but it really didn't take much to come together. And a plus to me needing to assemble it is that I was able to leave the back off so that all my electronics can breathe!", 
    "Looks just like the photo, not solid wood (like ikea wood), obviously for the price. Pretty easy build, I got 2 of them and they look great sitting right at the bottom of my window cil. The doors shut evenly and nothing came out lopsided which is important! All the tools and pieces fit together and side by side they run seamlessly like one unit.", 
    "I bought this knowing it is MDF and a thin laminate but it exceeds my expectations. I needed a cabinet to hold miscellaneous items and decided to order this. I wasn't looking for a fine piece of furniture just something that would do. Well, a pleasant surprise arrived today. Instructions are minimal but if you lay the pieces out and follow the pictures you can get it together quickly. I have put enough of these types of pieces together throughout my life so I know the pitfalls. I do suggest using a little glue along with the wood dowels just for added stability. It is a nice looking piece of furniture. I am actually thinking about two more. Color is accurate to picture and actually the picture doesn't do this justice. If you are looking for a bring it home in a box furniture items this is worth a look. Shipping was very quick ordered on Thursday and it arrived Saturday. Well done Overstock much appreciated.", 
    "This shoe cabinet is designed and is very easy to put together.", 
    "Easy to assemble. Nice looking piece.", 
    "nice little cabinet, easy to put together. as expected by the description", 
    "I am so upset. This was impossible to put together and directions were impossible to understand, I tried my hardest but the wood shattered in several places and many of the screws did not fit. I don't believe the pre drilled holes were drilled deep enough and nothing seemed to line up. Honestly, I am so upset about this piece that I'm not sure I will be ordering from Overstock again.", 
    "Good for the price. Pretty easy to assemble.", 
    "The drawer itself is not bad looking, but the quality (pressboard) is a little on the low side. The spaces between the sections are very narrow (can't really fit ankle boots for example).", 
    "I love this in my closet.", 
    "Great look & very useful!!", 
    "Nice, easy to put together. Worth the money.", 
    "Not to sturdy but other than that it's nice", 
    "We wanted something to give us some more space in the kitchen. We got this because it looked beautiful in the pictures, much nicer than a microwave cart. It has a good amount of storage space and frees up counter space as we were able to put not only the microwave, but also our sugar, flour, and tea canisters on top as well. Very easy to assemble. I would recommend this to anyone, unless I didn't like them and wanted them to get a bad one.", 
    "This shoe cabinet fits my space perfectly. It is a great color just as shown and the doors are nice to hide all the shoes inside; however, I was unable to get the doors to line up exactly straight after assembly so one door is not perfectly aligned. They still open just fine.", 
    "Deep enough to fit size 14 men's shoes.", 
    "We did not purchase this for shoes -- just needed a cabinet of this size for lightweight storage on an enclosed porch. You get what you pay for, and our expectations weren't for high-quality. It was a bit disappointing that the holes for the shelf supports were not drilled in the proper places, which made the shelves unstable. Also, some of the hardware was missing. However, drilling new holes and scavenging through our collection of odd screws solved most of the problems. The doors will not withstand any pressure from the top (i.e. don't lean on the door when you bend over to see what is on the back of the shelf)) without popping off. Also, the outside edges of the doors are not stained, so we will need to paint them because the edge looks like an outline around the darker finish on the door. Size and appearance are as described.", 
    "Easy to assemble. Would buy more if I had the space!", 
    "Easy assembly, compact piece of furniture, good for a small entryway, holds about 12-15 pairs of shoes", 
    "I know the price if cheap but I bought stuff for that kind of budget at Ikea or other, that were much better. The manual is so unclear, the hardware is really not good and the cabinet overall is made of cheap stuff. Duh, I guess. Won't last too long I bet. Don't buy.", 
    "Great price, exactly what I needed. Looks nice and keeps my entry tidy. Would NOT recommend for first time assembler; instructions not very clear. Pre-fab holes for dowels and screws weren't lined up to exactly match, so needed to be a bit creative. Good thing that I've assembled many pieces over the years and know how to \"tweak\" a little here and there. If you can do that, it's a great value.", 
    "I really wanted a shoe cabinet that looked like a piece of furniture that matched the rest of my decor. This storage cabinet is perfect. It fits tons of shoes, looks great and was a great price!", 
    "It looks nice for what I'm using it for, however, it's not cut evenly. One side is higher than the other and it is very woobly. I had to place cushions on the bottom to make it even. Kind of disappointed. The price was reasonable, but the quality could have been better.", 
    "Purchased this for my office for a tea station and it's great! Easy to put together - though I do think they should look over the instructions, the drawings are missing some details.... nothing you can't figure out :) Great, deep color and easy to move around.", 
    "love it. Cheapest online and you can fit around 15 pairs of shoes. very easy to assemble. Takes around 30 minutes.", 
    "Exactly as described and exactly what I needed. It is beautiful and was simple to put together.", 
    "Great shoe cabinet. Looks great and fits a good amount of shoes. The shelves are adjustable. Love it and great price! I shopped around for a long time before finding this one.", 
    "We don't wear shoes in the house so I was looking for a closed, appealing looking unit to store shoes and outerwear accessories upon entry.. Although the unit is not made of a high end wood, for the money, it makes my entryway look nice and neat. No more shoes lined up along the wall. It fit perfectly under a coat hook unit and has enough space for a family of four to leave footwear worn often like sneakers and boots nearby, but tucked away out of sight. Unfortunately it does not come assembled, so it is a bit of a tedious task to put together. Once it's put in place, you'll be glad you have it.", 
    "Solid cabinet, easy to assemble. Great value. To bad the hardware package was missing 3 pcs of Shelf Support.", 
    "love my cabinet and it is exactly like in the picture. But after i purchase it i found it in another link for less(******)..", 
    "Wife loves it. Now our foyer is tidy and well kept. No more wayward shoes. Fits perfectly in a tight spot", 
    "Easy to assemble for anyone. The only thing I don't like is that it isn't very tall but its useful.Thanks for asking", 
    "I really love the shoe cabinet, the price is really cheap even compare to the same product from Amazon! free shipping and nice design.", 
    "Solid choice for light weight storage. The assembly instructions are ridiculously terrible, use them sparingly, they do more harm than good.", 
    "It was right size for my 1 bedroom condo. I liked the color the finish was ok. When I put my cold drink on top of the shoe cabinet, water damaged the surface. The amount of space is good but not good for boots. For flat shoes you can contain 20 shoes.", 
    "love this for our mudroom! def cut holes out of the back so u dont get blown away by shoe odor when you open the doors!", 
    "Nice shoe cabinet, but feel a little cheap, I would suggest to enhance the rear cover.", 
    "Its not as big as expected. I expected it to be bigger. The picture looked bigger."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Baxton-Studio-Glidden-Dark-Brown-Wood-Multi-use-Cabinet/8011794/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8011794/Baxton-Studio-Glidden-Dark-Brown-Wood-Short-Shoe-Cabinet-92e56258-cfa5-403b-98af-ce65c793f316_600.jpg"
  ], 
  "description": "Bring style to your home, and expand your wardrobe storage with\nthis Baxton Studio Glidden contemporary multi-use cabinet. This\nunit features space to hold all of your favorite pieces behind two\nsolid wood doors with magnetic closures. Clean lines and a\nbeautiful dark finish also make this brown cabinet a wonderful\nalternative to a console table or media center in your home. Contemporary shoe storage cabinetMDF and engineered wood frameDark brown faux wood grain paper veneerFour fixed-height shelves for shoe storageMagnetic door closureWipe clean with a dry clothSet includes: One (1) shoe cabinetMaterials: MDF, engineered woodFinish: Dark brownDimensions: 28 inches high x 29.1 inches wide x 15.1 inches\n  deepStyleTraditional, TransitionalMaterialMDF, Veneer, WoodFinishBrown FinishShelf TypeBookshelves, Media Cabinets, StorageAssemblyAssembly RequiredColorBrownNumber of Shelf4"
}