{
  "name": "Black_Laminate_Large_Corner_Wall_Mount_Shelf", 
  "price": "EUR 43.31", 
  "reviews": [
    "We bought these shelves for my sons room. Upon arrival my husband had no problem putting the pieces together though some of the boards were slightly warped. Also the screw holes were drilled to big so my husband needed to get some different anchors and figure out a way to get the screws to work within the too big holes and get the shelve secured to the wall. Not worth what we paid for it but it does look nice up. Just poor quality.", 
    "Great product to fulfill white space in a corner. Not the easiest assembly and I'm still trying to figure out how to insert plastic tips into wall.", 
    "I'D REALLY LIKE THIS TO COME IN WHITE.... OR EVEN BRONZE. WHAT A GREAT IDEA FOR SMALL SPACES.", 
    "This comes in a small box and you assemble. Just a little work but not hard to do. The finished shelf is cute hanging in the corner.", 
    "Great buy! Looks amazing and is sturdy. Cheap price for an awesome item", 
    "I bought this for my husband's home office. It looks great -easy to put together.", 
    "matches my other shelves in living room perfectly, nice contruction,, easy to assemble", 
    "Beautiful corner shelf , great for any decor. My daughter loved it.", 
    "super simple installation and looks awesome. I get so so so many compliments on it!", 
    "Very Easy to hang - Looks nice - Exactly what I was looking for", 
    "Beautiful corner shelf , great for any decor. My daughter loved it.", 
    "It's pretty cheap material but it works . With no instructions. Wish it would be better material from what the price was .", 
    "Looking great. Worth to get it. Looks same as pic they have.", 
    "Looks great in the corner needs different type of hanging as the wall mounts were plastic and did not hold in wall - had to purchase hardware store mounts.", 
    "I split it up. 2 sides of the room excellent to work with. It's great!", 
    "easy to assemble, looks great in corner for pics or knick-knacks", 
    "Love them they look great", 
    "Nice design, easy to assemble, not yet mounted but, would recommend. Yet, it’s a bit overpriced.", 
    "Awesome product, very easy to put together and install.", 
    "Easy to put together and it looks nice.", 
    "Nice item for the price. Would buy again.", 
    "after placing these in the corner of my room, I decided to disconnect the parts and do it my way. It worked in two different corners and I have two shelves. I will order more.", 
    "Nice on white wall. On darker walls items aren't very visible.", 
    "nice shelf for my son's room works great in his space", 
    "Bought for myself for Xmas it looks great! Good size and was easy to put together", 
    "Great purchase. Received as expected. Sturdy. Great buy. Easy install", 
    "Larger than what I expected, and very easy to assemble. Excellant for my daughters room", 
    "These went up very nicely, the hardware that comes with it is adequate if its not much weight on it. I used heavier inserts and screws as I felt I might have more weight than allowed for with the supplied stuff. Looks great.", 
    "So happy with this corner unit. Was able to display items by using normally unused space. Quality excellent and easy to install. Very happy with this purchase.", 
    "Grand Daughter loved shelf. Wanted more space in her room, so this was ideal for nick-nacks that she loves to display. Having the shelves allows her more room on her dresser top and side table.", 
    "Fits my decor perfectly. Very sturdy, easy to clean", 
    "Really liked the product, exactly what I was looking for. The quality is not so good and we were really cautious while putting it together. But once on the wall it looks good.", 
    "I am so happy I bought this. I have a small guest room and needed to same of space. The works perfect for clock, phone books... easy to put together and hang.", 
    "It serves it purpose in the kid room. Not real high quality... Had to use wood clue to make sure it wood stay... A little cheap looking... Like Sauder Products..", 
    "The only thing I don't like about this shelf were the screw covers. They are made of plastic and are a little time consuming to install. It would be nice if they could upgrade this item to a better assembly process and price accordingly.", 
    "This shelf looks awesome!!!", 
    "Bought this to go in our bedroom. It looks so good hanging against our dark green walls. I am very happy with this purchase", 
    "The shelve is nice, the little black things that you put over the screws to hide them DONT STAY ON so you will see the SILVER SCREWS", 
    "These shelves were the perfect touch for my apartment. Great buy for an excellent product.", 
    "The shelf is rather cute, not too hard to put together, though a little tricky to put up (needs two people).", 
    "Looks great and easy to install", 
    "This unit was easy to put together and a snap to hang on the wall. All findings and an Allen wrench were included. And it looks great too!", 
    "Great price and very unique.", 
    "Good Quality! Easy to assemble!", 
    "loved this piece and it looks great in our guest room but is not made very well. Was easy to install but some of the corners were lifting a bit. I kept it and you can't really tell unless you really look for the defect. I didn't pay much so I didn't expect much.", 
    "As expected - very decorative", 
    "This new corner shelf is a perfect accent for our living room wall. Great addition to our home.", 
    "Love this shelf! perfect addition to my sons room for some of his trophies!", 
    "I like this shelf very much. Someone else helped me put it up - it's a two-person job. It adds some fun and whimsy to the room.", 
    "This shelving unit looks nice in my home. It holds a lot of items.", 
    "Purchased for my son's room. Works perfect for what he needed.", 
    "This shelf unit was easy to assemble and fit perfectly in the corner of my kitchen It helped to organize my families keys and wallets and cell phones we all know where everything is so nothing gets lost and we aren't searching for things before we need to leave.", 
    "Great unique shelf! love it!", 
    "Happy with this product, Wish had an option of a diffrent color,", 
    "Have these in daughter's room. Does job nicely but wish they were real wood.", 
    "Looks ok, thought it would be bigger", 
    "This is such a funny little shelf, but up in the bathroom it looks awesome and takes up no room. If you need a little extra storage, this will do the trick.", 
    "look good and it worth the price!!!!", 
    "Smaller than I expected, but still worth the price", 
    "Quality control failed with this item. The screw holes do not match and several shelves will not hold once screws used to put item together. I had to resort to using stronger/wider screws and liquid nails. I would not put anything of value or heavy on the shelves. I bought for daughter who displays pictures and memorabilia on it. I would not buy again.", 
    "very sturdy and easy to hang. love its shape!", 
    "Love thos piece. Looks great in our daughters small room. Makes a statement.", 
    "Product looks great in the corner wall!! I would recommend this to a friend.", 
    "You MUST be very careful in putting these shelves together. If you do not get them right and have to undo one it strips the screws. Also, be aware that the little inserts to cover the screws do NOT stay on.Also, unless you have PERFECTLY straight walls the shelves will NOT go against the walls and stay with only the two screw areas provided. They do not align straight and the shelves are not level.", 
    "It was just as advertised. Knowing it was laminate was ok with me and it came without a scratch. Looks perfect and we love it!!", 
    "haven't hung them yet. still in the box. ask me later"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Black-Laminate-Large-Corner-Wall-Mount-Shelf/8858683/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8858683/Black-Laminate-Large-Corner-Wall-Mount-Shelf-c1a1f483-516d-4683-8129-b85d9ce994cf_600.jpg"
  ], 
  "description": "Complement the modern look in your home while increasing your\nstorage options with this black laminate corner-mounted shelf.\nFeaturing a bold, black color and a dynamic zigzag design, this\npiece is the perfect way to not only add style to your home but\nstore things such as books, potted plants and decorative pieces.\nThis black wall shelf connects easily to any corner, and its\nlaminate coating makes it easy to clean. Excellent for small\napartments or college dorm rooms, this corner wall shelf is a great\nhousewarming present or going-away gift for a student. Bring\norganization to chaos with this shelf that is spacious enough for a\nvariety of items. Add a modern look to any area with this stylish\nshelf.Colors/finish: BlackMaterials: MDF and LaminateQuantity: One (1)Setting: IndoorDimensions: 48.5 inched high x 7.75 inches wide x 7.75 inches\n  deepNo visible hanging hardware, all hardware includedAssembly required, assembly instructions includedEasy to clean laminated surfaceMaterialWoodFinishBlack FinishAccent TypeDecorative ShelvesColorBlack"
}