{
  "name": "Broadway_Altus_Plus_Black_58-inch_Floating_TV_Stand", 
  "price": "EUR 149.43", 
  "reviews": [
    "I love the way this floating TV stand looks in my living room. Considering all the manual work required for assembly, this was not hard to install at all. Before you begin assembly I would recommend a small Phillips screwdriver (5 inch or less), but other than that it's all pretty straight forward. Would get again if I had to move to a new apartment.", 
    "I was easy to assemble though it is extremely heavy! I managed to assemble and install it on my own (40 something female!) but I wouldn't recommend it. A second set of hands when hanging it on the brackets would have been SOOOOO nice! Try to get all the cords assembled and attached through the back before you hang it. I had a heck of a time once it was on the wall. It looks amazing, has tons of DVD storage and hides all the cords! We love it.", 
    "The unit functions well and is easily installed. However There are a number of features left off that I have in other similar units that detract greatly from the usability and aesthetics.First the mounting bar can be easily seen through all three of the mounting shelves. In a similar hanging cabinet I have there were wood inserts supplied to hide the brackets and mount bar. Sadly here that is not the case. The Second problem is: there is a board that separates the lower section so DVD/BlueRay discs are in front and cables are hidden behind. This board is not removable once the shelf was assembled and the hole from the bottom to access the area doesn't allow much more than a hand to get into the cavity to attempt to wire up power strips. It was an impossible process for the things that I needed to plug into my power strip. There was no way to plug in items to the power strip and then get it inserted in the cavity (the hole was too small). I guess assuming you had three or four people you could somehow put all of the electronics on the shelf while it was balanced on the ground and then mount it on the wall.In the end to solve the second problem I change how the board separating the discs from the cables/power strip was mounted so it was removable while the shelf was on the wall.", 
    "This works for us except be aware that it does not fit a full size receiver! It was our over sight to not careful review picture #5 but the main picture shows a full size receiver. The opening height is only 6\" and our receiver is slightly over 7\"! They should have made this opening at least 7\". Otherwise it seems like a good product.", 
    "Absolutely LOVE this piece! It has to be my favorite piece in my house. I would say that it is a 2-person job, but one could do it by themselves. I am a single female so I paid someone to put it together and mount it for me. The directions seemed easy enough though. The one critique I have is that you could see the rail on the wall through the shelving units. This isn't a problem for me because I just put pictures up to hide it, but it might be a problem for others.", 
    "My boyfriend absolutely adores this stand. All his gaming consoles and games, DVD's, and Cable box are in order and away from the floor. Really couldn't be happier! I suggest this in a major way!", 
    "Very easy to assemble - Leave screws in wall slightly loose to hook cabinet to wall then tighten the rest of the way - fishing electrical wires and HDMI cords was simple - Opening on bottom is too small to plug cords in before putting surge protector up into hideaway hole - Put surge protector inside and turn upside down to connect power cords then turn it over to slide up inside the opening - This cabinet hides all the wiring beautifully and looks nice on the wall", 
    "Good instructions. Looks good .it was a bit difficult to hang with all the wires needing to get tucked in the back.good value for the money .a two person job for sure.", 
    "For $***, this is great. By no means is it a high end piece of furniture, but it adds a modern look and is very functional. I hired handymen to build / mount it to my wall and they were done within an hour. Looks great, and saves lots of floor space. Only downfall is that you can see through to the back -- mounting strip / wires -- but it is an easy fix if you add picture frames, books etc to cover the open space. Really happy with this.", 
    "We ordered a smaller version of this floating TV stand & loved it so much we decided to order this version for our big TV... our only disappointment is that the electronic shelves on this piece don't have a black backing like the smaller unit... this makes it look really messy as you can see all the wires and also the hanging hardware. Now we are trying to figure out what we can have made to fill that open space.", 
    "Easy to put together, looks great!", 
    "Better than expected, it took a couple of hours from start to finish, looks great and is very sturdy. Love it!", 
    "Easy to assemble, steady and get lots of compliments.", 
    "This looks awesome in the picture, but there is a metal bar that you can see when it's up on the wall. We also didn't get all the necessary pieces to build it, so we had to go to Lowe's for a few things.", 
    "love it. nice piece of furniture. very sturty.", 
    "I hate cables showing and I like the fact you can clean under it easily. We love the look and functionality of this beautiful unit", 
    "Perfect if you have a Roomba.", 
    "A little tough to mount, but it looks great!", 
    "I love this piece, it allow more room, it is a very heavy piece and looks amazing in the room.", 
    "Always leery about manufactured furniture, but with this piece I'm impressed!", 
    "Good quality product. Very sturdy with great finish. Spacious storage and real estate on top. Very easy to clean up!", 
    "Works great. Took a little planning but it adds a little bit of modern style to the place", 
    "I liked the fact that this TV stand doesn't take up any floor space. It allows my living area to appear more spacious as it leaves the floor exposed. I also appreciate that I can put the DVD player, cable box, and sound system on the shelves, along with DVDs.Although it would have been easier to assemble and hang with another set of hands, I assembled and hung this unit by myself. It wasn't that hard but it is rather heavy. I have no complaints about my purchase.", 
    "Looks so awesome in my living room, it makes the room look totally different. Easy to assemble, fast delivery, thank you overstock!", 
    "Not an easy task to assemble and mount", 
    "Adds a contemporary ouch to my living room", 
    "Within 24 hours the bottom shelf started bowing,my husband fixed it easily but by no means is this gonna last.great concept though.", 
    "Mounted it on the wall and it looked good but, it is too heavy!", 
    "It really opens up the living area. DVD's are dead so now we have a place for all of those kids ceramics.", 
    "This has a very slick look, created more space in my living room (apartment). Best of all it was pretty easy to put together.", 
    "Item came quick and installation was a breeze. It's looks great on my wall and the best part you see no wires.", 
    "We love the look and the extra space we now have in the living room!! I will be ordering another one for a bedroom:)", 
    "looks good, you need 2 people to install this", 
    "Very happy with the design. Fits DVDs and electronics wonderfully. Lots of space for the wires. Only wish the shelves were black all around and not just the visible sides. Could also have a back cover to conceal the wall. Overall, great instructions on how to put it together. Make sure you have all the tools before you begin, otherwise it may take longer to put together and hang up than expected.", 
    "Very happy with this purchase! It is a little tricky to get some of the screws in after you get the stand on the wall, but nothing major. It is thick and sturdy and looks really amazing on the wall with all of my movies and game system!", 
    "Color is exactly what it looks like in picture. Had someone put together and hang on wall for me. Trying to figure out what to do with the cords that hang down underneath. Other than that very happy with the quality of product for the money I paid for it.", 
    "I like the shelf. The reason I am giving it a 3 is because the shelf on top needed to be a little wider.", 
    "This is a nice floating entertainment cabinet. Easily put together if you just follow the instructions. I just organized everything and made sure everything that was supposed to be there was actually there and then just followed the step-by-step manual. Took me about 20 minutes. then about an extra 10 minutes to find the studs, mark em, center the railing below my wall mounted TV. Then drill it and hang the TV stand. Works great. Definitely worth the money for this. Treat it right and it would last you 20 years.", 
    "I put this piece together in about 4 hours. I'm not a very handy man, but the directions were easy to follow. As the directions say, it would be easier to mount to the wall with two people, but I mounted it on my own. The level, stud finder, drill, etc are very necessary. It looks very sleek on the wall. The cords are harder to hide than what I expected.", 
    "Nice looking. Was difficult for me to mount because the studs in my wall were new. Could not use the hex wrench they have me and screws because it was impossible to screw in by hand. I had to buy 4 other screws with a phillips head so I could drill them in the wall. Once i did that it was a breeze. I put it up by myself but I would recommend two people. figuring out where the wires and boxes will go while mounting is a two person job. I kinda scraped my wall doing it alone.", 
    "It's very nice, but I think it looked a little cooler in the pictures. I think that the main reason for that is that the tv in the picture must be huge!! We have a very normal 42\" flat screen and it looks lost on it against it on the huge wall.", 
    "Very detailed instructions to build and mount on the wall. Make sure that you have a leveler, a drill, and a stud finder as this is not too light that you'd want it to be secure and be on studs (at least 3). We purchased two for our new home and we are glad that we did. It's easier to mount to the wall with two people but I was able to do it by myself. Don't hesitate to purchase.", 
    "Needed something that would work in my small loft area and this is perfect. Looks very sleek and modern in the space. Easy to assemble and mount on wall.", 
    "Very elegant with my red sofa.", 
    "We ordered this product for the lounge room in our basement, and we were pleased to discover the product is a lot more attractive and sturdy than it appears in the online images.It was fairly easy to assembly, and once my husband put the stud finder to work, it was relatively easy to mount/install.This floating TV stand blends perfectly in the ultra-modern look of our basement lounge...love it!", 
    "I love it, I love it, I love it, easily put together, a great place for your tv and other entertainment addictives, it's a main attraction in my living room.", 
    "I so dislike cluter with this everything was neat & still stylish.", 
    "I love the contemporary look of this \"floating\" stand. It was easy to assemble, although a couple of the pre-drilled holes didn't line up properly. If you follow the instructions, it is very easy to install and mount. (The whole process took me only a couple of hours). I would definitely recommend this to others.", 
    "This is a very beautiful T.V. stand. I couldn't fully appreciate it until I had it assembled and mounted. Everyone that comes to my home absolutely loves it, simply because it's unique, something totally different from the norm. I would definitely recommend buying this item. And it's very sturdy. It's a great buy.", 
    "very nice quality for the price, looked great!", 
    "Looks great, 2 issues. Hard to run bulky plugs through the holes once mounted. Bracket is visible through the second level of shelving.", 
    "This tv stand was easy to put together following the directions. I love it that the only cord you can see is the satellite cord. So much nicer then seeing all of the cords in a clump, collecting dust. I'm so happy with this purchase.", 
    "I love this stand. When you have a small room hanging this on wall makes the bigger and crowded", 
    "Sleek, fashionable space saving fashion forward product,shipping took forever :( 3 weeks? That's why I gave it 4 stars", 
    "Sleek and very easy to put together durable and stylish", 
    "Exactly as expected. Sturdy construction for the price.", 
    "This stand gives my room such a unique look", 
    "easy assembly and installation. looks great and quality is", 
    "this was a great unit for a great price. love that it gets everything off the floor. exactly what we wanted and expected. holds a lot of stuff, all my kids games and gaming devices. Easy to hang", 
    "Love this tv stand! It's so adorable and fits my husbands need to have a hanging tv, and hanging stand. It holds quite a few dvd's and games. Love it!", 
    "Easy assembly, sturdy and looks great on my wall. Was afraid it would be made of poor quality materials but for the price, I'm satisfied.", 
    "I really like it. I think it is different and looks very nice. It also gives the family room a less cluttered look. I have had it for about a year and it still looks great. It is just what I wanted", 
    "this item has worked really well for me. exactly what I needed. can vacuum under and has a nice and clean look. good quality. easy to put together. does need 2 people to center and mount. can do it with empty boxes", 
    "I love this entertainment stand. It makes the room look so elegant while keeping my electronics safely out of reach from my small children and pets. Awesome buy!!! 😁😁😁", 
    "Love this item, although I can't move my furniture around as much, it's perfect for my small living space, everyone who see's it comments on it and asks where did I buy it from.", 
    "We wanted something difference than what we have scene in our friend's place and this was a perfect piece", 
    "This is just what I was looking for. Fits perfect.", 
    "It was a breeze to assemble and the look is wonderful.", 
    "Well for the money spent not bad, yes it is faux ,but the effect once installed is great ,I have assembled many projects so if you carefully read and lay out the pieces it goes together well, about 2 hours for me, just needed one other person to help lift on to the rail for hanging, I think if this 66 year old female can do most people can", 
    "The Floating TV Stand gives your room a clean look while hiding TV/Receiver/DVD wires. Easy access to DVDS and floor cleaning too.", 
    "Just as described! Thank You!", 
    "We have not installed this stand yet but we have put it together and very satisfied with the quality.", 
    "This has a great sleek and modern look, but was a bear to hang! Overall we love the finished product!!!", 
    "I don't know what I would do without this, it is the best thing I have ever brought, takes up so little room, but holds so much....", 
    "Looks good in the room it was placed", 
    "I really like this floating tv stand. Although I don't use it for a tv stand. My tv is on a wall mount and this stand has a great look with the wall mounted tv. The top were a tv would sit is basically space for anything else. Assembling this stand was really easy I almost didn't even need the instructions. The hardest part about putting this stand together was opening the shipping box, it was packed very well.", 
    "The tv stand fits our small living room perfectly! It allowed us to utilize our space and we get so many compliments! It was well worth the price we paid!", 
    "This is a really substantial piece of furniture and it looks great with our 50\" tv. Really good price for this stand, I'm happily surprised.", 
    "PERFECT!!!!! I had this for almost a year and it hold up pretty good. I love it! this is a must BUY", 
    "Love this! Takes two to install.", 
    "Get help when hanging but shelf is very sturdy Instructions are easy to understand. Easy assembly", 
    "Amazingly strong and beautiful.", 
    "This product was perfect for my son's game room. It was priced right, is great quality and meets the needs of storing game consoles, controllers and games.", 
    "This is a great looking TV stand. It was easy to put together but hard to mount on the wall. It takes two people.", 
    "A great buy for our rec room. Didn't want too much space taken up. This is perfect", 
    "exactly as described. easy to assemble and install.", 
    "I love this product. It takes so little room especially compared to our old entertainment center. The only thing I do not like is that you can see the support bar on the wall. There needs to be board in the back to hide it. Other than that the product is amazing. Easy to put together.", 
    "Nice well pleased looks good", 
    "it looks great and easy to assemble", 
    "Perfect fit, easily assembled.", 
    "We r very happy with it. We had it installed by our handyman. Our Tv fits over it and the floor is clear and is not massive. We moved from a large home to a townhouse and it fits our place well.", 
    "Easy to build. Easy to install. Great value.", 
    "Easy to assemble n pieces precisely cut so hardware fit into holes, etc", 
    "Excellent shelf, leave floor space open !", 
    "This shelf is perfect for my 50 inch tv. Reduces clutter of extra furniture. I used the bottom shelf for picturees. Looks great.", 
    "Holds all of our dvds, pretty and handy. Have had many compliements and questions of where we purchased.", 
    "I love the quality of this stand and the ability to fit everything in one location and organized", 
    "They love it! It fits perfect in the family room.", 
    "Pretty easy to assemble and just what I was looking for in a tv stand. Can easily hide the cords and the price is much cheaper than any other tv stand for a 60 inch tv. Highly recommend.", 
    "It needs two person to assemble. It's a little struggle to install to the wall ,but worth it when it's finish. It looks very nice in the room.", 
    "Purchased this as a gift for someone who has limited space. They love it!", 
    "Holds my 60 inch tv plus all my electronics. Very easy to install. Connects to 4 studs in the wall. Make sure you have a stud finder. Putting the shelf together took 20 mins then sits on the mount you attach to wall. I just ordered the matching floating desk.", 
    "Easy to put together. Has some weight so best to have a second person help put on the wall so you don't scratch the paint.", 
    "This is definitely worth the money spent, especially since I used a 12% off coupon. I like it and my boyfriend likes it as well (it was a Christmas present for him) the only \"issue\" is that it definitely wasn't easy to put together. My boyfriend and two brothers put it together and it took 2 plus hours, also all three were needed to hang it. Overall, definitely worth it but for some may be tough to do if it's only you or two people.", 
    "Wish the back holes were blacked out. But otherwise it's a great looking unit.", 
    "Great product for the price! Space saver and love the modern floating look. Takes two people to mount it!", 
    "I love the style and look. It does require 2 people to install, however it was easy!", 
    "Was challenging to put together. and Hanging on a Florida wall with metal studs. But looks great upon completion", 
    "I love how it looks in my living room! Its super nice and i love it! The assembly of the piece itself wasnt hard at all but mounting it to a wall was a nightmare! I honestly dont know how im going to take it off once i move out of my apartment.", 
    "The quality of this stand is great! When people enter my room they stated it changed the entire look of the room. I absolutely love it!", 
    "Looks neat. It took me some time to put it together. Heavy,", 
    "Easy assembly. Looks great. Great product.", 
    "This item was easily put together and mounted I am so happy with it", 
    "Purchased this to put in a media room for pre-teen boys. It looks good and has held up remarkably well. I love that it is up off the floor. It doesn't feel like it takes up as much space as something of comparable width that would sit directly on the floor.", 
    "The best TV wall shelf out there. You will be impressed by both the product AND the price.", 
    "Love our tv stand! Took probably an hour to put together myself (without my husband). The quality is great and is very sturdy. It was quite the job to hang this on the wall though! That part definitely has to be done with two (or even three) people. Before hanging on the wall, put all of your devices on it first so it's easier to tuck away the cords! Overall, great product for a great price!", 
    "It's great,does exactly what I needed. It damages easy but I moved it three times in past two years and its still in one piece.", 
    "Can not find instruction online and overstock has to send a request to part and then part to the company. Very frustrating when you have the tie to assemble and you cant do it!1", 
    "I love it and my 60\" TV fits on it perfectly. There are a lot of pieces to put together but it was easy to follow instructions so just take your time. It states you need two people which I recommend as well but I did get it assembled and mounted on my wall myself and it wasn't too hard to do.", 
    "Modern and sleek, great buy", 
    "Worked perfectly, easy to assemble", 
    "Looks exactly as it looks in picture!", 
    "Easy to assemble, needs two people to mount.", 
    "Fit well in a new room I built for my daughter. Didn't like how the wires kept popping out at the bottom.", 
    "For the most part I liked this item; drawback is that some parts of furniture is not black, but is visible. I had black spray paint so I painted the parts that were visible, which I should not have had to do.", 
    "Great wall unit. Mount into wall studs and no worries. 1 hour assembly.", 
    "The floating TV stand was easy to put together and very easy to hang directions are included", 
    "Very impressed. Looks great and very solid. I'm happy with my purchase.", 
    "We have 2 of them if that explains how much we like them. It looks great in both our living rooms and it was well built and easy to put together", 
    "This does exactly what I wanted it to do. Looks great in my new tv room. By reading other reviews I knew the wiring would be tricky. So I prepared for it and it went smoothly. Directions were very detailed and made assembly easy. Shelf hides all my wires and outlets perfectly.", 
    "Fast shipping and a beautiful addition to our TV room.", 
    "Great looking cabinet. I hired a contractor to install it so I can't comment on how easy it was but it looks great. We mounted a 65' TV over it. All the wires are hidden and it looks way more expensive than it was. Highly recommended.", 
    "We don't have our tv on it, but we do have it under our tv with an xbox, dvd player and loads of movies! It's beautiful and a great product at a great price. It didn't take long to put together and put up.", 
    "Everything has it's place but my kids can't seem to grasp that concept. I love this heavy duty TV stand.", 
    "Wonderful! Looks great. Tons of complements on it!", 
    "I wasn't quite sure about this product. But I absolutely love it. It seems to be very well made, heavy duty. Was quick n easy to set up and put on the wall. I would definitely recommend this floating entertainment center to anyone that is looking....", 
    "Very well made, solid and provides a terrific modern look for your television set. It also offers flexibility by placing the tv on the stand or if the tv is attached to the wall.", 
    "Seems like a need idea. After putting it together, it doesn't seem safe enough to hold the weight. Took it down....", 
    "greatly detailed instructions...relatively easy to asemble", 
    "This piece took a tremendous amount of effort to install and still does not hide all our wires. Its super difficult to add/remove console once its set. You need two people to adjust wiring etc. The shelves are not tall enough for the AV receiver but I knew that when I got it, thinking I could hide all the wires and keep the AV on top. 3 stars because of the lack of height and difficult assenbly.", 
    "I love my new Floating Shelf. Everyone loves my new Floating shelf!I had someone install it and he suggested the instructions where not very clear and it would be helpful if the wood pieces would have been tagged in conjunction with the instruction booklet. Never the less I Love this Floating Shelf,", 
    "This is a very attractive unit and love not having anything in the floor. Easy to mount. Only thing that I will add is a panel on the back of the area where you have the components because you can see the supporting bar. I got a black board and cut to the side and does the trick.", 
    "It looks great in my small apartment", 
    "We put this up in our master bedroom so that our dogs toys would have one less thing to get stuck under. Fairly simple install, I did it myself without a second person. Looks pretty good.You can see some of the hardware that is used to hang the stand, we put picture frames on the shelf to cover. Can only notice when sitting and looking directly at the stand. Overall happy with the stand.", 
    "Bought to use in bedroom to save space. Bigger than I thought it would be, but it does do the job I wanted", 
    "Bought the black to match our speakers. Looks great in the living room.", 
    "I love how it just hangs on a wall, put it all together and simple to assemble. It is a magnificent funiture to have.", 
    "Reasonably priced entertainment center, great quality. Perfect for my husbands man cave.", 
    "Good product, sturdy.You can see the metal bars it hangs on, not an issue for me, some might not like it", 
    "Putting it together is pretty easy. It's very much a 2 person job for that and installation. I had trouble when it came to using the wood screws to secure the bar to the wall. The head of the screw stripped while I was screwng it into the wall. That may have been my error. It functions as expected. I actually have mine behind the couch holding my videogame consoles and projector.", 
    "Simple to put together. My 8 year old daughter and I did it together. Lovely piece.", 
    "Pretty heavy but looks great in place. The one complaint is the same as other reviewers. You definitely see the mounting hardware and would be better if that was covered.", 
    "Very elegant on my wall......", 
    "Love this piece. Adds a modern feel and frees up space in my living room.", 
    "Love this product. Have in my rental home as well", 
    "Easy to assemble, even more easy to hang on the wall. Don't necessarily need 2 people to get this job done.", 
    "We really liked this TV Stand. It has a very modern and stylish look. Very pleased with my purchase!", 
    "this floating stand is everything I was hoping for. easy to put together hides all cords and looks great, would buy again.", 
    "Looks Great, easy to install. Good quality product.", 
    "Exactly as described. Easy to build as all the parts fit together very well. Nice, clean off the floor look. Perfect for placing all electronics under a wall mounted TV. Very good value. Also with a good level and measure twice approach easy to put up on the wall. Nice", 
    "Product looks great, but needed to hire someone to come put it up for me. Not sure how to keep the wires looking organized back there, and what happens when we get a new TV and need to switch out the plugs? The unit is bolted to the wall and does not have much wiggle room to add/remove plugs", 
    "easy assembly and easy to hang on the way nice piece", 
    "Awesome piece. Something different. Love it.", 
    "Looks great in family room", 
    "Im happy to have receive this. I havent put it together yet but I look forward to it.", 
    "Decent, hard to put up and wire with one person but looks good.", 
    "Love it love it , for the price , can't complain", 
    "Easy install, I was able to hang it by myself with no problem. But I could see where others may need help. It's not extremely heavy, it's about as heavy as you would expect a tv stand to be. Only drawback (otherwise I would have rated 5 stars) is once you hang it you can still see the track that is installed to the wall through the 3 top shelf openings. It would look so much more sleek if that was concealed. But can easily be covered with pictures, decor, dvd's, etc... Other than that, it was everything I hoped it to be. Made a major difference in the room and made me feel like I had a new TV!", 
    "Really looks nice on the wall & it is different.", 
    "This stand works well in my kids game room. It was easy to put together. It actually took me and my two daughters maybe an hour to put it all together. Because it hangs on the wall, my floors are less cluttered and the kids have more space to play on the floor. Perfect choice for any room an/or style.", 
    "excellent product, everyone just loves it", 
    "Minimalist looking TV stand. If you are looking for something that blends into your decor and not a feature- this it. Was easy to assemble and install on wall.", 
    "Love the space saving ability", 
    "This is a well built, sturdy tv stand. I was actually quite surprised. And I like the look of the \"floater\"", 
    "Have this downstairs under the TV. Very nice product and not hard to install", 
    "I haven't open the box as yet, when I do I will let you know", 
    "My friend loves it..looks very nice in his home!!!", 
    "I sent this to my daughter that just moved out and since the space is not that big this was a good help and it looks awesome", 
    "Hides all the wires. Holds my 60\" tv just fine.", 
    "Love this unit. It looks great in my living room. We have the largest TV that the shelf will hold and its holding up fine. Very heavy and also one less thing I have to move to clean under.", 
    "We use a smallish 5th bedroom as a TV/media room, and this floating stand works perfectly for us. Obviously, at this price we weren't expecting real wood but so far the quality seems just fine. Easy to put together. No complaints.", 
    "I love this piece! My handyman put it together and installed it but it is beautiful and sleek, and the cords are no longer tangled up on the floor!", 
    "This is Built strong!!! ... Not cheap junk like is sold everywhere these days", 
    "entertainment came exactly as pic easy to assemble .. Recommended for anyone who is looking for a sheik way to create space and give their decor a unique look", 
    "I love that it is free floating and gives me back floor space. It is a real bear to install though. And the cords gave me nightmares. If I were a bit more handy, it may have been easier. But overall, very pleased. Definitely worth it for the price!", 
    "Haven't had a chance to assemble this product. I'm looking forward to the extra space. Sorry couldn't be helpful with this review.", 
    "product is fine, but arrived missing a necessary piece I called company, and was assured piece would be immediately shipped-Still waiting for it", 
    "I ordered this item for my apartment me me and my family, totally love it. Neat, Did wish the instructions were better! Totally recommend.", 
    "Glad I purchased this unit.It frees up the space in my living room.", 
    "the floating tv stand is sturdy and looks great on wall only problem was when it arrived the second shelve has a chunk out of it. before they packaged it they painted the damage and sent the tube of paint. it seems like they would have went and got a new piece instead of sending the damaged one they tried to coverup. didn't have time to send back needed it for staging my house", 
    "Loved it from the moment my husband installed in our living room, which isn't very large. This gave us more floor space to play with the kids/ pets and also made the space seem larger. I would definitely recommend it. We've received lots of compliments on this piece.", 
    "Love it Thanks! Nice design", 
    "Great space saver would suggest to a friend", 
    "It is press board. Very tight mounting. Space provided for cords is good as long as you do not use bulky adapters. An straight in line power strip is needed to be able to provide room to allow everything to fit. If you have a double line power strip, it will be a bit rough. Ensure you insert top wire guide insert before mounting, unable to use after mounting. Decent for the price.", 
    "This is just what we were looking for. I wanted something that \"floated\" above the floor to help give the appearance of more space. All the cords from the TV and components are hidden in the built in space behind the unit. We used the bottom shelf for a couple of ornaments instead of dvd's. Assembly and installation was fairly easy (according to my husband). We have a 65\" TV and it fits perfectly on the unit. We are very happy with the product and would highly recommend it.", 
    "Very sturdy and very nice looking easy to put up", 
    "Was a good choice for our needs, perfect size", 
    "Easy to hang and is very solid when anchored into wood wall studs.", 
    "Looks Great and allows alot of room for storage.", 
    "FIT PERFECT UNDER OUR 60IN... stylish, and good quality!", 
    "This item is worth the money I've never had a floating item before and now I want everything in my house to float amazing space saver as well as a great look. The shipping on this item was exactly what it said it takes about 3 days per UPS the package is about 60 pounds. Once I opened the box I checked to make sure everything was inside which it was. I then separated all the pieces and followed the instructions and I had it together within an hour & up on the wall. The spaces for the cords work perfectly because you can't see any of the cords besides plugged in the wall. The look of it is amazing. Truthfully you can see the mounting bar in the back where you hang up the peace through the three slot holes but that's totally not even a big deal; it looks so good you can look past it. You can always fix that problem with decoration. Besides that wonderful item to have; again extremely amazing space saver. I will never buy another floor item again.NOTE: you will need at least two people and a drill to mount the item", 
    "We love this entertInment center!", 
    "This floating TV stand is so nice. It free's up so much space in the living room. My son-in-law put it together for me and it took him around 3 1/2 hrs. I LOVE IT!!!!!!", 
    "This shelf is exactly what I needed. My TV, accessories, tapes are on it and there is plenty of room left over. Being mounted on the wall makes my bedroom look larger. Not to mention vacuuming under it is a breeze. The whole area is so much neater. I took my time and put it together without help. Excuse me. I had help from my kitties. But of course needed a man to mount it on the wall due to it's weight (and his talent.) My TV is 36 inches. I'm sure a larger TV would fit just fine.I got this shelf on sale at a great price. This is one of those buys that just makes me smile because \"I done good\" with product, price, getting it from Overstock and finally finding a shelf that fulfills my need.", 
    "Although the detailed instructions were easily understood, we weren't warned, and probably should have known to check each and every wall mount. We didn't, and after placing all of the pieces of tv related equipment on the shelves, the entire shelf, tv and all came tumbling down. There were such detailed instructions on everything else, we screwed up. The z hook on the wall didn't come far away from the wall for the other hooks to make contact. Big mistake, HUGE.", 
    "Looks incredible hanging on the wall. Was fairly easy to put together. Really helps to have two people. Ours has a 55\" tv on it. You can hide all the power cords in the back and you don't see anything.", 
    "Easy assembly and can be put together in a shirt period of time.", 
    "This TV stand gets the clutter up off the floor with a nice clean look. The instructions were easy to follow. Overstock staff were right on it,. I ordered the stand on ****** evening and by ******** afternoon, arrived at my front door. It took me less than a hour to put it together and up on the wall.", 
    "Nice price, good quality. Only had it about 3 weeks, wanted something modern and doesn't take up a lot of space. Took about 40 minutes to put it together and install it upon the wall. Wasn't too hard. I would recommend. Very happy with my purchase so far. Man cave upgraded.", 
    "With the exception of a few dings during delivery this tv stand looks great mounted on my wall. Great price also", 
    "We are very satisfied with this purchase it looks great and is easy to build and install. It saves a lot of floor space which opens everything up", 
    "I got surprised when I saw it on the wall! Very nice tv stand and looks better than you can see on the website! Good quality for the price!", 
    "I used this as a hanging headboard for our king size bed. Works great for this. I would of purchased a longer one if they had it to go across the whole length of the bed. This piece can be used in many ways. The ease of putting it together is a huge plus. Packaging was great and delivery was quick. Very happy with the purchase.The only drawback with using it as a headboard was you can see the track that holding the shelf up. I used tan duck tape to camouflage it. A board across it would be better though. Still a great product though.", 
    "This looks perfect under our 60\" TV. I wanted an open look but needed something under the TV to hold the cable box and DVR. This fit the bill. It looks nice and is sturdy. My husband installed it easily.", 
    "This product is amazing. It looks just like the picture. It has great space. We used it for our movie room.", 
    "For the price, I wasn't expecting much. But the build quality far exceeded my expectations. It was relatively simple to put together (there are a fair number of parts), but it was machined very well making installation a breeze.", 
    "I don't know, this is kind of hard to review. My wife and I fell in love with the picture on the website. So, I ordered it without even checking prices on other websites. Sadly, I could have gotten it a few dollars cheaper if I had done my research, but that isn't important since that isn't really about the product itself.The product itself seems sturdy. If there hadn't been a chunk of finish missing, I would have been very impressed. It came with a marker to cover up flaws, so I used that to cover up the scratches and the missing chunk. It is hardly noticeable, but I know it is there.My wife still loves it, but I'm on the fence. The base of my TV is literally bigger than the platform on which it now sits. Not by much, but it is bigger. Check your measurements carefully before you buy this. Lastly, and perhaps most important, it is very difficult to run the wires. You can try to run the wires before you mount it, but then you are adding the weight of your players and speakers, etc. or you can do what I did, and run the wires after the fact. I have very skinny hands and arms, so with difficulty, I was able to run all the wires, but I do wish it had been easier.Also, the recommended height is higher than I would like my TV to sit.Like I said, my wife loves it, so I'm keeping it. The build quality would have been great if it weren't for that piece of finish being missing. I do not think it was damage during shipping. I think it was damaged before packaging, but it wasn't caught.It was a lot easier to assemble than I would have expected, and all the pieces fit together quite nicely considering. I just wish I had done a bit more research on pricing and measurements before I ordered it.", 
    "I love this entertainment center! It makes my living room so modern and clean.", 
    "I would suggest regular screws and a screwdriver over what is sent. Other than that, we love the product.", 
    "Not too complicated to assemble. Finding studs on wall was more so ! Very happy with product , holds ALOT of DVD,s , just what I needed. Would definitely recommend to others, and it looks very nice on the wall !!", 
    "The nice thing is it can be vacuumed under and the dog will never lose another ball... It is heavy and sturdy. The instructions are interesting so you need to read through them a few times and put things in order. If you do that it's pretty easy. My husband put it together with no help very quickly.Now the top of the back shows the wall and hanger and we did not like how that looked. We got some light weight board and made cut outs to fit the open area, with grooves to accommodate the wires and then a little finger sized groove so we could pull them out when we needed to work on something. (I think that is something that could have been added easily by the manufacturer.) We painted them black and it looks awesome. The finger grooves are very slight so they don't show.If you have surround sound large components will not fit in the component storage and have to go on top so they can breath. Keep that in mind when deciding where to place the shelf. We got two of these to put one on each side - We got them in black to match from another site. http://www.overstock.com/Home-Garden/Everett-Espresso-Wall-hanging-Media-Storage-Cabinet/5978105/product.html?refccid=DTNY6Z24RMA2XJ2MIHXJYBCSJA&searchidx=66 But they are also nice and sturdy and we now have a floating entertainment center with storage for my nic nac stuff.Cliff made a matching shelf to hold the woofer off the floor too and put it next to the shelf and made a matching one for the other side. We have this in the living room but if the kids were still home I would have put one in each of their rooms. Mine came in perfect shape and was packaged well to protect it. I am very happy with it.", 
    "Perfect it was just as describer in the description. Forcing a review on a customer is poor judgement.", 
    "This unit accent my tv that is mounted on my wall perfectly! It's a contemporary piece, very sleek and a great space saver. Not to mention, it's very easy to assemble.", 
    "I love this, it's perfect for the tv and has given us so much living room spice that we were amazed.", 
    "I love this piece of furniture. I just needed something simple and nice looking for my apt. It was pretty easy to mount. We have a 55\" tv mounted on top and it just looks nice, not cheap and leaves the open floor space which I love. I definitely recommend it", 
    "Absolutely love!!!!! I love having my tv off the floor (no tv stand on the floor). The spaces for my receiver and dvd player are perfect. The back hides cords. I've gotten complimented by everyone that comes to my house by the look of this tv stand.", 
    "This piece was purchased to go above a TV. I needed something sturdy and I like the track system it hangs on. (Having studs to anchor it in are important for this piece.) As sturdy as it is, I couldn't imagine putting a TV on top of it as advertised unless it was small and lightweight. Because I hung the piece up high, I had to paint it underneath. It's not solid black. Some of the shelves underneath are a light maple veneer color. I wish the design of the piece was more modern, it really isn't - more like circa 70's. Overall, I am satisfied with the piece for the price.", 
    "Really needed a floating shelf for underneath a mounted tv, and this fit the bill. Not too difficult to assemble. Still haven't mounted it, so can't give n opinion on that.", 
    "Easy to assemble and install, took an hour start to finish. Love that I have my floor space back!", 
    "Provides great storage for my devices etc and frees up floor space. Very solid piece of furniture. Mine hangs below a wall mounted 55\" TV and its huge but practical. Lots of ways to use the shelve spaces creatively to accent a sitting area.", 
    "You need two people to hang this on The wall. Looks great and fits the cable box directly under the top shelf. I wish I bought two.... Want another one for the basement.", 
    "Tv stand looks great. Is functional and has a lot of storage. Is exactly what I wanted. Love that it is off the floor.", 
    "This is a very nice piece, it is well constructed. Pros: - clean lines - goes with everything - well organized and accessible from the back once it is on the wall (this is well done) Cons: - top shelf you see the color of the wall - fixed this problem with $1 can of black spray paint, it looks awesome", 
    "I was disappointed that there were so many marks on the material. There were also several nicks. I guess they know that and that's why they send you a correction marker. Most won't show when you put the equipment on it but still frustrating.", 
    "Nice strong sturdy stand. Easy to put together, screw holes line up. A few things could be better though. where the electronics go you can see through to the wall (no back board), and you can see the wall bracket that holds the unit to the wall. That can be improved very easily by adding a backboard. I do like the unit very well, it gets everything off the floor and you can run your vacuum under it instead of having to move it every time. I recommend this TV stand."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Broadway-Altus-Plus-Black-58-inch-Floating-TV-Stand/7986250/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7986250/Broadway-Black-Altus-Plus-58-inch-Floating-TV-Stand-e71b262e-31a9-45f7-8199-eb37b9203f22_600.jpg"
  ], 
  "description": "Create a modern entertainment center in your living room or media\nroom with this floating TV stand. Showcasing a modern silhouette\nand rich, dark color, this piece brings understated style to your\nspace. The floating design lets you place your large-screen\ntelevision at the optimum height for viewing.Black color with a laminate finish lends a sleek look to this\n  TV standMDF and composite wood construction for strength and\n  stabilityWall-mounted design saves space on your floorsTwo shelves and four storage compartments offer ample space\n  for electronics and accessoriesTV stand holds ample weights of up to 165 lbsOverall dimensions measure 16.75\" H x 58.25\" W x 16\" DStyleContemporary, ModernMaterialLaminate, MDF, WoodTypeEntertainment Units, Storage, TV StandsFinishBlack FinishAdjustable ShelvingYesAssemblyAssembly RequiredColorBlackNumber of Shelf2Weight CapacityUp To 154 Pounds"
}