{
  "name": "Cappuccino_Corner_Accent_Etagere", 
  "price": "EUR 113.69", 
  "reviews": [
    "We ordered this for the corner between the couches instead of putting a side table and it looks great!!", 
    "Nice bookshelf, looks exactly like the picture. Although, instructions were incorrect and there was a hole missing on a shelf so I had to drill a new one to get the shelf together.", 
    "Just received our corner Etagere, I call it the Corner Ladder Shelf. It's really a nice piece. It looks perfect in our living room and doesn't take up a lot of space, reason I ordered it. It's solid & sturdy. Wish they had a few more color choices but this Espresso looks nice and goes with just about everything. You do have to assemble this item. Two people is helpful. Love this also because it actually has a top shelf, a lot of other styles do not. Glad I purchased this. :)", 
    "Good, sturdy corner shelf. Bear to put together as a single person, but I modified the instructions and once the two side posts are attached to the shelves with the lock nuts it's easy to get the other shelves and back on. I also kept the stickers that covers the screw heads off and flattened between a couple heavy books for a few days so that they would stick on without peeling off."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Cappuccino-Corner-Accent-Etagere/9673117/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9673117/CAPPUCCINO-72-H-CORNER-ACCENT-ETAGERE-b4b14a01-4e2b-4af6-87f4-3d90adc04959_600.jpg"
  ], 
  "description": "Add the perfect corner piece to any room with this cappuccino\naccent etagere complete with five tray style shelves. This\ncontemporary piece blends well with any decor and will provide you\nwith additional display space without sacrificing style. Set includes: Corner accent etagereMaterials: Particle boardFinish: CappuccinoDimensions: 72 inches high x 18 inches wide x 18 inches\n  longStyleContemporaryMaterialLaminate, MDFFinishCappuccino FinishShelf TypeEtagereAssemblyAssembly RequiredNumber of Shelf5"
}