{
  "name": "Contemporary_Metal_Wall_Sconce_Set", 
  "price": "EUR 36.27", 
  "reviews": [
    "I am very pleased with the Contemporary Metal Wall Sconce Set that I purchased from Overstock.com. It goes perfectly with a metal artwork piece that I already have (and was also purchased from Overstock.com). I had been looking at it for several months and finally decided that it would go well with the piece I had. When received, one of the glass insets was broken, and it was replaced within 3 days time. I call that customer service.", 
    "This is the second set of the same sconces I've ordered. I've had the others for several months, and they look great on either side of a painting hanging over the fireplace mantle. Second set arrived today (2 days after ordering!), & they look great hung on either side of a mirror in my entryway... above a bronze console table that I ordered from Overstock a long time ago. Arrived well packaged, easy to hang (two nails in the wall), and I put flameless candles with timers in them. Perfect! It's tricky finding the right size candles, so pay attention to the width you need. I got 3\" high x 1 1/2\" wide candles... wish they sold them on Overstock. You can go taller with the candles, but it has to be under 3\" wide to fit into the glass cylinders. Highly recommend these sconces! It's so hard to find contemporary sconces. My husband loves them to, and has complimented the first set I got several times!", 
    "I like the cool, modern element that this sconce set adds to my space. As other reviewers have pointed out, however, standard 3\" diameter candles will not fit. I haven't yet found candles that I like, so I worked around this issue by inserting decorative paper from a craft store into the glass and putting an LED candle in the base.", 
    "I absolutely love the set. The color was just as pictured and sturdy. I'm getting loads of compliments", 
    "Although fairly attractive, the pair of sconces were not of the quality I expected. I chose to return them rather than give a gift I wouldn't want myself.Better Luck next time, I hope. Thanks.", 
    "These little gems were just the right touch on my master bathroom wall above the soaking tub. I found the candles at Home Goods and they are just right. The style is conemporary but will also go with traditional if you want a transitional look. Love these. Nice find.", 
    "Just received these and hung them in my place. I'm very pleased with the overall appearance. I realized that they were on the smaller side AFTER I had ordered them, but the set is very nice looking, nonetheless. They actually fit better in my apartment than they would had they been larger. The only thing that was not 5/5 quality was the glass. The glass is very smooth and clear, however the edges where it was cut are not rounded smooth. On one of the glass pieces, this made for an almost gritty appearance on the edge but I simply put that side down so it's not seen! Would definitely recommend to anyone. Just be sure that you know how big 16x4'' is on your wall and you won't be disappointed!", 
    "Absolutely beautiful. Goes with so many different styles, contemporary, rustic, traditional. With the glass columns in, looks so very classy.", 
    "This lights up my home and everyone that come in likes the smell of the scented candles.", 
    "its a must buy, definitely will recommend", 
    "These are gorgeous & work beautifully with the Teva Wall Mount Fireplace", 
    "Got exactly what I ordered . Look nice", 
    "I added some slim flameless candles - looks nice. They are a bit smaller than I imagined.", 
    "These look decent but are way too small to hang on a wall. I would pay half the price for something like this if I could have seen it first. Plus they don't come with any anchors or screws. Don't waste your money on these. Too small and way overpriced.", 
    "I like these so much I ordered 2 pair. The only problem is finding candles to fit them.", 
    "This Sconce set was so nice. It is exactly what I needed to complete my wall arrangement. It is of great quality, good and bold set. Looks like an expensive piece! Very Happy with it!!! Recommend Highly!", 
    "I liked this set because it was different from the usual sconce sets. Made very well, arrived ontime. I just need to find the right size candles that will fit into the cylinder. Overall, very satisfied as usual with Overstock", 
    "I put a pair of these in the living room with flameless candles and the look great. It does not come with candles and finding a nice 6 in tall flameless candle that was less than 2.5 in wide was a pain. Most 6 in candles are 3 in wide. I ended up getting the last pair of 1.75 x 6 in flameless candles I could find and they are awesome", 
    "These scones provide an inexpensive solution for providing soft light in a hallway without hard wired electric. I found battery operated 7\" LED pillar candles, with an 8 hour (on) timer at Big Lots, that provides enough light to safely take the stairs. Please be aware that a 3\" candle will not fit inside the glass cylinder or fit in the base. Very happy with the purchase.", 
    "This is a very well-made and attractive piece. Where the metal is welded together, it is done well. I think that you could pay much more for this piece and still feel that you have gotten a very good deal. My one complaint is similar to that of others. The candles are very hard to find . This piece requires candles 2\" x 8\". This is not a size regularly found, but has to be ordered online. These candles can be very expensive. As long as you are aware of the extra cost, I would highly recommend this piece!", 
    "Order shipped right on time. Look really nice. I did however, have to buy taper holder to use in there as I couldn't find tall enough pillar candle that would clear glass", 
    "I have this item for almost two years now and it still looks beautiful in the space...I actually considered purchasing another pair.", 
    "I am very happy with this product. I had originally planned to put large candles in the glasses but then it covers the design, so I put smaller ones. Still happy though.", 
    "The pieces were smaller then I had anticipated. It is hard to tell without a picture showing scale. The hooks on the backs were not the same on each piece, making accurate hanging slightly more challenging. WHen we got them hung we were pleased with the final look.", 
    "Really nice set. Works well with the mirror I flanked. Everyone is saying it's hard to find candles to fit ... I just bought two 2\" x 6\" candles and they fit perfectly. Look online ... they can be found! Size is accurate as stated.", 
    "They worked well on a narrow column in our home. Would recommend. I put class beads in them rather than a candle.", 
    "Everything came fast and undamaged! The metal part is not a solid color and made to look somewhat vintage which I loved. I put electric candles inside and they look gorgeous on my wall with square overlapping frames in the middle. Great accent for my room!", 
    "Very nice item. Looks good in my hallway and it is as described.", 
    "Very nice and contemporary. Looking for some flame less candle to go with it.", 
    "The lamp is awesome, and the candle holders look great", 
    "Just the perfect touch to complete my room.", 
    "Very pretty candle holders - I installed them in my powder room - they look amazing.", 
    "classy, very elegant design; love it so much.", 
    "Looks very nice but not quite like the picture", 
    "These scones are a beautiful addition to my wall.", 
    "Cute and nice, perfect for the master bathroom.", 
    "classy, very elegant design; easy to install; would consider getting another pair", 
    "Great price and great looking piece.", 
    "Look great. Worth the money", 
    "Love these sconces. Just wish they were a 3 inch glass cylinder. I had to use candle sticks rather than a 3 inch candle so it is cumbersome to light them. Other than that, they look great on either side of my fireplace mantel.", 
    "I love it. Great product. I'm extremely satisfied with my purchase.", 
    "this sconce set has a great contemporary look, without a bulky look. Perfect for smaller areas to fill", 
    "These are wonderful accent pieces.", 
    "Sconces were a beautiful edition to our wall! We needed something to compliment a painting and these fit perfectly!!", 
    "The sconce are too small. Not very happy", 
    "smaller then I thought they would be", 
    "Just as the picture, beautiful. Love the modern look", 
    "I love these sconce they add just the right flair to my entry way", 
    "The quality was poor and look very cheap. I guess you get what you pay for and these were inexpensive.", 
    "The product is nice, but the size is deceiving. Way too small.", 
    "Good product, no complaints", 
    "I love them! I bought them for my living room. They are not so formal looking which is what I was looking for. They compliment everything I have in the room. I like the fact that they hang on the wall as I have lots of small grandchildren, the glass that holds the candles is high enough that a child cannot touch the burning candle - a safety issue that is important to me. I love the look of candles burning but can't because of little hands, so these are perfect! I burn them with just one light on and the ambiance they give to the room is simply beautiful. They appear a little rustic in the picture but they aren't- much more traditional or conventional. I could not have made a better choice - love them, love them, love them!", 
    "Looks great in my livingroom...", 
    "Bought 2 sets and it looks beautiful.", 
    "Very nice sconces, instead of candles I put fake flowers in them. They look great in the living room.", 
    "Put next to a big round mirror....looks awesome!", 
    "Very high end looking, yet purchased at a great price!", 
    "looks wonderful in the dining room", 
    "These are a little too narrow for the space where I needed them so I should have ordered two sets. I will order another set soon as I did get two sets of the flameless candles. They are beautiful on our wall (one on either side of 65\" TV. The timer is set and these come on automatically each evening and lend a calming ambiance to our home. Love them!", 
    "Looks just like in the pic!! I just wish the candles came with it!! very light weight but is very sturdy!! Super duper easy to hang on the wall!!! Love it!!! xoxoxo", 
    "Pretty ,Looks Elegant on wall", 
    "These look great and were very easy to hang!", 
    "Nice but they're pretty small. The candles are hard to find.", 
    "I'm only using one of the sconces on a narrow wall in my dining room. I like the sleek look, it really blends in with my transitional furniture.", 
    "I put electric tea lights in these they are beautiful", 
    "had trouble finding candles that fit in the holder - less then 3\" and still looked good. For the price, value was ok.", 
    "I liked these so much that I got another set. I have them going up the stairs. I am using battery candles , they light the stairs and hallway nicely. I really like that the glass is tall and protected with metal bands. Please note that you do have to get candles with 2 or 2.5 in bases.", 
    "This beautiful sconce set looks terrific with my new furniture and painting . It really brought out the picture.", 
    "Hard to find contemporary sconces and these go so much better with my room decor! However, be aware the glass is only 2\" in diameter and i'm having a difficult time finding battery candles on a timer that will fit.", 
    "Love them ! Works perfect in my bedroom", 
    "Looks great on my wall. Packaged nicely", 
    "smaller than expected, but nice looking", 
    "The set was such a good price that I ordered 2. Glass inserts were padded and intact. Hanging was simple, and they look awesome. I'm very happy with the quality, and would recommend these without hesitation...", 
    "We ordered this to go along side a very large mirror in our great room. They are a little skimpy so instead of one sconce on each side we put 2 sconces (one complete set) on each side. Looks great and we love the modern sleek look.", 
    "These are just too small and one arrived damaged.", 
    "They look very nice on my wall but I have to admit, they are a little small than I anticipated. Good price for the product.", 
    "Looks great on both sides of my large mirror in my dining room", 
    "Theses 2 sconces are what I needed but it is difficult to find candles that fits in the glass cylinder.", 
    "These sconces fit perfectly on my foyer wall. Adds a nice touch on each side of the art work on the wall. I have placed remote flameless candles on them and it looks lovely lit up when I come in at night .", 
    "These arrived in a timely manner, we're well packaged & look amazing!", 
    "I love my new sconce set. They were delivered in a timely manner and look great in my room...because of the other reviews regarding getting the right size candles to fix inside, I may fill the inside with a scented arrangement...", 
    "they are so small. I am not an expert on what size something should be so next to my 2 gigantic mirrors they get swallowed up. My fault", 
    "I think I probably should have returned them but, they are okay in my husband's bar area.", 
    "I put in gold candles and it looks perfect. Good buy, great price!", 
    "I love the wall sconce set,it's well made and I like the tall glass.", 
    "These are great \"framers\" for showcasing a painting or framed print. I was going to use them in the bedroom to replace sconces I already have, but they were narrower than I thought and were too small for the large wall. Nicely made, although it was a bit difficult finding the 2\" inch LED candle I wanted. 3\" is more a standard size.", 
    "We're very small didn't like them but kept them put them in bathroom", 
    "Look Great Overstock is great", 
    "Look very nice on the wall along with a picture hand painted from Norway.", 
    "These wall sconces are beautiful. I didn't put a candle in them, but put coffee in them for a different kind of decorative look.", 
    "This sconce set is very nice quality and goes well with my transitional decor. I like the two-toned metal. It may be difficult finding candles of the correct size.", 
    "They are just what I wanted! I read the past reviews & ordered the odd sized candles they require . Super happy.", 
    "Love these sconces for the modern touch they add. Good value for the price.", 
    "Pretty much what I expected (as pictured) except I somehow thought they would be bigger. My mistake. They are a bit thinner and lighter than I thought but I am still happy with purchase and will hang them on the sides of my china cabinet. For price - yes, nice find.", 
    "what a beautiful piece. arrived in excellent condition. very satisfied.", 
    "These wall sconces are very pretty and well worth the price. I was worried about the way they looked in the picture (the glass looked smokey), but they were clear glass, and look great on my wall. The only small problem is finding candles to fit. I have smaller candles in them, but am still looking for larger candles that I think would look better.", 
    "I like them - I hung them in my dining room by a mirror and put remote led candles in them. Turned out really nice.", 
    "Very cheaply made. Much smaller that I anticipated. I returned them for a refund.", 
    "nice, but i needed something much longer to accomodate my wall space", 
    "They are beautiful, but small for my taste. One of them arrived bent.", 
    "Was exact size & color I needed! Need to search for correct size candles to fit but worked well!", 
    "I love everything about this product.It really enhanced my house.", 
    "Great little accent pieces at a good price definitely keeper", 
    "Just what it said it would be. It looks grear", 
    "It is very study & expensive looking great for the house warming gift I had in mind ! the price is great !!", 
    "Nice, contemporary style.", 
    "This set is stunning and exactly what I wanted but the only issue is locating candles that fit are not as easy as I anticipated. :(", 
    "\"These look great in my home\"", 
    "I purchased these based on the photo. I assumed they would be a bit larger and more sturdy. They are very light weight somewhat cheap looking. I ended up using them in a basement room since they did not have the classy look I was going for in our main living room.", 
    "Great Wall decor. No compliant..", 
    "We ultimately got 6 of these to light our back patio at night. Just beautiful!", 
    "Nicer than I had imagined absolutely gorgeous", 
    "Is look good for my jacuzzi", 
    "Items are very nice. Glass is very thin though", 
    "didn't expect it to be so lovely due to the price. A must have! Quick shipping came in perfect condition.", 
    "They're simple and elegant", 
    "Great value and looks even better!", 
    "Thought they would be bigger. We're able to use in our bathroom wall", 
    "Love them, they are nicer than they appear in photo", 
    "Nice modern sconce, glad it comes in set of 2. Holds candles nicely.", 
    "These look great hanging on the wall in our entry way. They are perfect for smaller sized walls. They get lost on a big wall.", 
    "I wasn't show what to expect when I ordered the contemporary metal wall sconce set. When they arrived, I loved them. I loved them so much that I ordered another set. They are a little smaller than I expected but nevertheless charming, and elegant. I just order the candles for them.", 
    "Looks perfect on my wall flanking a big mirror.", 
    "Very pretty, I'm very pleased", 
    "These are flimsy and cheap looking. ********* has much better scones for less. Only purchase from Overstock that I truly didn't like.", 
    "Perfectly frames the photo above our bed. Even with nothing in them they look great.", 
    "I love the design, can't complain", 
    "Glass broke same day, flimsy.", 
    "Save yourself the time and buy two sets, you are going to want them. Using them in just one room won't do. A good buy and worth the cash.", 
    "Still look good after a few years", 
    "flows well with our current decor; very cool!", 
    "Surprisingly well made, detailed, and globes are good quality glass. Good job !", 
    "This sconce set looks just like pictured. The are so perfect in the place I have them hanging . The price was amazing for the quality . I like them without a candle in them and have a small black shelf handing with them. I get a lot of compliments on them. The finish is so perfect with other pieces I have bought from Over Stock . I'm so happy with my purchase.", 
    "Could not find remote candles that fit - awkward to lift glass to manually turn them on - construction ok...", 
    "much smaller than I anticipated. Can't really say I like them; however, they matched what I was trying to do.", 
    "Very subtle colors, delicate yet strong looking. The problem is finding candles to fit. Still looking.", 
    "I placed these in my dining room and they look just wonderful. I use flameless candles with a timer and late at night the soft glow of the light plays beautifully off of the scones. Such a pleasing sight.", 
    "I bought 2 pairs of these. They look modern ... beautiful. The hardest thing for me was to find the candles to go in them. I got 2\" round 6\" H", 
    "Perfect for what I wanted", 
    "exactly what I wanted/expected", 
    "Exactly as pictured, love the flexibility of being able to change out the candle.", 
    "I really am impressed with these. They are exactly as seen in the photo. I found some dark green candles similar to the ones in the photo. The sconces are light, but I don't want anything heavy with glass hanging on the wall. The only improvement that could be made is to add some hardware for hanging the sconces. There was none in the box I received.", 
    "I place this in my formal dinning room and it looks great! I love it", 
    "Loyal shopper of overstock for the past 6 years and again I was pleasantly surprised with the quality of the wall candle sconces. Sturdy metal nice glass however the only drawback is no hardware comes with this purchase.", 
    "These sconces look just stunning on my wall. The set is not something that you will see everywhere. If you like something out of the ordinary that has clean lines for your home I would recommend these. I don't think you'll be disappointed.", 
    "these are simple sleek yet elegant addition to my living ro decor. very easy to hang. happy with my purchase!", 
    "Only complaint it's hard to find 2x3 candles to go with it.", 
    "I wanted a contemporary wall sconce set to accent a contemporary oil painting in my living room. The set gave me the look I desired.", 
    "Love it but the glass is quite fragile. Looks great", 
    "Nit as big as I was hoping, but flanked another piece well, should nt stand alone on a wall", 
    "Infact after hanging this piece in the left corner wall in my dining room i just knew i needed another set for the right corner aswell . its so beautiful and elegant ,so i have just placed another order for the second set . i love it and my wife loves it too.", 
    "We have a loft inspired red brick papered wall with a large arched mirrored faux window with faux shutters on each side. These are the only thing I have been able to find that would fit between the window and shutters. Tea light candles work perfect in them.", 
    "Nice addition to wall in bedroom on either side of Artwork. Balances the wall and adds a touch of glamour.", 
    "EXCELLENT QUALITY SUPER FAST SHIPPING GREAT CUSTOMER SERVICE", 
    "I purchased this science set for a spare bedroom that Iam redecorating in a more contemporary look.These fit right in and add the extra finished look thatI was going for.The 2 inch candles that I needed were a little harder to findbut I was able to order some in beeswax and they look great!", 
    "love it- great size . although the little circle was more gold than expected...but overall still like it", 
    "Smaller than I needed, but pretty. Too small for wall space. I set it on shelf.", 
    "I Love it. Havent found candles yet. Having problem finding size", 
    "I bought this set to go with a framed print. The print's dimensions are 12\" x 36\" so the sconces compliment my print perfectly. Believe it or not, this set looks even better in person. It has a vintage appeal and is depicted true to life online. If you are thinking about this purchase ..... DO IT !!!! I think this set is priced right and I highly recommend it. I love it because my house and patio are very zen and the sconces fit perfectly with my decor. Could NOT be happier with this purchase. I am thrilled.", 
    "It's a nice set for the price but I'm having an impossible time finding candles that will fit in the glass, as the cylinders are too small to fit standard candles.", 
    "I just received these and they are exactly as shown in the photo. LOVE them!", 
    "Absolutely love these on the wall in my entryway! I chose candles in burnt orange and the size was easy to find!", 
    "I've been looking for sconces for weeks, beautiful at a great price!", 
    "The style is nice it looks good on the wall, but it's very cheap making and the candle is very hard to find you need a one inch candle for the holder. I could have gotten a better one in Canada", 
    "I purchased one Contemporary Metal Wall Sconce Set to go on the sides of my already existing Wall Art and they match perfectly with and balance the my wall art that I have in place. Again, I have had many compliments on my wall art.", 
    "THIS ADDS TO MY STYLE. VERY ELEGANT AND CONTEMPORARY WAS ABLE TO FIND RED CANDLES THAT FITS PERFECTLY, THE SET LOOKS BEAUTIFUL IN MY FAMILY ROOM. HIGHLY RECOMMENDABLE.", 
    "I got this product broken, it was not what I expected either. As always O.com was there to help me. Great customer service, I would recommend shopping with them to everyone.", 
    "Thought taller pillar candles would look better. Hard to find 2x6 pillars ,though. Settled for 2x4", 
    "These metal wall sconces are attractive and reasonably priced. I am always looking for something \"out of the ordinary\" and this candle holder set fits the bill. As the previous reviewers mentioned, the glass cylinders are not able to accommodate a 3 inch wide candle. However, I have placed a 2 inch flameless votive on the base and it looks great. I placed each sconce on a wreath hanger over two rectangular mirrors on either side of my dining room window and the refelection is striking.", 
    "While I like these sconces and it took me a while to find something contemporary and not ornate, the only problem with them is the narrowness of the candle holder and glass tube. It is very difficult to find any pillar or flameless candles to fit it since most are at least 2.75 or 3\" wide. It appears I may have to go with voltives which is not what I had expected to use.", 
    "I am very happy with this product. They look very nice and stylish.", 
    "Trendy, looks great with my cylinder type beeswax candles. Very nice.", 
    "It is a nice piece of decor, just need to go find the candles to fit.", 
    "I was very happy with the sconce set. It was exactly as it appeared on the site. The color was the perfect to match with my mirror. I looked for a while to find something I thought would be perfect and these are.", 
    "Bought these to share the wall with the floating mirror panels and they are a huge hit. Very pleased.", 
    "This item adds a great essence to my living room decor", 
    "I absolutely love these wall sconces!! They look fabulous on my wall....", 
    "I love these. Hey were exactly what I was looking for to go on the sides of our huge flat screen tv. However, the tv is on a bracket so it sticks out about 9 inches from wall so they didn't look right there. Instead put them in dining room on each side of china hutch. Perfect! Also bought a zebra print rug from OS for dining room. That in addition to these sconces has really transformed our dining room! Disappointed with some defects like bubbling in the paint finish, smudged paint and a small chip but for $XX/set I don't want to be bothered shipping back and forth. They'll stay, bc I love them otherwise.", 
    "2 very nice candle holders which I put in my living room...Look great for the price", 
    "The sconces look very nice on the wall. However, I was a little shocked about the quality fo the glass hurricanes. They are very thin and will scratch easily. Just be careful and they will be a added plus to your decor.", 
    "I expected these to be much better quality than they really are. The metal is very lightweight, and the rim of the glass is cut very rigid, so it's not smooth. Also, the \"design\" on the circular metal part is really just some gold brushstrokes. I'm glad I didn't buy these as a gift. However, they do look okay from a distance. And besides, I put them in my bedroom where no one else will really see them, anyways.", 
    "These sconces are very attractive. They arrived intact; however, there were several blemishes on the metal parts. It appears as though they have been made to look aged; therefore, it is easy to overlook most of the blemishes. Given the price, I did not feel it necessary to return them for new ones.", 
    "this metal wall unit is very elegant looking and decorative. i recommend others to buy", 
    "I loved the wall sconces. I have been looking at them for quite some time but didn't order them because I just didn't have a place for them. I had accumulated some rewards bucks so I bought them for my daughter. She liked them a lot.", 
    "i would definately recommend these to a friend. Looked great in my living room. Goes with everything.", 
    "A very pleasant item to spice up your bedroom. Allows you to add some mood lightening to your room when no natural lightening is available.", 
    "Great qaullity and you can't beat the price anywhere!", 
    "I guess I should have paid closer attention to the measurements on this item. These are definitely smaller than I expected. I haven't put them up because one of the glass insets came broken; but I am going to and see how I like them for a day or two. But I have a feeling they may be going back.", 
    "I love this set..it compliments my wall perfectly!", 
    "These look good. I ordered them at first sight without really reading all the description (the price is what attracted me). They don't come with candles though, so I'm looking for some battery powered candles with a timer for them.", 
    "I am very pleased with this purchase. We did not place candles inside because we have safety concerns. I may place small colored pebbles inside or something to give it color. Overall, I am very happy with this product.", 
    "The sconces arrived at my house packaged separately from the glass tubes, but in the same box. Not a scratch on anything. They look just as described and are lightweight, so a small nail holds them up fine. I have ordered 2 2x6 candles from 100candles.com, thanks to another reviewer. They look great and I cant wait for my candles to arrive!", 
    "this was a great buy the item is made of metal and it is a little light so be careful where you put them. the design is awsome with my decor all in all great product", 
    "Nice looking, especially for the cost. The main problem which is misleading in the description is that you cannot use a standard 3\" pillar candle. The glass is only 2-5/8\" in diameter & the base isn't even 3\" wide. So, it's hard to find a smaller candle to fit these dimensions. A taper candle would look nice if you could figure out a way to hold it. Otherwise, they look great!", 
    "These wall sconces were very unique, not something you see in stores. I haven't found a candle for them that fits just right yet, but the ones I am using are fine. I have them on each side of a black framed picture, and the grouping looks sharp.", 
    "I'm enjoying my wall sconces but would have enjoyed them better, a little taller.", 
    "these are very slim (may be challenging to find the correct size candles) as others have written as well. i chose to fill the with glass beads instead of candles to add a pop of color to a wall in my livingroom.", 
    "Just came in the mail today. The candle-holder base on one was bent, but I just bent it back. The glass arrived intact on the first try! Overall these are sharp pieces. There are notches to hang them up behind those upper medallion-pieces. They're very light and pretty thin, but they're only made the hold candles and sit on the wall, so it's not a problem. (On my computer) The picture makes them look almost black, but the set I received is a warmer antique bronze color with the brushed medallions having more of a gold hue. That's actually closer to my room's scheme anyway. Also, it doesn't say specifically, but the candles themselves are not included, so you can pick your own color. Very cool addition for a small price. Very happy with them.", 
    "I am very please with this pieces modern easy to hang not heavy.", 
    "These are very nice, but they are darker colored than pictured on my monitor. I put slim flameless candles in them and they are lovely together.", 
    "I wanted this sconce set for one room but when they arrived I liked them so much better that I placed them in my main living room. It is difficut finding candels to fit. They need to be tall but small in diameter but not as small as a tapper.", 
    "When I open the box I was surprise by the size of the candles for the area that I wanted to put them, but I'm working with the size and wall space.", 
    "These are really pretty. I filled them with dried flowers and put them on my wall.", 
    "absolutely love these! the color is great and i love the contemporary design. they are smaller than i thought they would be, so i am glad they came in a pair.", 
    "Perfect decor to compliment my living room. Quality of product meet my expectations. Product is true to site.", 
    "I purchased these for a corner wall and they look great. They are a little smaller than I would have liked but they do just fine.", 
    "I enjoyed what I received. It looks good on my wall.", 
    "Fits perfect in my sconce niche, matches well to my contemporary settings.", 
    "I was looking for a sconce for my bedroom that my husband and I recently spruced up. Went to a couple of sites and stores saw different prices and styles but the price and design of this product made me purchase it from O. I actually bought 4 and they now hang 2 each on either side of my tv on the wall, it looks really nice very happy with the purchase.", 
    "This is my second purchase ever from Overstock.com, my second less that ideal transaction, and I am probably not going to make any more purchases. This item comes across to me in the picture/description as classy, sturdy and dramatic. Not really so. First, it is not a quality, substantial product - it's light and bare bones - no frills and certainly not an item you would look at and comment on the quality. It attachs to the wall with one nail, yes easily, but for something that you might put candles in and burn, you need to be darn sure it won't fall down and I am not 100% convinced. It requires pillar candles, yes, but not the pillars you are thinking about - they are odd shaped pillars that I have never seen and I am a candle person. There is nothing to put the candles on which means that, if used as is, you would have to take it down off the wall to really clean it. Finally, the glass tubes that house the candles are not finished well on the ends. All in all, I guess you get what you pay for but, for my money, I'll stick with **** and ****.", 
    "I love my sconce set, infact I bought two. they are perfect for my smallish dining room and the candle availability makes it perfect for soft relaxing dining. I would highly recommend this set.", 
    "I love these wall sconces...they look exactly like shown on the web site and look great in my home. I have even considered getting another set. It was difficult to find candles small enough to fit...had to go on the internet to locate the candles....found a web site that responded very quickly and had a great selection. This may be something to considere when buying this sconce set.", 
    "Looks great on the wall. Nice fit in my living room.", 
    "these are very nice sconces. The glass chimneys are narrow and finding the proper candles took a bit of searching. They are really great and functional.", 
    "Being a designer I am always looking for small decorative items that look expensive and can enhance any area. These scounces fit the bill! Love them!", 
    "These are really nice and go well with the decor in my living room. I couldn't really tell the color of the metal very well in the picture and was hoping they were more of a silver/nickel/pewter color. They are actually more of a bronze, which didn't match well with my room. I bought some great textured spray paint from Home Depot in a pewter color and was very pleased with how they turned out.", 
    "The only draw back was the wall sconce were not as large. They looked larger on overstock website. But a nice comtemporay touch to any wall.", 
    "The sconces are beautiful. They go good with the pictures on my wall", 
    "I ended up repainting one after making adjustments and placing it in a different location from the other one.", 
    "I wanted these sconces because they were the only ones I could find ANYWHERE that would sort of match my wall art in my living room. Once they arrived, I was pretty disappointed in their quality. They are very cheap looking. The pieces are not welded together well and the bars are not very straight. Despite this fact, they work for my use. From a distance the welding is not obvious; the crooked lines are more noticeable. I'm not super particular about it, but if you are looking for perfect sconces do not buy these.", 
    "I was needing some accent items above my fireplace that went well with my artwork. These were the right size and color. They look great. Couldn't find anything that worked in any store I went into. Glad I found these.", 
    "They truly accent my contemporary taste. They were easy to hang. No real assembly required.", 
    "Great product! looks just like picture. havent looked for candles to fill it yet, but it does seem difficult...", 
    "Very nice looking in the half way of my staircase. Can't really find 2\" wide candles much so you will need to look around online. I got mine on *****.", 
    "I thought these would be great to cover an area in our wall in which the previous owner had their surround sound. They work just fine for that but the glass is very poorly made and they are not as nice as they appeared. They work for what we needed but we will definately upgrade to something nicer.", 
    "It's always difficult to purchase something like these sconces without being able to actually see and feel the product first, but we really liked the design and decided to go ahead with the order. We were not disappointed in the least and we would have picked this same unit even if we were able to see it in a store first. It fits perfectly with our decor and we are very pleased with the quality and design of these scones.", 
    "This sconce set is small, but perfect for the narrow spot I needed to fill. The style has a lovely Asian flair which really compliments the ***** furniture in the room. Another commenter mentioned the candle size challenge (2 1/2\" diameter max.), and I agree they are not easy to find. At ****** I found a lovely candle set in ivory -- they work perfectly. This is a great bargain.", 
    "They were the perfect size I needed. A tall votive candle fits perfectly in the base. The glass was very well packaged.", 
    "This trendy modern metal scone is perfect for my small bedroom. It adds to the urban setting.", 
    "This is a nice set for a secondary wall. It's rather small, but seems constructed fairly well. It was not a disappointment.", 
    "Wasn't what I perceived to be in the photo. True iron look, not black; gold undertone; glass sits well in inserts.", 
    "Very nice sconces but,hard to find candles that fit the sconces.", 
    "These sconces were very nice looking...It was difficult trying to find 2\" wide candles to fit them, though...I really wanted the remote control candles to put in them but couldn't find them to fit...", 
    "Great buy and love them on my wall on either side of a piece of metal art work that I already had. I actually put two tall battery operated candles inside the original glass (left them in their frosted glass) and now they come on automatically! Love them!!!!!!!!!!!! Never disappointed in stuff I buy from Overstock!", 
    "I'm very happy with these sconces. They flank a large framed print resting on my fireplace mantel and are the perfect size for the space. I also appreciate the more contemporary style of these sconces in comparison to most I have seen. They have a sleek and modern appearance. The metal circle on each sconce has subtle gold undertones which I also really like. I'm very pleased with my order!", 
    "I love these,actually tried to order them a while ago and they sold out but as soon as they came back in I ordered them.", 
    "I LOVE my new wall sconce set! It looks exactly as seen on OS in both color and size. I cut out \"paper\" to the measurements of the set to tape to the wall to see if it would work where I wanted it to...and then this also helped me to hang the set as well. It is very durable and of high quality. It was wrapped and packaged and arrived without any problems. I would definitely refer this product to a friend. It does only take 2\" diameter candles~and they are not the easiest to find and do not come in multitudes of color, but I did finally find ivory 2\" diameter pillars and they look great!!! If you are having any doubts about this product, don't, it is definitely worth it!!! Thanks OS for a great product...I will continue to shop with you!", 
    "Exactly what I was looking for. Redecorating my daughters bedroom in Asian and these go perfectly. We put remote control flameless candles in them and they are beautiful.", 
    "The sconce set looks exactly as it is shown. The only issue is finding pillar candles that are 2in wide to fit. Otherwise, I would fully recommend this product", 
    "These fill a wall space nicely. They're just large enough. Well made, easy to hang. I haven't tried them with candles yet, but I'm sure they'll look great. Very pleased.", 
    "Haven't been disappointed yet! I doubt seriously that i'd find this bargain anywhere! Quality, light weight, a easy looker. LOVE IT!! Adds a nice calm to my asian room. Buy It! don't second guess it, it's a no brainer.", 
    "These metal sconces are very nicely made and look beautiful on my wall. They arrived in perfect condition and in a timely fashion.", 
    "I just move in a new apartment and order two set of Contemporary Metal Wall Sconce Set and love thems. I just love order fro overstock .com thanks", 
    "Thanks ,Overstock for the great deals on my contemporary metal wall sconce set LOVE IT!", 
    "Item was delivered in a resonble time. It was well packed and the item was of great quality. The picture on the website was exactly what i recieved.", 
    "Did not even need to fully unpack this was so ugly. Definitely not as pictured. Should have known it was too inexpensive to be good quality", 
    "These are just okay. Was going to send back but found a perfect place in bathroom, where they do look nice. Shipping back would of cost me around the same as I paid for item", 
    "I whould not recommend this item to anyone! Still trying to find piller candles to fit in the glass, plus the glass was very poorly cut. Not worth the money at all.", 
    "The candles holders where great they came in a package and none where not damage i would always try to shop here if i can Thank you", 
    "these were much smaller that i thought but still were decent quality for the price", 
    "I loved these sconces however, it is difficult to find taller candles to fit into the holders. They are a beautiful addition to my decor. The colors were slightly off from eachother but if you keep them away from eachother they are not noticable. A good product for the price.", 
    "I love the hold.but having problems finding candles that fit.the colors is what I wanted and needed.if I cant find candles will have to return item", 
    "Poor quality. Inferior glass, the metal was crooked. Appeared larger on line. Boxed these up and sent them back", 
    "I received these wall candle holders well packaged. Then I opened the box and was very dissappointed. The contemporary wall holders are not too bad but the flimsy glass to place the candle in is. The dimmensions of the glass cylinder is more narrow than described. I know of no candles that will fit inside. My other concern is the thin glass with the candle flame, surely will break. If they are for decoration, fine but for those of us who light candles, useless. Would return but the return charge is so high with the glass.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Contemporary-Metal-Wall-Sconce-Set/4777738/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4777738/Contemporary-Metal-Wall-Sconce-Set-fe5bb845-0dc6-4d02-9ec0-0c82bce4764c_600.jpg"
  ], 
  "description": "The abstract and geometric design of this contemporary iron wall\nsconce set brings sophistication to your living space. Modern form\nmeets useful function in this iron and glass set. Safely light\npillar candles in this iron wall sconce set with no worry of hot\nwax spillage. This contemporary and stylish sconce set creates an\nelegant and romantic atmosphere. Constructed of ironClear glass inserts includedFor use with pillar candlesMeasures 16 inches high x 4 inches wide x 3.5 inches\n  deepMaterialIronTypeSetAccent TypeWall SconcesColorClear"
}