{
  "name": "Corner_Flip_Flop_67-inch_High_Folding_Bookcase", 
  "price": "EUR 137.32", 
  "reviews": [
    "Needed no tools to assemble. I've had many compliments on it.", 
    "I really love this corner bookshelf, especially the fact that it takes only 5 minutes to set up! My only concern was that it did not stand even in the corner of my living room on the carpet. I had to affix a small piece of wood to the bottom of one leg in order for it to stand up straight.", 
    "The first bookcase I received was defective. I called Overstock and they were very helpful and courteous. We arranged for an exchange (as the bookcase is fabulous) and I was sent a label via internet. My new replacement bookcase was delivered before I was able to even take the other bookcase back to UPS. The only suggestion that I would make is when a large item is returned for being defective it would have been nice if O had UPS pick it up at my home. The box was so large that I needed another person to help me since my husband was deployed. I absolutely love this piece of furniture and would recommend it highly. So easy to assemble and very steady and sturdy.", 
    "An interesting shelf, makes good use of a corner and was easy to put together. Keep in mind it arrives in three separate boxes...not all at once in one carton.", 
    "I was very happy with my item. It arrived very quickly and none of it was broken or missing any parts. I put this on carpet so i needed to make a few minor adjustments so it can sit flat.", 
    "Well constructed and easy to assemble.", 
    "Very easy to assemble. Perfect for my family room to display my blue and white collection. Will buy another one in walnut when they become available again!", 
    "This was easy to assemble and looks nice in the corner. It doesn't hold many books and you can't put the max on the shelves b/c they are not 'held' in all in all a good purchase.", 
    "This arrived in perfect condition, and I had it put together in less than five minutes. It looks very nice and appears to be sturdy. I bought it for my mother's bathroom, and it holds everything very nicely.", 
    "I ordered two of these - one to go in my living room and the other one for our formal dining room. They are GREAT and stand perfectly in the corner, even though the floors are carpeted. Assembly took NO time at all and I'm trying to figure out if I need to buy another one. :)", 
    "Fell apart in a few days....", 
    "little wobbly, had piece of wood torn. Used super glue on torn wood and stacking.", 
    "It fits nicely. Using it for bookcase for cookbooks in kitchen and was able to make it all work. It comes mostly assembled already so easy. Looks nice! One smaller nick/notch in it, but is hidden from view for the most part", 
    "Great for a tight space pretty no assembly required I love this piece", 
    "I needed storage in a very small bathroom that blend with the medium brown wood cabinetry, and this was pretty close. It's a bit darker than medium brown (not as dark as espresso though). The shelf comes assembled, so it was super easy to set up. Nice in tall with lots of storage but with a very small corner footprint. Looks very nice for prefab furniture.", 
    "WORKS JUST GREAT IN THE NURSERY. BOOKS AND STUFF ANIMALS HAVE A HOME. LIKE IT SO MUCH, WILL ORDER ANOTHER.", 
    "So flimsy in my hardwood corner that I'll have to return it. It collapsed on top of me twice while trying to stabilize it and there's no way I'd risk putting anything valuable or half-way fragile on it. Bummer because it looks great.", 
    "Received the product and the dowels were not lined up to match the pieces. Had to return it.", 
    "Shelf was easy to assemble and looks great!! Very sturdy", 
    "was ok, no real assembly reqd, just some hinge screws were stripped out and had to be repaired which is not easy in particle board", 
    "I love these shelves! They are exactly what I was looking for. Very sturdy and easy to set up.", 
    "A true \"flip\" or folding shelf in a handy corner design. Solid wood, light in weight. Easy to (dis)assemble. Perfect for small areas to put corner space to use.", 
    "This practically assembled itself. It just folds together, and then you stand it up. It's not the most stable bookcase in the world, and I wouldn't have your kids climbing on it. But for its convenience, ease of assembly, and good looks...it's great.", 
    "Great color and finish but the bottom shelf which determines the entire bookecase's stability will collapse in the blink of an eye sending everything flying. I did not return it; I rarely return anything so it sits in a corner with very few things on it and nothing breakable.", 
    "is good for the price, is pretty flexible, and it work with my necessities."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Corner-Flip-Flop-67-inch-High-Folding-Bookcase/6310520/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6310520/Corner-Flip-Flop-67-inch-High-Folding-Bookcase-205b0488-9098-4aa0-be2d-469765a2b80b_600.jpg"
  ], 
  "description": "Store your books and trinkets with this convenient bookcase. It has six shelves to house your books, decor and photographs, and it fits in the corner of a room to save space. This bookcase also folds up for easy moving and storage.Contemporary design with hand rubber lacquer finished hardwood for durabilityStore items on six shelves that also fold up for convenient moving and storageDimensions are 12 inches wide x 12 inches deep x 67 inches high Model is HBCFC6712StyleContemporaryMaterialWoodTypeBook ShelfFinishCherry FinishAssemblyAssembly RequiredColorBeige, Brown, Red"
}