{
  "name": "Dainty'_Matte_Silver_and_Crystal_1-light_Chandelier", 
  "price": "EUR 111.53", 
  "reviews": [
    "I purchased this chandelier for a master bath remodel. The item was reported as being shipped and I was charged for it but never received it! I contacted customer service and after a search was conducted, the item was not located. It was then noted that this item had been placed on backorder and now a month later I have not yet received it nor have I been contacted by Overstock.com either. All contact has been initiated by me! I am extremely dissatisfied with the customer service (or better termed customer NO-service!!) that I have experienced with this situation! In addition, I ordered 2 matching chandeliers that had key parts missing in them as well!! The missing parts haven't been shipped yet after 2 weeks!", 
    "Ok - I'll begin by saying that the trouble was worth it! It took 3 attempts before I finally figured it out. Unlike other reviews, I will spare you the agony of trying to figure out how to assemble the chandellier. If you follow these steps, you'll be done in no time. first, take the doublle strand crystal (short #7) and clip them on the lower inside flowers (like a V - from one flower to another), do the same on the top flowers with the crystal long strands (#6). Long single crystals (#4) get hooked in the top inside scrolls by the light. the restof the single crystals go on the top and botton medal scrolls. It's really that simple. Jus tmake sure that when you connect them to the flower, you connect ONE end of the crystal stand to the NEXT flower (not the same) and whoalah! You're done. I wish someone had posted the instructions for me :) I'll post a picture of it once my bathroom reno is completed. ENJOY!", 
    "My neighbor helped me hang this over my bathtub. It is absolutely perfect and I just gaze and stare at it while I'm taking a shower. It is just the right size and sparkles beautifully. The only downside was the assembly!!! Putting it together was easy (imagine pulling apart keyrings to attach to different parts of chandelier) but knowing WHERE to put the crystals was the whippin! Overstock should be ashamed to send out the directions it did! The diagram was small, the instructions were vague and you couldnt tell where each crystal belonged. I even pulled up the pic on o.com and tried to enlarge it to figure it out and that didn't even help. Each crystal or strand of crystals has to be attached. I still don't know if I put them in the right places, but it sure is pretty!!!! It took about 40 minutes to attach the crystals (I messed up and put the wrong ones in the wrong places twice after I kind of figured out the diagram) and then about 45 minutes to hang.", 
    "loved it perfect for a small bedroom. go by the room always turn the light on just to see it it looks beaurtiful.", 
    "I love my new chandelier! After reading some of the reviews I was concerned about putting the crystals on but in actuality, the instructions are pretty much straight-forward although I did have to look at it a few times just to make sure I was putting it where they go. I have this hanging above my new whirlpool bathtub in my new master bathroom and it's absolutely gorgeous! It completely finishes off my new bath.", 
    "I ordered the chandelier to hang in my bathroom. The description didn't mention plastic beading or florettes, and the chandelier had both. The beading is along the arms of the chandelier was plastic. I think it would be fine for a child's room or bathroom, but I thought the plastic looked cheap. I had already returned a similar one for the same reason to one of the home stores. Customer Service was excellent in the matter, however, and agreed that the description didn't include info about the plastic parts, so the associate was very kind to wave the return shipping fee.", 
    "This is an awesome looking chandelier for the money. It has such sparkle and bling and is perfect for a small room or entry area. It completely made my new bathroom shine. The only negative thing I can say is, the directions for hanging the crystals are vague and the process of hanging them is time consuming. But it is worth the time once you see the finished product. I love this light so much I purchased another chandelier from Overstock!", 
    "The size of the chandelier is perfect for what I wanted. The crystals look great and really reflect the light nicely, however the \"matte metal\" of the chandelier looks so cheap that it almost appears to be plastic. I bought a really inexpensive little chandelier at IKEA for my daughter's room for $24.00, and hers actually looks better than this one. I was trying to go with a \"brushed nickel\" finish to match my bath pieces, which is why I chose this finish. I feel it is way overpriced for the quality of the appearance of it.", 
    "It arrived in about a week. There are no instructions and the picture is hard to follow, my fingers hurt after a while and had to tape them to keep them from getting sore. Getting those crystals on was a little work, but the chandelier is beautiful. It was worth it. Took about an hour to assemble. I love it so much I bought two.", 
    "beautiful chandelier that looks far more expensive than the actual price!! highly recommended!!", 
    "Lovely fixture and great price. Used it in my 3 year old daughter's room and she loves it. Directions for attaching the 50 individual crystal pieces are horrible.", 
    "We used the mii chandelier over out claw foot bath tub in our rehab of a home built in the 1780s!! Size, look, little bling was perfect!", 
    "I decorated my laundry room and wanted a mini-chandelier to really dress it up. This chandelier is adorable and everyone that sees it loves it. It really gives off a lot of light as it is the only light in the room. I am very pleased with the final result!", 
    "I bought this chandelier for over our tub in our new master bath. I looked forever for something in a matte silver/nickel finish and while this isn't quite matching to our brushed nickel faucets etc it will do just fine. It isn't too over the top, and would be lovely In a girls bedroom or masterbdrm also. I had no issues putting the crystals and strands on, the instructions included seemed straightforward to me. Now I can't wait to get in the tub and enjoy it!", 
    "so so pretty. goes perfectly", 
    "I love my little chandelier -- it makes rainbows is the daytime and is soft lighting at night. Having said that, it's clearly very cheaply made. I", 
    "but it is more small tha t i was expecting", 
    "A little less flashy than I was hoping for, but I think that is because I chose brushed silver....should have gone with shiny silver....but it is very pretty and also very economical.", 
    "Beautiful, takes some time to decorate but it's worth it! Nice quality!", 
    "This was a little difficult to put all the baubles on but it turned out beautiful.", 
    "Simple and sparkly, it looks great in my daughter's room.", 
    "such a lovely item to display in a girly room1 Very beautiful and pretty!", 
    "I PUT THIS IN A SMALL GUEST BEDROOM, AND GET COMPLIMENTS CONSTANTLY. lOVE IT", 
    "Directions could have been a lot better. But it is very pretty and lots of compliments on it.", 
    "Perfect above the kitchen sink and affordable. Very happy with how it looks.", 
    "Bought this for my daughters bedroom and love it!", 
    "Perfect light for my bedroom. I love it", 
    "I hung this chandelier in my closet . It's beautiful and makes my closet so inviting !", 
    "Small and looks great in my closet. Love it!", 
    "This light is dainty and cute. We hung it above my soaker tub for ambiance more than light. But the matte nickel finish is a bit cheap-looking - like spray paint. But since it took forever to put on all the crystals, I don't have the heart to tell hubby I want to repaint it with glossy paint.", 
    "Very pretty and a delicate look. Have this in a small hallway. Gives a very nice ambiance when lite!", 
    "This arrived in small packages of about a hundred parts..each crystal had to be wired on to the stem separately....etc. What a time consuming mess.", 
    "The matte silver is a nice touch for an understated but yet sophisticated chandelier. The crystal come wrapped separately which is a much better way to ship items of this sort. I haven't hung them yet, but I'm sure they will look perfect in my walk-in/dressing room.", 
    "Put this in my little girls room and I love it! It refracts a lot of light and the girls love it. It is gray-which matches their gray walls perfectly. It's adorable! Way SUPER easy to put together!!", 
    "Purchased this small chandelier to hang over the Jacuzzi tub. Very classy for a great price. The light is fine for a small space or where other lightning is available; however, this would not work well in a large area or where other lighting is not available.", 
    "I bought this light for my daughters bedroom. Wow, love the way it lights up her room. Very beautiful! And great value. Thank you Overstock!", 
    "We purchased this as a cheap replacement for a chandelier that we wanted to reserve when we sold our house. All those little glass droplets had to be installed which took quite a long time. The directions weren't very clear and in the end I think we got what we paid for. I'll bet the new owners will replace it pretty quickly for something higher quality.", 
    "I got this for my daughter's room and it's perfect! Beautiful and elegant, just like her. :)", 
    "The chandelier is exactly what I wanted and hoped for. I give 5 stars for the product, but the instructions were very difficult to understand the assembly. If it weren't for other shoppers' feedback, I'd have been lost. In the end, it was the perfect addition to my daughter's bedroom.", 
    "The silver and crystal goes well together. It is perfect for our nursery! :) love it!", 
    "Came quickly. As depicted.", 
    "Real glass crystals! Just enough bling for my bathroom. But the instructions were printed so lightly that I could not read them-had to go by the picture on the web. Even so-I think the fixture rates 5 stars. Great price!", 
    "Cute piece which accentuates my office space. The only reason I did not give it five stars is because I had to put all the crystals onto the base.", 
    "Based on the price, I wouldn't have expected it to be high-end. It looks nice in my foyer.", 
    "I bought this for my bathroom and love it! The quality was great for the price.", 
    "I looked for weeks for the perfect chandelier for my bathroom, this is it. It is a bit of a pain to put together, but I just sat down with a glass of wine and it was done before I knew it! Well worth the effort.", 
    "Ordered 2 of these and both arrived rusted on the bottom. Returned.", 
    "I was so excited when this chandelier arrived, and then so bummed when it broke immediately after unpacking it. The metal is obviously cheap. It was upsetting that one of the little filigree things arms broke off right out of the box. We fixed it with some crazy glue, but are wary about how long it will hold. The directions are awful. I'm still not sure we assembled it correctly, which also affects my overall satisfaction with the light. Like another reviewer said, make sure you order a light bulb. The fixture doesn't come with one, so it required a trip to the store to finish installation. For the price I paid, I hoped for better.", 
    "I love this chandelier..I bought this for over my slipper tub..It looks fabulous..I get a lot of compliments on it..so happy with my purchase", 
    "Wanted something small and dainty to go in the master bath. This little jewel fit the bill. I had no trouble putting it together and love the new look in my master bath.", 
    "Not really what I was expecting. Seemed a little cheap...so I returned it.", 
    "The chandelier is beautiful and the quality of the crystals is very impressive. For the price, I was afraid I was going to get plastic and they are definetly glass. The light was packaged very well, and it made installation easy, even with all the intricate pieces. I was a bit disappointed with the metal used to make the light. It's very light and the light looked very cheap before all the crystals were put on. Still, I'm glad I ordered it, and for my small bathroom, it's perfect.", 
    "Loved this perfectly dainty chandelier. it is for pure decoration in my new walk closet. I have recessed lighting to provide the necessary light. But this beautifully dainty fixture makes just the right statement for me.", 
    "Too beautiful not to have: After viewing thousands of chandeliers suitable for my en-suite I had this beautiful chandelier shipped to New Zealand, the courier service was very fast,.I had no trouble assembling it in a reasonable time, the end result hung is stunning. I would recommend I that you also purchase a bulb with the chandelier purchase as the required bulb is not available in New Zealand.Perhaps the vendor should make this offer on their site.I would fully recommend this chandelier - it is greatly admired", 
    "This is a very pretty fixture and a good value. The crystals are nice and do not look cheap but the silver finish does. I was going to hang it in my master bath which has plenty of natural light but the finish took on a \"bluish\" hue and it did not look right with the rest of my brushed nickel. It was a challenge to assemble due to very poor nearly non existing directions. After it was all said and done, I ended up returning the fixture primarily due to size and color. Overstock was great to work with and it was an easy return. I will look for another fixture and buy from overstock again."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Dainty-Matte-Silver-and-Crystal-1-light-Chandelier/6420163/product.html?recset=bbd1c0d9-3866-4ebc-a44d-470c2e3edb03&refccid=YMLL7KGZNVZKP32OYHN65NFVEY&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6420163/Dainty-Matte-Silver-and-Crystal-1-light-Chandelier-cdf95474-6d4c-498a-bab9-617017b0efab_600.jpg"
  ], 
  "description": "Illuminate any interior space with this crystal chandelier while\nadding a note of elegance and class. Graceful and delicate, this\nsmall drop chandelier hangs from a long adjustable chain that\nallows you to customize height to match your personal preferences\nand to accommodate different spaces. Hang this stunning fixture in\nyour foyer to make a great impression when your guests arrive. The length of the chain is 39.5 inchesSetting: IndoorFixture finish: matte silverShades: Clear crystalNumber of lights: [1]Requires one (1) 60-watt candelabra (E12) bulbs (not\n  included)Dimensions: 19.5 inches high x 11 inches wideMounting plate dimensions: 5.2 inches diameter x 1-inch high\n  ighStyleShabby ChicMaterialCrystal, Metal, SilverFinishMatteNumber of Light1 LightHeight17 in to 20 inSwitch TypeHardwiredAssemblyAssembly RequiredBulb Wattage60 WCeiling Light Fixture TypeChandelierColorBlack, Brown, Gold, WhiteLight Bulb TypeCandelabraLight DirectionMulti-directionalLighting StyleTraditionalLighting TypeChandeliersWidth16 in or less"
}