{
  "name": "Dark_Taupe_Reclaimed_Appearance_72-inch_Corner_Accent_Etagere", 
  "price": "EUR 142.94", 
  "reviews": [
    "super cute and sturdy. I use it in my daughters room for decor. easy to assemble", 
    "This would get 5 stars if it wasn't so difficult to put together. However, for the price it is worth it. My poor husband (who is pretty handy) spent hours putting this together. We recently bought a home and have had to put together a lot of furniture pieces from other places (i.e. *******, ****, etc.), and he said this piece of furniture was by FAR the most time consuming. The finished product looks awesome!", 
    "Love this! Looks rustic/shabby chic and contemporary at the same time", 
    "Love this! This really took my apartment to the next level.", 
    "Excellent value for the money. Not the easiest item to put together, at least for me. Looks nice in a sun room for my plants.", 
    "Using for my plants. It works. Not as tall as I expected.", 
    "I am so pleased with this piece! It came well packed and was simple enough to put together. The color is true to the photo. It is sturdy and looks really great!", 
    "Great looking piece. Easy to assemble.", 
    "Just what I needed to add some height and brightly colored accents to a dull corner.", 
    "If only all the pieces did not arrive completely broken in half, the case could be nice looking. Maybe, it was packed incorrectly since the long box was a flexible box. I didn't reorder thinking someone might end up backing it the new one the same way."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Dark-Taupe-Reclaimed-Appearance-72-inch-Corner-Accent-Etagere/9673113/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=9", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9673113/DARK-TAUPE-RECLAIMED-LOOK-72-H-CORNER-ACCENT-ETAGERE-6b888587-2d4e-4de2-ad79-e76b844d3a94_600.jpg"
  ], 
  "description": "Place this lovely Etagere in any corner of your living room or den, and bring sophisticated charm to your home. Perfect for displaying hardbacks, colorful vases, artwork or photos, this contemporary bookcase provides five shelves that form a unique triangular-shaped design. With its neutral dark taupe color that resembles reclaimed wood, this Etagere has an elegant look that blends with modern dEcor.Set includes one corner accent EtagereMade of particle board and MDFDark taupe reclaimed look for elegant appearanceMeasures 72\"H x 18\"W x 18\"DStyleContemporaryMaterialLaminate, MDFFinishTaupe FinishShelf TypeEtagereAssemblyAssembly RequiredColorGreyNumber of Shelf5"
}