{
  "name": "DHP_Zoe_Convertible_Futon_Sofa_Bed", 
  "price": "EUR 263.69", 
  "reviews": [
    "We bought for a kids' rec room/family room and we really like it. It looks great and is perfect for low-the-ground seating. We had intended that it would serve as a place for guests to sleep but it would not work anyone to sleep on for any longer that one evening. In \"futon\" mode it's midway between and full size bed and twin. Also, it would not be comfortable to sleep on for any length of time. The middle of the futon is not cushioned; also the top size is not very well supported. Do not buy this bed expecting to let anyone other than kids or a very slight adult sleep on it. If you are buying it for low-cost, good quality seating that takes up a limited amount of space then it's perfect. Also, it was very light and easy to assemble for one person.", 
    "I bought this Futon thinking I could use it for a lounge spot in my office. When it arrived...it was SMALL!!!! The futon is not terrible in itself, but I was shocked how little this thing was... I gave it to my kids to put in their room for sleepovers....Did I tell you thing is small??? geeesh....There is very little to this Futon, but its great for Kids bedroom.....DId I say it was little?", 
    "It was a nice product but I wish it were a bit sturdier.", 
    "This is easy to unpack and set up. It makes a great occasional seat, but it is very firm and I would not recommend for relaxing or watching television. I use it in my office and my dogs love it. The fabric is a lovely gray and it has held up with animals lounging for almost a year.", 
    "Smaller than anticipated for my space. Lower to the ground than expected.", 
    "This looks great in our music room. It has a cool modern/retro look but it is very small. We needed it to be small for the space, though. It is quite firm so I wouldn't recommend sleeping on it but its great for seating in an area that isn't used frequently.", 
    "Such a great itemEasy to use", 
    "If looks were everything, this futon would be perfect. Unfortunately it's not comfortable at all. In a short period of time, it progressively worsened.", 
    "I do like it, but I feel it is def not for a living room space. I live in an apartment and wanted something simple. It is way to firm, and doesn't seem as it can carry much weight on one of the sides. It is very low in size and hard to get up from if you have been sitting on it for a while. It is now more fit for my 3yr old, since it is more of her size.", 
    "Item was true to color and description. Great product and quality for the price!", 
    "Perfect addition to my sons room for guests.", 
    "Well made. Low profile nice fabric. Easy to put together", 
    "It's hard and not comfortable plus the fabric is not soft.", 
    "Box came Damaged and the liner was ripped underneath, had to send it back. Very, Very small. Only Suitable for a kid or Very Small person.", 
    "Love it. I wil buy another one in a different color for another room!", 
    "Unfortunately this futon sit lower than I thought it would. Not good if you are a tall person. I'm only 5 feet and it's to low for me. Not good for long time sitting make the knees hurt.", 
    "It took my 14 year old daughter about 20 mins it looks great a few throw pillows and it makes the office perfect and it's very comfortable! Great buy, love it!!!", 
    "The padding is stiff but not in a way that makes me feel that it will last. Also the front half slopes down a bit which makes it a litte more uncomfortable sitting on it because it is already low to the ground. With that said the price was very low and I didn't want to go through the hassle of returning such a large item. It works in my home office.", 
    "It's nice to have in a office or spare, the style is great the material as well.", 
    "This is SO nice! Has a heavy linen sort of feel and look to it. Beautiful gray color. Very comfortable to sleep on (it's a bit on the hard side but I like that!) Easy to open. Worth the price I paid.", 
    "really bad quality, the legs are held by tiny screws, sending back", 
    "Better than I even hoped for.. Beautiful linen, beautiful sofa and very comfortable", 
    "This is a terrific looking futon. It is true to color and perfect for my small office/guest room. I was told that the raised areas are uncomfortable to sleep on. A thick blanket helped to minimize the discomfort. Best for younger bones to bear. Use twin flat sheets, over the blanket padding, to cover.", 
    "After two months most springs pooped out of place. Now is very uncomfortable to seat on the futon or sleep in it. Two big holes formed where the springs broke. I do not recommend this product to anyone. It is very low quality.", 
    "Cheaply made, great color and fabric, but way too small", 
    "This is the one of the best priced and nice looking futons I found researching on the Internet. The futon looks as great as it does in photos. It is very chic and it can comfortably hold three adults. I can lounge on it for a few hours without discomfort.", 
    "Very nice design but not comfortable. Slept on it for two days while transitioning my daughter to her room and it was worse than sleeping on tile floor. Had to return it because one of the legs fell off and I couldn't screw it back on because the holes where the screws went were stripped.", 
    "Way better the the **** version. Firm elegant easy to assemble!", 
    "HAVE YET TO BE DISSAPOINTED WITH ANY OF YOUR PRODUCTS"
  ], 
  "link": "http://www.overstock.com/Home-Garden/DHP-Zoe-Convertible-Futon-Sofa-Bed/9118413/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9118413/DHP-Zoe-Convertible-Futon-Sofa-Bed-58ad1ad9-f270-43b7-864b-2cb4ad5962b2_600.jpg"
  ], 
  "description": "Bring a retro vibe into your living room or den with this Zoe convertible sofa bed from DHP. The elegant design and plush cushioning of this gray sofa bed combine to deliver cool style and exceptional comfort, making this piece suitable for both sitting and sleeping without detracting from the decor of your living area.\nUpholstered in a grey linen fabricSolid wood frame constructionStainless steel chrome legs for ultimate stabilityPerfect for sitting, lounging or sleeping6.5 inch Futon MattressSitting Dimensions: 29 inches high x 69 inches wide x 32.5 inches deepSleeping Dimensions: 14.5 inches high x 69 inches wide x 38 inches deepWeight limit: 600 pounds.Materials: Linen, Stainless Steel, WoodStyleContemporary, Modern, Transitional, UrbanMaterialLinen, Steel, WoodTypeSleeper Sofa, SofaAssemblyAssembly RequiredColorGreyFurniture PatternSolid"
}