{
  "name": "DHP_Emily_Grey_Linen_Convertible_Futon", 
  "price": "EUR 270.73", 
  "reviews": [
    "This is 90% exactly what I was looking for - clean lines, good style, and the right size for my studio apartment. Assembly was a breeze - you only have to attach the legs & everything else pops into place.The only disappointing part is that the gray fabric does not continue on to the back of the futon, so ideally you would place this against a wall. The fabric on the back is black and it's not terrible looking, but is probably not meant to be see either. I have it sitting in the middle of my apartment and I think I'll just drape a blanket over it to cover up some of the back, and then do my best to ignore it. The price is great and it feels sturdy, so I'm definitely keeping it. Just wanted to warm fellow studio apartment dwellers (and others with limited furniture configurations) that there's a reason there are no photos of the back of this thing!", 
    "The DHP Emily Grey futon was easy to put together and takes up very little space (great for a tiny apartment), but the fabric is cheap and the cushions are even cheaper. It was very firm when I first bought it a month ago, but now the fabric wrinkles up where you sit and it sinks down. I am not a heavy guy, but I can feel the bars underneath the futon when I sit on it now. I'm afraid it will be deformed and uncomfortable in about a year. If you're looking for a cheap and temporary furniture solution, this should work. Just don't expect too much from it.", 
    "I was a little hesitant to purchase this, specially without reviews. It looks just as pictured and assembly was easy. 5 minutes. Comfort is 7-7/5/10. It really depends on what you like. I found it to be just a tad too firm, yet my fiancé thinks it's just right. I added a couple of pillows that definitely added to the comfort level. Oh, if you are used to arm rests, you will definitely miss having one. You will have to get used to it. But it is definitely a bargain for the quality and the price. Recommended!", 
    "I wanted a decent sized, nice looking futon in my office space for those few times when we needed one more bed. This is comfortable to sit on which is probably a large % of how it will be used - when I need to get away from my desk chair!- and not TOO low(as many futons are). Fabric feels nice and it was super easy to assemble. I will dress it up with a few pillows for a pop of color but overall this was a good value as long as it holds up!", 
    "Great size for my living room. Package it came in was heavy, but everything was in place. Assembly was very easy. It's pretty firm and has a typical car seat fabric feel. I'll probably throw a blanket and dress it up a bit with some pillows. Great couch for the price and starting out.", 
    "Great value for the money but not a piece of furniture that you'll be handing down to your kids. Sturdy enough, looks great, assembles easily, but fabric and stuffing begin to get a bit lumpy pretty quickly. I am completely satisfied, however, because this is exactly what we needed: something that would look great in a very modern apartment we have, work well enough, and last a while. Other options would have had no problems but would have cost 3 or 4 times more. I bought the companion lounge piece at the same time, will say the same thing about it. There is BTW a very hard bar across this thing when it is folded down to sleep on: if you can adjust your position to avoid it you will be fine, otherwise you will be reliving the Seinfeld episode with Elaine in Jerry's parents' guest room. Easy enough to work around, but it is definitely there!", 
    "This is absolutely aweful!! Though it looks sleek and fits nicely it is completely NOT functional!!! We bought it for our home office for guests to sleep on and after having three guests lay on it, all which had to revert to sleeping on our couch instead due to poor comfort, we have to sell it within two months of purchasing it! Overstock won't take it back because it is over the thirty days and it's not used. Horrible purchase!! If I could rate this zero stars I would.", 
    "I was very concerned purchasing something i could feel or test, but I loved the look and decided to give it a try. I purchased this futon because I wanted a sofa look as well as something i can convert to a place to sleep if need be. The size is prefect (twin). The fabric has a smooth feel and cushioning feel. I extremely like that I can make it look elegant in my office space. Great buy for the price.", 
    "For the price, think ikea quality. Excellent look and was easy to assemble. Perfect size for our small den, and additional sleeper piece for guests. By the way, It completely folds into a square and comes in/with a dust bag should you ever need to put it away. There is a zippered compartment on the underside of the futon where the legs are stored, and where we have tucked the allen wrenches, manual and dust bag. The fabric does not remain taut on the back rest in folded position which bugs me, but for the price (along with coupon), I really can't expect more from it.", 
    "I bought this futon just after a cross country move in the hopes that it could give me a couch and sleeping space as I gradually purchased all the furniture I needed, then it would move into the guest bedroom/office. Sleeping wise, even with an egg crate, I was more comfortable on the floor. Sitting is ok, if you like a firm seat, but it doesn't seem like it's going to hold up long term. It's going on craigslist soon, simply because I'd feel bad making guest sleep on it!", 
    "I absolutely love the look of this futon in my apartment, it was easy to set up, has held up well over the past 6 months, and was a great price. Despite all that, I feel I should offer a word of caution for those hunting for a futon for overnight guests: this thing really is uncomfortable to sleep on. It is very firm to the extent that when I'm just sitting on the couch for an hour (watching a TV show for example) my bottom starts to hurt. But if you're not going to use it all for long periods of time, this is a great buy.", 
    "Cheap, sturdy, super confortable, easy to build, looks great in the living room.. what else do you need?", 
    "Purchased this along with the matching convertible futon for a spare guest/lounging room. A little small for sleeping, but if you purchase with the futon and place the side by side, it is a perfect queen size sleeping area and is very comfortable!", 
    "This looks just like it does online. It's very easy to setup and take down and transport. I really like that about it. It's easy to use and a decent size and quality for the price. The only thing that I don't like is that the cushioning is a little lacking and hard near the joints, especially right in the center where the framing is. Other than that, it works great.", 
    "Bought for daughters college apartment! Looks nice! Great for guests!", 
    "Purchased this as temporary seating until our new sofa arrived. More comfortable than expected. Also looks better than expected (for the price). Would recommend it.", 
    "Very uncomfortable and it broke in three month. Wasted my money", 
    "very happy with futon and the color", 
    "The instructions was super clear and the assemble was painless.", 
    "The looks are good enough for a back room which is used by my son and daughter in law when they are here, which is often. My son loves a place to stretch out and relax when they are working here. But every time it is used, I need to smooth out the upholstery.. I am keeping it because it meets a need, but I would notbuy it again.", 
    "A very nice piece that will serve our occasional needs well. It is well made and met all my expectations. And I found it easy to assemble, by myself. The only minor issue was that it was very awkward to carry upstairs and almost fell apart in the process. Also, it is very firm, which I like and think will hold up well over time, but be prepared. Well worth the money.", 
    "I would never pretend this is the most comfortable bed in the world, but it's sturdy and it looks great- and you can't beat the price!", 
    "This isn't a futon I'd want to sleep on every day, but it works well for an occasional guest and looks great in our home office/guest room.", 
    "Love this item for our game room. It is a seat for TV watching and video game playing as well as an extra bed for guests.", 
    "Better than expected. Used it for setting and sleeping, very good quality. You need a good cover over it to eleminate the feeling of the divider ( it's a futon afte all) but nothing else. Recommend it.", 
    "can't beat this price. stylish futon. good for my office and overflow company", 
    "Great price, extremely sturdy, looks great", 
    "Pretty easy to put together, however the back of the futon is not grey so its best to to have against wall. Size is great for a small space", 
    "Small as a bed, but comfortable as a futon.", 
    "Purchased with the lounge and it did the trick for my small living room. Can't beat the price", 
    "This was a very affordable futon but you can really feel the coils/springs in it just sitting on it or laying on it. Also, it seems to sag at the ends a bit. But it's still great value and looks stylish.", 
    "This futon fits perfectly in a small space, all you have to do is go wild with additional colored pillows and throws for a sophisticated look.", 
    "This futon looks amazing, modern, spacious and sophisticated. It is actually confortable to sit and to lay on. I haven't try yet spending the night on it, but I will sure to ask my first guest how was the experience. Delivery was so fast, it deliver in 2 days with regular shipping. Assembly was a piece of cake. It took my husband 15 minutes. I knocked off one star because the protective mesh in the back of the futon is ripped a little bit at one end and where the pouch of the parts go. Overall I am very happy with my purchase.", 
    "Versatile and solid. Excellent for the price.", 
    "It is stylish but is very hard.", 
    "It took me no more than 20 minutes to get this out of the box unfolded and put together. Other than putting the legs on there is nothing else to put together. It was light enough for me to carry into my house alone.", 
    "This futon was just as advertised. Adds a lot of character to my sitting room I'm putting together, that will also be an extra guest area. Love my purchase. Also purchased the chaise lounger to go with it. Great buy!", 
    "I am happy with this purchase and would definitely recommend it to others.", 
    "Good price, though you get what you pay for....", 
    "I use this in my son's bedroom. It works great, not the softest or the most plush, but fulfills it's use and works great for the money. I would buy it all over again.", 
    "I bought this futon for my studio apartment, and it is the perfect size. It comfortable fit three people as a couch, and although it's a firm sort of bed, it's fairly comfortable for guest sleeping arrangements. It also looks modern and classy. Very happy with this futon!", 
    "I like the look and color of this piece. Quality wise, you get what you paid for! No complaints. Easy to assemble.", 
    "We purchased this futon for our daughter and it was very comfortable. My husband slept on the futon when we visited and stated he slept well.", 
    "Love this couch so comfy Modern and Stylish. Creates a sectional look with the lounger. reclines flat to create a sleep area for guest Easy assembly just attach legs comes with tool. Fast shipping. Love the color and texture. Only thing I would change is a better finishing in the back, thicker material", 
    "Serves well as a large ottoman or futon...", 
    "My daughter loves the new futon. Only negative was the dust cover was slightly torn in shipping. Fixed it with some fishing line and have had no problems.", 
    "Looks great, was super easy to put together, a little hard, which is perfect for making sure guest don't over stay their welcome..", 
    "Well priced and super easy assembly. Brings everything you need. 10 min. Putting only the legs.", 
    "Love it goes well with matching couch", 
    "Love this couch. Assembly was very easy and converting to a bed is even easier.", 
    "Very easy to put together. i'm 5ft tall 95lb, and I did it by myself. Stylish. Looks great in my apartment.", 
    "It is a unique color and it is really comfortable. I am back to buy the other piece.", 
    "Bought this for my college boy living w roomies. He says the futon is a little hard for his liiking, but he bought a mattress top and helped.. Also it is a bit too short for him and he's only 5'10\" so there you go. =/", 
    "aesthetically pleasing, easy to put together, not very comfortable (extremely firm) but nice to have the option to sit on a couch in the office.", 
    "looks great in our recently finished small basement. I like that the back butts up to the wall instead of sticking out like some futons. Perfect for company and moderate use.", 
    "Put in my office so I have seating and didn't loose the extra bed", 
    "Solid piece of furniture for the price. First person that slept on it said it was a little firm, but we put a quilt over it to make it more comfortable. Very easy to assemble, just attach the legs.", 
    "Ease of assembly. Firm and well made. Gorgeous.", 
    "This is as I expected: modern, clean lines, suitable size for a small space and easy to assemble. No one has slept on it yet but it is firm and sturdy and arrived on my doorstep in a box with clear instructions. Love it.", 
    "Not comfortable... lumpy and hard.", 
    "The overall comfort of the couch is not that great. You can feel the bars underneath and there is not that much padding. The assembly was easy. The fabric appears to be durable, although I have only had it for a month. Would not use for a main piece of furniture, mine is in the basement red room which is fine.", 
    "Great comfortable piece. Easy to put together with 2 people. Nice and firm. Good for bad back and very chic looking piece.", 
    "Love this piece of furniture! Great price looks contemporary in our office. However VERY hard when you sit on it. No one has slept on this yet so can't say anything regarding that.", 
    "It is decent for the price.", 
    "Easy ordering. Delivery as expected. Assembled in a snap. No surprises. Thank you!", 
    "These products are not very sturdy and not meant for long term use.", 
    "Lola Nice, easy to set up but small, only able to fit 1 person sleeping, and backrest portion is not comfortable to sleep on at all.", 
    "Perfect...very well made.", 
    "Love this futon! It's contemporary-looking, well built, easily converts between bed and sofa position. It sits or sleeps 2 adults, if needed, but a 3rd could use it while seated.It probably won't last a lifetime, but for the price, it's an outstanding buy.", 
    "Very sturdy and comfortable", 
    "Nice, elegant and functional addition to a small beach condo.", 
    "Easy to assemble. Could be a little more comfortable when in bed position", 
    "Love this little futon! Very beautiful consider its a futon! Not the most comfortable but its definitely sturdy.", 
    "Very nice Futon Couch. Great color.", 
    "Firm and fits the decor. Great for the price", 
    "Looks good, but is really hard and very uncomfortable to sleep on. We basically can't use it as a futon, only as a couch.", 
    "It has some how become the main couch. Even with intense use over the past couple of months is is still in great condition. Super easy set up, and pretty comfy. People sleep on it all the time.", 
    "Very firm/hard cushions. Suitable as a chair, but not as a bed. Stitching is irregular and feels like a cheaper product", 
    "Easy to set up great quality!", 
    "Comfortable enough for occasional use as a guest bed. For the price, it looks great and does the job.", 
    "I bought it for an office/ lounging area. Very easy to assemble.", 
    "Nice futon for the price, great for sitting, a little hard for sleeping.", 
    "Very nice looking, comfortable and converts easily to a bed.", 
    "Looks just as pictured, easy set up.", 
    "This is a new piece for us, but so far it is holding up well, and for the price it was an awesome bargain. We have already used it in the reclined position for Thanksgiving company, and with a foam padded added under the sheet it is pretty comfortable. The look is great - very stylish. I think other reviews I read said this, but it really needs to be placed up against a wall b/c the back cover is not attractive - black backing and not super finished. That was my expectation though, so I was not disappointed. Great buy.", 
    "Looks sleek and nice. Leg broke a few weeks after purchase and needed repair. Best for occasional use. Not super comfortable for sleeping so we added a down cover for when it is used by guests.", 
    "This is very comfortable and easy to transition from couch to bed. It is firm but if you like softer, like my son, you can put a pillow top on it to soften it some. Great value!!!!", 
    "Nice futon for secondary room... cute coloring and changing to bed is a snap, kids love it!", 
    "This futon was a really reasonable price and fits our needs perfectly. It ships folded into a very small box - maneuvering it up stairs and around corners wasn't a problem. Assembling it was easy with 2 people - it might be slightly more difficult with only 1 person, though definitely still do-able.. All the hardware (including the legs) comes tucked into a zippered pouch on the underside of the seat. The two halves of the back can be set at different levels (sitting up, reclining, or lying flat) which is really convenient. It is a little hard to sit or lay on; if I end up hosting any overnight guests, I might get a foam mattress topper to make it more comfortable for them. Also, some aspects of the construction feel a little flimsy; it's hard to say how it will hold up to a lot of use.Overall, I feel like this futon is a good quality for the price, and it fits our tiny apartment perfectly.", 
    "Brought that piece not so long ago and my children enjoy it. It looks nice in a room. Made of very good material for its price. I recommend it.", 
    "Very good quality for the price", 
    "Found it easy to set up by myself. It looks great, but the seat is quite hard. It is in a rarely used area, so it should serve its purpose well.", 
    "Very comfortable not just for seat & relax, but also for sleep", 
    "I bought this as a temporary fix, while I look for a couch. It looks good, and has held up with the cat and dog. It could use a little more cushion, especially after sitting in the same spot for a while.", 
    "My son loves this in his room sturdy and looks nice!!", 
    "This is the perfect piece of furniture for the play room", 
    "Great for guests and everyday living.", 
    "Very nice futon. The description does not show a weight limit, howeve looking at the instructions, it says 3 average adults can sit. There are 2 middle legs , 6 legs total, which keeps this a very sturdy piece. It looks so nice, It is going in my living room.", 
    "Simple, yet functional. It was super easy to assemble. I recommend if you're looking to have guests sleep over :)", 
    "I ordered two of these futons and placed them side by side. It was an affordable solution to a long, armless sofa, which doubles as a sleeping place in a pinch. The reviews are accurate in saying that the backing is not covered in the gray cloth, making it near impossible to position them somewhere that is not against a wall. One of the futons has the issue with the cloth on the back wrinkling, the other has remained taught. The material is very attractive, and the futon itself is very firm. Durable enough for adults to sit on and enjoy, but not meant for children to stand on and perform their \"gymnastics\" ---seems I always have to remind them of that!", 
    "This is an amazing futon for the price! setup was super easy, and the fabric, etc. is exactly as pictured.", 
    "Attractive and functional", 
    "Very cute and great for a dorm.", 
    "Looks really nice. Super easy to assemble. But the cushion is thin and hard. Wish it was thicker!", 
    "I got this for the guest room/office and it looks great. When layed flat it's uncomfortable to sleep on, feels like a bar is in the middle but good for kids to sleep on. Very easy to lay down and nice to sit on just don't recommend a comfortable sleep.", 
    "Love, love, love this futon! The price was great and it is perfect for our old \" playroom\" for the kids to a great little family room.", 
    "I ordered this for my family room. The futon is sturdy and comfortable. It came well packaged and was easy to assemble. It looks great with the other furniture in the room.", 
    "Great futon, comfortable, easy to assemble. Would recommend buying", 
    "This product exceeded my expectations. Very comfortable for sitting and sleeping", 
    "I was very excited to receive this futon. I opened it up and noticed that the black liner was ripped and torn which was a huge turn off, shipping box was in perfect shape too so it had to have been shipped like that..", 
    "We bought this for a sleeping option for when folks come over. And to add out our living room. I've had it about 1 year. 1. This is comfortable for a toddler who would not be bothered by the metal bar that digs into your back. 2. Our kids use it to play video games. All the legs have broken off. The \"springs\" or whatever inside are shot. 3. The size is smaller than a twin bed. 4. Who could comfortably on it? Kids who could care less. Worst ever. I wish we hadn't bought it. The only good thing is the fabric which is pretty.", 
    "Good couch. It's more comfortable than what I thought was going to be. Putting it together probably took at least 10 mins.", 
    "I bought this for my daughter. It is a very nice sofa. it was very easy to assemble and looks wonderful In my daughters living room", 
    "I can't believe that I paid less than $$$ for this wonderful piece including shipping!!!", 
    "ok for sitting, had to purchase a foam pad to use for sleeping.", 
    "It's not the most comfortable seating in the world, but we love the look and it always gets tons of compliments from our friends!", 
    "This futon has proved to be very comfortable and I am enjoying it very much.", 
    "Great futon. Little hard to sleep on, not my choice for sleeping. I bought it for the living room. Looks REALLY good, very easy to put together. Great color. Comfortable to seat on. Would buy it again. Very fast delivery.", 
    "Sleek modern style. Material looks rich. Firm and easy to adjust for bed. Easy assembling.", 
    "We love our futon sofa. It is a perfect addition to our small apartment living room. It is stylish and goes with our decor. Comfortable once broken in.", 
    "I needed a couch that converted so that I could have guests sleep on it and that didn't look like your college futon. It does look really nice but the material is thin and my dog has already torn open the seam. But I did anticipate her doing that, so I'm not too bummed. Overall, a nice addition to my livingroom and makes it look more chic without going over budget.", 
    "great buy for the price will shop at overstock again", 
    "This couch was easy to assemble and a great couch for an apartment. It's perfect for folding all the way down, and curl up and watch Netflix.", 
    "Beudiful , excellence the color", 
    "This is a modern looking piece and is great for overnight guests. So easy to put together. Love the quality for the price.", 
    "good quality same as picture I love it", 
    "only complaint-bit hard on the middle fold for sleeping, a towel/blanket under a fitted sheet does the trick to soften", 
    "This futon couch is incredibly comfortable and well-built. Fast shipping and super easy to put together. Looks fantastic in my living room. Love it!", 
    "Easy to put together and good quality", 
    "Stylish and functional. Very happy with product especially for the price.", 
    "I put it together myself :) and it looks great. It's not very comfortable, but I purchased a feather bed for when guests want to sleep on it.", 
    "Easy to put together, looks great, and is comfy to sit on! Couldn't have asked for more.", 
    "Bought this as a guest bed for when my mom comes to stay. I have it in my home office and it looks amazing with a few pillows and a throw blanket when not being used as a bed. My husband already fell asleep on it just relaxing on the couch. It's definitely firm but that's what we prefer so it works for us. The price plus a coupon I used made it totally worth it. Would definitely buy again.", 
    "We have this in the nursery and it will not be heavily used, so I can't speak on how well it holds up as a main sofa, but it looks great and a perfect more contemporary alternative to a traditional futon with the frame and separate mattress. It feels comfortable enough for guests to sleep on for a couple nights. Can't beat the price!", 
    "So far so good. Very easy to put together.Seems to be a very good quality. Nice and firm. The grandkids love it for a bed.", 
    "Easy to assemble, comfortable, great quality and price.", 
    "Happy with the money spent!!", 
    "This is comfortable and good for anyone with a bad back who has been sitting on a soggy sofa. This sofa is good for impromptu overnight guest, It compliments my TV room (aka man cave), looks clean and is easy to clean underneath.", 
    "This is a very good value in a futon. It serves our purposes of a bed and seating area that is used, daily. It may not last as long as a $$$ sofa, but it hopefully will last a few years. The fabric in the gray version seems well made.", 
    "Title says it all. I needed this for dual purpose - in a workout room/ slash spare room for an extra guest room. Guests with kids can watch tv or stay the night. It is sleek, modern, gorgeous and comfortable! I love it.", 
    "It looks great. It was easy to put together. That black fabric takes away from it a little. But other than that it was a great purchase. I have gotten a lot of compliment s.", 
    "It looks a lot bigger on here. I can sleep one comfortable and 2 very tight. Looks good and feels sturdy and is easy to adjust.", 
    "Great purchase for the price and it does its job!", 
    "Looks and feels like a high quality piece of furniture. It's perfect! Easily turns into a bed and the kids the love it!", 
    "Looks great. Sturdy. Great futon for the price", 
    "This barely fits two people. Only one comfortably and has a huge metal bar in the middle where you're supposed to sleep.", 
    "looks great, feels great, perfect for what I needed. had my handyman put it together and he did in about 30 mins so it can't be that hard.", 
    "Looks pretty good with the nice charcoal color. Not hard to assemble, minimal really. The length is along the seat, so that it takes up a long space on my floor even when set up as a couch , but I don't mind. I just wanted a place for occasional guests to sleep. I like it.", 
    "For the cost of the couch, it is actually surprisingly comfortable. I will be getting pillows to improve the comfort level, but I must admit it is not bad at all!", 
    "I am a home stager and I needed something light and compact for a 4th-floor walk up DC Condo. I bought two of them and they were perfect. I was amazed at how well put-together they are and the ease of assembly.", 
    "Fast delivery, easy to put together and very comfortable! Color is exactly as shown on the picture!", 
    "I bought this for my office and it works perfectly. It's cheap but doesn't look cheap. Sits low, but not too low- great for small spaces. It's firm, but I like that. I wouldn't recommend it to use as a daily couch, but perfect for guest room or office. Easy to assemble one person, folds to bed easily. I haven't had a guest sleep on it yet, but will probably buy a memory foam topper for when they do.", 
    "This is o much better then I could have even imagined!!!", 
    "Looks exactly as expected in my new Mid -Century Modern room. Just 1 tip & \"Overstock.com\" recommends this, I just didn't listen. Make sure u have ample space 2 fold product out AND have 2 people to put it 2gether...unless ur a young person in their 20's or 30's. It's not that it's heavy, it's that 1 side will come down while putting legs on the other. My ankle got caught, took almost 10 min 2 get out & had a bruise a good 3 inches up from my ankle. So be careful, but enjoy ur couch/futon!", 
    "Love it! Sturdy, firm, worked perfect with our room", 
    "It's pretty. Not used that frequently in my house.", 
    "bought this piece for my son's new college bedroom. We were thrilled with the price and free shipping. Item needs assembly but looks great, feels great, he was super happy!", 
    "Cheap, easy to assemble, box is heavy.", 
    "Color & Size as expected. Great in my apartment living room!", 
    "great sofa! very happy with my purchase!", 
    "Nice Color and Features for the price. Quality is about right for the price, not Super Big.", 
    "I purchased this for my daughter who lives in a small apartment. Shipped quickly... And it's PERFECT! Great quality and STYLE. Now I have a place to sleep when I visit her. Absolutely can't go wrong with this purchase!", 
    "I had to cal and return the initial couch due to manufacturing defect where the cushions meet in the center. I was already back home when replacement arrived at my daughters and unfortunately it mimicked the first couch.. My daughter needed a place to sit on, so she didn't want to go through the hassle of disassembling...reassembling...returning another one and waiting on the new one. Sad to say but this purchase did not meet reasonable expectations.", 
    "This futon is very easy to assemble and very sturdy. A great buy!", 
    "got this for my office, it went together fine, just isn't very comfortable and doesn't seem very durable. fine for what I purchased it for", 
    "Perfect for my den. Put it together in 15mins. Looks good and sturdy. Great value", 
    "I'm really pleased with this futon. We needed a quick, cheap bedding solution for my step-son. Eventually I want to get him a real bed and this will go in my office. It looks very nice and will be a nice addition to my office, but for now as a bed, my step-son said he was in heaven sleeping on it! He may have over-dramatized a tad, but it has a nice firm feel (which I personally prefer). My step-son is 11 and weighs about 60 lbs so keep that in mindIt was very easy to put together. Overall, I'm very satisfied with our purchase!", 
    "I love this Futon! It is so easy to set up, and looks so classy and elegant. It is also very comfy! :)", 
    "All the items that I have purchased have been great. I advise people to check out this site.", 
    "We needed something to sit on for occasional use, and you can't beat this price. It looks modern, color is true to the photo. It's hard, as one would expect from a futon, and not particularly comfortable for everyday use, but if you need a good-looking surface to sit on, this is perfect!", 
    "I purchased this for my sons room, this futon looks very nice & seems comfortable to sit & rest on for when he has company come over. Very simple to set up. Comes in one box all you have to do is attach the legs", 
    "I bought this for my niece who moved into an apartment. It is good as a bed and as a sofa. She said that this isvery good as bed and sofa. She is enjoying functionality ofthis futon.", 
    "Really like this darker grey linen color. Easy set up. Good function in small office space as seating and overnight pull out for guests.", 
    "Very happy with my purchase. Works great in my loft, modern and chic!", 
    "There are 6 legs on the bottom side that need to be attached with the included all wrench. Took me around 20 minutes. I flipped it over myself to standing but that should probably require 2 people or one very stubborn person like myself. It is very firm. It looks clean and polished however.", 
    "Exactly what you'd expect from the pictures.", 
    "Very impress with the quality for the $. Very easy to put on the legs - done. Nice fabric too.", 
    "It was easy to set the futon up even by myself. I use it as a wide, comfortable couch, as well as a guest bed. I can't believe how cheap it is for its quality and looks. I am fully satisfied with the purchase. Highly recommended.", 
    "\"Looks great and is the extra bed I neededGreat value\"", 
    "This was a good choice for my space. It looks terrific and although I haven't had anyone sleep on it, I think it will be a good sleeper and hold up over time. It's slim but sturdy and nice looking. Easy to put together and I recommend this futon.", 
    "looks good, size OK. maybe a little small for two people to sleep on.", 
    "Bought this futon for my husband's study for lounging and for an extra guest bed. It looks great and is easy to convert from a seat to a bed. The mattress is a little hard so if someone were to sleep on it, a mattress pad is needed.", 
    "It's comfortable as a futon, but you can feel the springs and woof underneath you.", 
    "This futon looks great. I have it in my home office, and I have gotten so many compliments on it. The drawback is that my son says it is very uncomfortable to sleep on. The support bar underneath makes it feel very stiff and hard underneath you. It's better for sitting than sleeping. I love it. Maybe I'll purchase a memory foam topper to cushion it when a guest may have to sleep on it.", 
    "Perfect for the money. Exactly as described. Easy to put together and use. Not very comfy to sleep on, but you can use it as a base for another mattress (air mattress, mattress pad, etc) if you're using for a guest bed.", 
    "This futon looks great and is incredibly easy to put together. It is great to sit on but needed to buy an additional pad as it was too firm to sleep well.", 
    "This is super easy to put together and looks great! It isn't high quality and it is very lightweight. It is easy to move and easy to adjust into the bed position. For the price, this was a great purchase.", 
    "A sofa bed arrived on time and was very easy to assemble and move around. It fits our space well. It's not a large sofa bed for guests taller than 6 feet. But since my daughters are petite and so are their friends, this fits our needs fine.", 
    "Incredible price. Easy to assemble. Doesn't look comfy, and, well, it's not that comfy...but I bought it for looks and I use every day and love it. Happy with it.", 
    "I did not expect much for the price and was pleasantly surprised. It looks sharp, modern and high quality. Color and style exactly match the picture. Fairly easy to assemble.", 
    "Considering the price and free shipping, this is a bargain. It's really quite nice, sturdy, attractive and not uncomfortable. It does weight A LOT so plan on having help just getting it out of the box.", 
    "very cute and modern looking", 
    "a great piece for a low traffic room", 
    "Decent as a couch for a small space. The cushion firmness on the seating and back are significantly different such that when the bed is flat, you will not feel comfortable lying across both sides. The central metal support is palpable while flat and so makes it less than ideal as an everyday couch. Likely will use a foam topper for guests to avoid discomfort. Not recommended but functional for what we needed immediately.", 
    "stylish, great for converting to a sleeper for guests. Great quality for the price. easy to assemble. better and more stylish than ****, same price range. Shipped quickly. it's a little firm/hard, but again, great for the price.", 
    "Nice casual couch we put in our daughters room. Happy with the purchase", 
    "I don't think you can find a better futon for $*** anywhere. Very stylish, comfortable for perching and lounging. I ordered the sofa first to check the quality before ordering the matching chaise, and I will DEFINITELY be ordering that soon. I've been very happy with this purchase.", 
    "My electrician said \"shades of 1960\" when he first saw this futon/couch in the living room of my rental property. But it's a cute and very useful couch, and comfortable too. I was looking for something that would make into additional sleeping, but also go with other furniture in the room, and this does nicely. It was very easy to assemble and seems sturdy, plus it's exceptionally easy to lower the back sections.", 
    "The futon was exactly as the photo. It makes for a nice office furniture, it's sturdy and can be used as a bed. It arrived really fast and assembly was very easy. If you have an extra room or a small apartment this would be perfect or ideal.", 
    "Very Comfortable and easy to assemble", 
    "The futon took me less then 15 minutes to set up. Which was great. The look is just as it appears on the picture and has a great modern fell and look. It is firm. So if you don't like firm mattresses you might not like this futon. Downside to the futon is the chrome legs. Wish they came with either a matte finish or a different color option. That's all. I use the futon in a studio apartment and it works great with the size. My partner and I really love it and even after our resent move to a one bedroom apartment it is a great size and look for a full living room area.", 
    "Bought this with the convertible chaise and use them together as a sectional seating area. For guests, we fold them both flat and push them together to make one big bed. Perfect!", 
    "Not your average futon from chain stores, this futon purchased with the matching chaise is a great addition to any room.", 
    "modern look, good construction, not comfortable.", 
    "Looks really good and comfy for a futon - got an 4inch memory foam topper for extra cushion for any guests :)", 
    "perfect size, portable. Insert in bottom to store the legs for you to transport !", 
    "West elm has a very similar couch for triple the price!! I have it in my secondary living room and it is super cute and honestly a lot more comfortable than I thought. Super easy to put together.", 
    "It's a fairly attractive futon but not particularly comfortable for sittong, The fabric is pretty rough and you can feel the metal bars through the cushions depending on where you sit.", 
    "Super easy to assemble. Tools are provided and I had it built in about 30 minutes. It also folds back easily. It's not super comfortable. Very thin padding. For it's price though, I am pleased.", 
    "It looks really nice and was incredibly easy to put together. I got it because I have a small car and a small apartment it will be easy to take down if I ever move and put back together. My problem is as a bed it is very uncomfortable but as a couch it is ok. If you are looking for a flexible cheap futon get this! If you are going to use this mainly to sleep on I would recommend getting something else.", 
    "Bought the lounge chair to go with it and they are beautiful and well made.", 
    "Just attach the legs, and done. Comfortable, stylish, and durable. We use it in our little living area in our guest room, and it works perfectly there. It's a little higher than most futons We've had so that's good too. I don't see anything that could be wrong with this futon. Recommend buy", 
    "This sofa is great for a small area, looks just as it does in the pic. Very pleased with this item!", 
    "Not the best quality/comfort but great for how cheap it is. Leaned against wall", 
    "Just purchased this recently and am overall happy. It was inexpensive so, you can't be too disappointed. Love the grey linen but not the \"cheap\" black backing. It is a bit lacking in the cushioning department, so it WILL require a couple of pillows for comfort. Somehow it just seems to NEED the matching DHP Chaise to give it that finished look. Glad I purchased one. Next time though, I'll buy one of the beautiful \"real\" sofas that I see on this site. This set will be passed to a needy neighbor.", 
    "We had never owned a futon before so really didn't know what to expect. The quality is good and truly looks like the picture. It is a little too firm for me but I would rather have that then something too soft at the beginning. Very easy to assemble.", 
    "It is a good item, smaller than I thought it would be..sleeps well though..", 
    "We were looking for a firm and inexpensive modern piece of furniture to go in our family room. Lots of kids in there. Our other couch is a ******* **** couch that is too mushy and kids love jumping on it. This Emily Grey couch is nice and firm yet comfortable to sit on. We were looking for a couch that had a solid back (not one with cushions) so that it kept its shape. Kids don't jump on it either. We like the clean and simple lines. Added two white pillows to it. Looks great.", 
    "Nice couch. Easy enough to put together. Not too heavy to move around. Folds down to a nice sized bed.", 
    "this was a good buy. the middle leg looks a little slanted when the futon is in couch mode, but it's already been slept on and is good. maybe it's just there for extra support when the it's in flat mode. but seems sturdy, nice fabric.", 
    "It's a good product for the price; looks elegant in my photo studio.", 
    "This futon is attractive and easy to put together, and fairly comfortable (though pretty firm), and looks more expensive than it is. It would also be easy to move as it folds up neatly, and the legs store inside. I do not see it being highly durable if used every day; for me it's temporary for a few months until I can get a better sofa, at which point it'll go in the guest room. This item arrived in a box that was fairly beaten-up, but the product itself was OK -- and shipping from the warehouse was somewhat of a hassle (long story that involves refunds of expedited shipping fees).", 
    "Looks great and fits perfectly in my daughters second bedroom.", 
    "I wanted seating in our upstairs living area that is basically our kids' playroom. It's hard to justify spending $1000+ on a sofa when you know it might end up losing the battle to two kids jumping and playing on it. At this price though, I was sold. We purchased with the chaise futon so that the whole piece had more of a modern sofa look. The fabric is the exact grey we expected and of great quality. The futon is very firm. But that works for what we need. I would recommend this product.", 
    "I ordered this for my son and he loves it very comfortable and looks nice in the room", 
    "Comes in small box that was easy to get up to the second floor apartment. Simple instructions with minimal assembly- even comes with correctly sized allen wrenches to use. Comfortable to sit on- have yet to sleep on it.", 
    "the futon is very modern and easy to put together", 
    "Looks great. Does not feel as substantial as it had storage built into the seats, so there are some parts of the seat that seem to give way. For kids and small people its fine. I wouldn't recommend it for everyday use.", 
    "Love the look and so well made for the price. Assembly was super easy as well!! Highly recommend!", 
    "This futon is beautiful! It is also a perfect fit for my small work/tea room! Love it!", 
    "After about a month of sleeping on it (im sure thats not the intended purpose, probably more for guests) it breaks down and laying in the middle causes the parts to stab in your body but otherwise its pretty comfortable", 
    "Great color, looks great in the room. Wouldn't recommend it for a room with heavy usage.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/DHP-Emily-Grey-Linen-Convertible-Futon/9752389/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9752389/DHP-Emily-Grey-Linen-Convertible-Futon-ba297228-5157-489c-887f-dc56a4e8056c_600.jpg"
  ], 
  "description": "The split back of this futon sofa bed gives the piece great\nversatility, allowing you to sit up straight, recline or lie flat.\nThe modern appeal of the grey linen futon with chrome legs and\nsimple design adds sophistication to your home, and the cushions\nare designed to stay full and firm through regular use to ensure\nyour comfort. Add a modern look to your home with the shiny chrome\nlegs and clean lines of this futon. Designed to easily convert from\nsitting upright to lounging back to laying flat, this futon is\nversatile enough for everything from family movie nights to lazy\nafternoon naps. Easily accommodate overnight guests by placing this\nfuton in your living room or home office.Set includes: One (1) futonFuton is upholstered in grey linenChrome legsQuickly converts from futon to sleeperClick clack technology makes it easy to convert into a\n  sitting, lounging and sleeping position within secondsWeight limit is 600 lbs.Materials: Wood, foam, metal, fabricFinish: Chromed metalUpholstery color: Grey linenUpholstery fill: FoamWeight: 81 lbs.              StyleContemporary, ModernMaterialFoam, Linen, Metal, WoodTypeFuton Set, Sleeper Sofa, SofaThickness7 InchAssemblyAssembly RequiredColorGrey"
}