{
  "name": "DHP_Emily_Grey_Linen_Chaise_Lounger", 
  "price": "EUR 232.82", 
  "reviews": [
    "Great value for the money but not a piece of furniture that you'll be handing down to your kids. Sturdy enough, looks great, assembles easily, but fabric and stuffing begin to get a bit lumpy pretty quickly. I am completely satisfied, however, because this is exactly what we needed: something that would look great in a very modern apartment we have, work well enough, and last a while. Other options would have had no problems but would have cost 3 or 4 times more. I bought the companion futon piece at the same time, will say the same thing about it.", 
    "Purchased this along with the matching convertible futon for a spare guest/lounging room. A little small for sleeping, but if you purchase with the futon and place the side by side, it is a perfect queen size sleeping area and is very comfortable!", 
    "I use this chair to work on; I can write on it for long hours without my back hurting. It would also be good for reading, and I'd feel comfortable putting a guest on it for the night (it they were on the smaller side). Assembly was very, very easy, taking less than 10 minutes and requiring no extra tools. However, it is pretty cheaply made. When I took the chair out of the box, I accidentally pulled at the material just the slightest bit - applying no real pressure. It tore at the seams. Luckily, the foam underneath is a grey that matches the chair, so the tear isn't really noticeable. But it's certainly not built to last.As pictured, the head of the chair adjusts to several different heights. It's easy to adjust, but the springs make a very loud clicking noise whenever you do so. I'm overall satisfied considering the price I paid.", 
    "I originally bought the DHP Emily Grey Linen Convertible Futon and liked it so well that I bought the chaise lounger to go with it. The furniture is easy to put together and it looks beautiful in the room. Everyone who sees it loves it. It is really comfortable as well, and the tufted look gives elegance to an above-average futon. We have turned our sons' bedroom into a spare TV room and both pieces fit nicely in there and are perfect for when we have overnight guests. These are not a typical futon.", 
    "We are laying this flat and putting pillows behind it instead of building in an expensive window seat in one of my kids bedrooms in our new-construction house. It is adorable for the price and will be perfect for his buddies to sleep on overnight. Inexpensive, cute, and practical! I was so happy when this arrived because it exceeds the price point.", 
    "We actually ordered this chaise for our 150 lb great dane. It was much less expensive then a dog bed that would fit him. Even with his claws, and weight.. the chaise has held up fantastically. We have had it several months now, and although he uses it everyday..it shows no wear. I literally pick up the vacuum and vacuum it off when he gets hair on it. My only complaint is that the back does't always want to stay up when i set it in the middle position. Takes a few times to get it. I definitely recommend it.", 
    "This piece arrived well packages and was super easy to assemble my myself. It's a stunning item. The price point is good...it's functional. It feels disappointingly flimsy to sit on (the hollow area where the legs come packed is noticeable).", 
    "This is a nice chaise. Like that back is adjustable. It is a little low to the floor. Had to reorder parts that were missing and instead of them placing parts in the zipper pocket in the bottom of chaise, they simply tore a new hole and placed only the legs. Had to tape the hole so material won't not be seen. Just carelessness or laziness on there part since after all there is a zipper pocket for them to place the parts.", 
    "I ordered this for my family room. The lounger is sturdy and comfortable. It came well packaged and was easy to assemble. It looks great with the other furniture in the room.", 
    "I loved the look. It works well as a chaise but I found it too uncomfortable as a guest bed and returned it.", 
    "It's comfortable as a futon, but you can feel the springs and woof underneath you.", 
    "I wanted seating in our upstairs living area that is basically our kids' playroom. It's hard to justify spending $1000+ on a sofa when you know it might end up losing the battle to two kids jumping and playing on it. At this price though, I was sold. We purchased with the chaise futon sofa so that the whole piece had more of a modern sofa look. I was worried that the pieces would not match up in height, as I had come across some reviews that indicated the pieces they bought did not match in height. But I did not have this issue at all. The fabric is the exact grey we expected and of great quality. The futon is very firm. But that works for what we need. I would recommend this product.", 
    "Very good relaxing sofa for bedrooms.", 
    "looks great for the price and space we had. Compact, useful design and durable upholstery. firm seat, but with pillows, it's comfortable enough for the playroom", 
    "I love this Chaise. I have the matching futon and they are so cute together or apart. It's not comfortable to sit on for hours upon hours, but it's definitely functional. It's in my daughter's room under her loft bed and makes a totally cute reading nook area. Looks great, she loves it!", 
    "The chaise was extremely easy to put together. In fact, my 7-year-old son did it all by himself with my supervision. Quick shipping as well. The cushions are very firm and the fabric looks to be in perfect condition. I am eager to place it in our new home.", 
    "Great looking piece with the matching futon. It works great in small areas. The price is great and with a few decorative pillows it does the trick", 
    "The color is great. Not drab. A little stiff, but very comfy :)", 
    "I ordered two identical chairs, but upon unpacking, I noticed they are slightly different. I thought that was odd, but overall, I couldn't be happier with the purchase. The legs were neatly tucked underneathe the chair, in a pocket. Easy to assemble, entry level, one person. The grey color goes perfectly with my living room design. The chairs were longer and larger than I expected, but it was a good surprise. Can also fold them down in a \"bed\" position like described in product description. No \"bad\" surprises. Highly reccommend.", 
    "I had to bring the lounger in from the front door where the delivery person left it. The box was long and heavy. After grabbing and pushing it indoors, I took it out by sliding it from the side. This was the most easiest thing to put together(and I was glad because I really don't like putting heavy items together). All I had to do was screw on the legs, which were attached to the bottom in a pocket. I love the length and color , and my sister in law loves it too(she might order one soon). This will be good for me to sit and read my books, magazines, lay my clothes across,etc. I need to get a pillow to make it a little more comfortable. I haven't tried sleeping on it, but will when company comes over.", 
    "I bought this for my 16 year old daughter's room and she absolutely loves it! She wanted a comfy chair in her room to sit in, but I think this even tops that. I have found her napping on this more than a couple of times. It isn't super high quality, but good enough for a teenager's space. Love it!", 
    "Easy to assemble and very comfortable - Perfect to relax and read a good book or watch a football game!", 
    "Added compliment to my futon. You can't get one without the other.", 
    "We purchased this piece for our daughter to go with the matching futon. She is expecting and was comfortable.", 
    "Love this lounger so comfy Modern and Stylish. Creates a sectional look with the couch and reclines flat to crest a large sleep area", 
    "Absolutely love this chaise!! It is comfortable and sturdy, good quality and fabric. Very easy to assemble. Great accent piece to a living room space!! Well worth the cost", 
    "Very happy with my perchase fits perfectly in my cosy apartment", 
    "Comfortable. Adjustable back makes this even better. No complaints.", 
    "Very easy to put together. i'm 5ft tall 95lb, and I did it by myself. Stylish. Looks great in my apartment.", 
    "Perfect for our office. Can't beat the price. Put together fairly easily.", 
    "Great compliment to the futon.", 
    "Bought this with the matching couch/futon. It is AMAZING.", 
    "These products are not very sturdy and not meant for long term use.", 
    "Nice, elegant and functional addition to a small beach condo", 
    "I had this put together and in it's place within a half an hour of receiving it. Very comfortable and sleek looking. Perfect for that extra guest.", 
    "Very nice and comfortable, easy to put together, i use it in living or bedroom, I love it.", 
    "Still using it as a bed while I save for a nice bed. Not a bad item but I feel the cushion is starting to sink but I guess it's from my 250 lb body on it everyday so a good product.", 
    "Easy to put together. It took 5 minutes, with extra time spent on tightening the two legs' bolts. It is level. The firm cushion is comfortable when thinking of the low price point for the chaise. Sits two people comfortably; one person can lay reclined or flat. Would sleep an older child or teenager for an extra bed. The fabric is the best part of the chaise and is easy to clean.", 
    "Got this for my daughter's room to use as a lounger and occasionally for sleepovers. Good quality, especially for price. Cushions are very firm. Happy with purchase.", 
    "I just love this!! perfect for reading or whenever I have friends over.", 
    "Love this lounger. Very firm feel to it, which is a definite plus compared to a metal frame futon mattress. Would recommend.", 
    "Great chaise , looks great , firm upholstery, nice add to our family room", 
    "I love this item and recommend it strongly.", 
    "Not the most comfortable chair, but we love the look and it always gets compliments from our guests!", 
    "This is definitely a favorite in my household. It is a little hard at first but has broken in a week later. Great for any small apartment either in the living room or bedroom.", 
    "Beautiful,excellent the color", 
    "I bought this for my guest room and I love it. It doesn't take up too much space and it's quite nice looking and comfortable.", 
    "Nice little chaise for the price! Good quality!! Love it!", 
    "this piece is nice if you just need something to fill up a room. Not too soft to sit on but it is ok to look at.", 
    "So in love with this! Easy assembly (just screw in the legs). Looks so nice!", 
    "For the price, it's very nice. A bit hard and the back of the chaise squeaks and rattles when it is moved. Perfect as a backup bed, etc. Great color.", 
    "I have not had an opportunity to sit for an extended time on this piece of furniture since my grandson seems to have taken up permanent residence on it. He loves it and in all honesty I love my chair. This lounge with the sofa compliment my TV room (aka man cave). It loves clean and is easy to clean underneath.", 
    "Nice product with various uses.", 
    "Color and size as expected. Great for extra seating!", 
    "Bought this for my daughter's first apartment...she moved to L.A. and Overstock was awesome with delivery and pricing all the way around. I sleep on this when I come into town and stay with her and is not my bed but it works out just fine.", 
    "Excellent piece. The cost is very minimal. Item came in VERY well packaged and almost fully assembled. I just needed to screw in legs. The mattress is a bit too firm, but for the couch or a lounger it works just fine. Had to sleep on it for 3 days, it was OK, not bad, but not great either. Overall very nice item, high quality material. Very happy with the purchase and the delivery time frame.", 
    "LOVE THIS CHAISE LOUNGER. ADDED SOME COMFY THROW PILLOWS AND SMALL TABLEMY LADIES DEN IS PERFECT!!", 
    "I was looking for a piece of furniture for my spare bedroom/workout room that would not take up much space but would provide a place for my young grandchildren to sleep when they visit. I had considered a futon, a daybed and a chair bed. After looking around for about a month, I saw this on Overstock and thought this chaise would be the perfect solution. It was! The chaise is a very good looking, sturdy piece of furniture. it was extremely easy to assemble (the 2 back legs simply screw in; the front legs require the turning of 4 screws) and the conversion to a bed is simple.As a chaise it is very comfortable to watch TV or read in. I haven't had the grandchildren over yet to test the comfort of the bed configuration but I suspect it will be fine for small children--maybe not so much for a larger adult. .For my needs though, it is perfect", 
    "Ordered two of these for a spare room for the grandkids visits. They are the perfect solution to a super small room and space! Pull them away from wall, lay them down for sleeping at night. Grandkids set them back up to watch TV and hang out! This worked in a room that even a bunk bed was too big!", 
    "Arrived quickly. Quite light. Very easy to put together. Exactly like the photos. Very sturdy. Firm just the way I like it. Great price. PERFECTION!", 
    "Love, love, love the look. My money was well spent on this....very reasonably priced for a very sophisticated look.", 
    "This is the exact piece I was looking for and wanted. Looks great, fabric feels great, and very comfortable.", 
    "I have hardwood floors and it matches the room like the image", 
    "Lovely sleek, Modern piece that's perfect for my master bedroom and doubles as a guest bed.", 
    "stylish, great for converting to a sleeper for guests. Great quality for the price. easy to assemble. better and more stylish than ****, same price range. Shipped quickly. it's a little firm/hard, but again, great for the price.", 
    "And using it as a daybed is not bad at all!", 
    "This futon chaise is a brilliant way to add seat and an extra place to sleep. We have it next to the Emily Convertible Futon to make a sectional. For guests, we gold them both flat and push them together to make one big bed. Perfect!", 
    "Chaise looks great along side the futon which gives you more room to sit or lounge, you can't beat the price and the shade of gray is perfect!", 
    "Looks as does in the picture. Very firm. Stylish and modern.", 
    "Perfect lounger. Easy to assemble. Convenient.", 
    "Comfortable and easy to put together!", 
    "Beautiful and well made. Bought the futon to go with it and it looks fantastic.", 
    "I guess for the money this product is okay, but the workmanship leaves a lot to be desired. If it wasn't so hard to return furniture, I would return it. It is very lumpy on the sides and the top part that goes up and down is crooked - really crooked so I have to put a throw on it to hide that.", 
    "Love it! Stylish. Creates a comfy environment to my office space.", 
    "i loved the chaise ! it is very easy to put together", 
    "Very satisfied with the product & shipping was very fast!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/DHP-Emily-Grey-Linen-Chaise-Lounger/9747008/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9747008/DHP-Emily-Grey-Linen-Chaise-Lounger-c4fc17f2-8615-4fbc-a482-824dc79783a0_600.jpg"
  ], 
  "description": "Stretch out in mid-century style with this chaise lounger.\nFeaturing grey linen upholstery and button-tufted accents, this\nchaise offers understated beauty for your space. The high-polish\nchrome legs offer a striking color contrast for this piece. This\ncozy yet modern lounger makes a handsome accent piece for your\ncontemporary living room.Upholstered grey linen offers a striking color contrast for\n  the polished chrome legsConverts from a chaise to a sleeper in seconds thanks to\n  click clack technologyWipes clean with a damp cloth for added convenienceWeight limit of 350 poundsCrafted from wood, foam, metal and plasticFoam fill provides cozy comfortWeighs 54 poundsOverall dimensions measure 32.5\" H x 61.5 inches wide x 30\n  inches deepSeat dimensions measure 15.4\" H x 50.49 inches wide x 29.9\n  inches deepSleeping dimensions measure 15.4\" H x 70.1 inches wide x 29.9\n  inches deepStyleContemporaryMaterialFoam, Linen, Metal, WoodChair TypeChaise LoungesAssemblyAssembly RequiredChair Back HeightStandardColorGreyFurniture PatternSolid"
}