{
  "name": "DHP_Dillan_Convertible_Futon", 
  "price": "EUR 272.89", 
  "reviews": [
    "This futon looks great in my small studio. It's firm an rather comfortable to sleep on. I am 5'4\" and I do notice that if my head is not at the very edge of the futon my feet tend to hang off the bottom a little. If you are more than 5' tall this futon might be slightly small for you. For the tie e being I will. Make it work, but eventually I'll be replacing this with a larger version.", 
    "Too hard, didn't work as a primary piece of furniture. Sold it after 2 weeks.", 
    "Bought this for my sons room. It is very small, which we knew was the case, but was not prepared for how rock hard it feels.", 
    "It is a very beautiful looking piece of furniture, but it is very small. My 9 year old even says that it's too short in the back. So when you sit on it, you can't lean your head back. The ratchet system that lifts and lowers it isn't releasing evenly and I feel like it will break easily. Plus the cushion and/or fabric seems to look squished and disheveled after sitting on it ONE time. It is hard on top of it, so not the most comfortable thing on the planet. :(", 
    "This is pretty hard and lower to the ground than I expected. The seats are also smaller than expected. Easy to assemble and move around so that's a plus.", 
    "I was looking for something that would go well with my apartment. I was anxious to order this online especially that perhaps color would be much different from the picture. I ordered color \"tan\" and I must say that the color is true to what is shown. It's small but I was looking for something that will fit my living/dining room and this works perfectly. It's pretty firm but with time it will be more comfortable. It's very easy to assemble. I think that overall it's a good buy for the price and both my husband and I are pretty satisfied. It's not something I think will last for years but if well taken care of will serve us for a while.", 
    "Decent for the price and serves its purpose. Wasn't as long as I had expected. If you're more than 5'5, your feet hang off the end of it, if it's being used to sleep on. A tad bit flimsy but we are content with our purchase.", 
    "Ordered this futon for our sun room and it is the best! Great naps", 
    "It does its job,of a once in awhile extra bed. Not really that comfortable but how comfortable do you want guests to be", 
    "Ok for what I paid for it", 
    "Nice futon for kids hang out area. Especially for sleepovers and lounging.", 
    "The stitching is extremely crooked. Looks awful and I'm stuck with because I can't afford to ship it back. All the stitching is crooked. So disappointed!!", 
    "So far, so good. We had them up by New Year's weekend. We bought two in grey. We needed \"cat proof\" sofas, something with no arms, and a firm, square design, that is big enough to lay on and still fit into a small living-room in an over priced apt in PDX, Oregon. Yes, **** this same \"look\" at there store less money ($***.**), but it has springs in the seat, that bounced. These are padded, firm and comfortable, and do not \"give way\" to long term sitting.", 
    "I shopped all over for the right futon to fit in my home office and I chose this one. The color is true to the picture. It is a little low to the floor but it works for me. I have slept on it a few times now and it is quite firm but with time is loosening up. For the price I am very,very pleased with this futon.", 
    "This futon looks outstanding in my living room. It gives a touch of class to the look I've envisioned. Love, Love, Love it!!!", 
    "I love the sleek look and feel of this futon. I was disappointed that it looked bigger/taller in the picture than it was in reality. Overall I do like the look, feel and functionality of this piece", 
    "Very nice for a guest bedroom.", 
    "For my sons bedroom. Extra supports would be nice underneath otherwise no complaints.", 
    "You get what you pay for. Firm and not comfy to sit on. Expectations were low so we're met for $***. Easy set up was very nice.", 
    "Easy to put up and use. Small and super cute.", 
    "Perfect for my bedroom, used as a seat plus a place to throw all my clothes until I put them away. And a big plus: it's a sleeper too!!", 
    "Great quality for the price", 
    "So cute and comfy! We super happy with this futon.", 
    "Purchased as an upgrade for the living room area in our travel trailer. Since this futon is not large it fits exactly in the area. It will be possible for an accompanying grandchild or two to sleep on, but only marginally adequate for an adult. Neutral color allows for addition of color appropriate throw pillows to go with the trailer decor. Nice addition that looks good too.", 
    "Purchased this as a small sofa for our music room and it was a perfect fit. Good quality as well", 
    "It's a little low, but verrrry chic!!!! Classic clean lines, super easy assembly, just add legs lol. Great all around product. I just wonder what size sheets and comforter to buy for it's use as a bed??? Anyone??", 
    "The futon is easy to convert. It is good quality and the color is great!", 
    "If you live alone, this futon is a good choice for you since it doesn't take up much space and it also functions as a sofa bed! The only flaw I'd say, is it's not that soft, if you want it to be extra soft, you might buy pillows/toppers. But overall it's totally worth the price.", 
    "Arrived quickly. Love the little couch, fits perfect in small office. Fabric was nice, color is true. Legs are plastic and look plastic.", 
    "It is perfect for a kids/teen room. I think it is worth the price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/DHP-Dillan-Convertible-Futon/10302379/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10302379/DHP-Dillan-Convertible-Futon-461b1dd1-7bb7-430a-aec9-40be24faa5bb_600.jpg"
  ], 
  "description": "Go for a modern look with this Dillan convertible futon from Dorel Home Products. With its neutral colors of grey and tan and solid pattern, this futon is an ideal choice to update your home office with a neutral color scheme. Soft microfiber material and a foam upholstery filling ensure this futon is comfortable to sit on for a relaxing area to lounge or to seat guests. This futon offers versatility with its convertible feature, making it easy to quickly change from a sofa-style to a full-size bed for a quick afternoon nap in the office.Foam-filled upholstery and soft microfiber material for comfortable seatingLarge futon measures 18'H x 69'W x 32.5'D when in seat positionChanges from a sofa to a full-size bed for versatilityNeutral color scheme of grey and tan colors for a modern lookFrame Back Height: 29.000Fill Material: 100-percent Chipped Foam,Leg Height: 8.000Mattress Height Above Floor: 14.600StyleModernMaterialFoam, MicrofiberTypeSleeper Sofa, SofaThickness6 InchAssemblyAssembly RequiredColorGrey, TanFurniture PatternSolid"
}