{
  "name": "DHP_Dillan_Vanilla_Faux_Leather_Convertible_Futon", 
  "price": "EUR 241.47", 
  "reviews": [
    "Pleasantly surprised by this Futon. I would suggest a pad over the seam when used to sleep on.", 
    "Faux leather...NO, looks like cheap vinyl & the feet, that I assumed were wood, are quite obviously plastic. Just needed something small & armless for staging a small room. Would be alright for a child's bedroom....not main areas of the home.", 
    "the description says that it is 69 inches wide, however I just bought this item and I am 5 feet and 4 inches which is a total of 64 inches and my feet stick out of the futon; something must be wrong!Positive: it looks pretty and it is ok for a small room - but if you want to sleep on it, buy a matching ottoman.", 
    "Beautiful color, better quality than I anticipated.", 
    "Love the futon. Perfect for my small room", 
    "Futon cushion is firm so it won't wear easily. Easily converts into bed and is great for our small guest room. Fits one person comfortably- seems twin bed sized. The back is a little lower than I expected, but is still comfortable and provides support. I love how the vanilla color brightens up the room and it is easy to clean.", 
    "I have personally had a full size bed for many years, and this futon in no way converts to a full size bed - it is not even twin size. I put both full size and twin size sheets on the folded down futon and both were much too big. It's just okay as a couch... still looks child-sized. Additionally, I bought this based on the delivery date estimate, but it arrived several days after the given date. Disappointed overall. I want to exchange this for something that is actually true to size, but I have no idea how to return such a bulky item.", 
    "bought this for an extra bedroom, folds down so someone can sleep on it. My dogs have found their way to it and enjoy it. Great price and good quality", 
    "We bought our daughter this sofa for her first apt and she absolutely LOVES IT! Just screw on the legs (found in hidden compartment) and you're set!", 
    "This is my first negative review for overstock. It came in undamaged, packed well, went together without problem. It is about 8 inches off the floor and hard as a rock. It is small so if you want somewhere for people you don't want to stay to sit...this is your sofa. If you plan on sitting, forget it. Not worth sending back. It will go into the basement and will only be used if we are down there waiting for a tornado warning to pass!", 
    "This is a fine sofa/futon for the price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/DHP-Dillan-Vanilla-Faux-Leather-Convertible-Futon/10317691/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10317691/DHP-Dillan-Vanilla-Faux-Leather-Convertible-Futon-b8f1fda6-c73a-4e6c-ab77-90888152e0a2_600.jpg"
  ], 
  "description": "Get the most out of your floor space with this convertible futon that pulls double duty by offering comfortable seating by day and a spot for sleeping at night. Ideal for dorm rooms and small apartments, this futon features faux leather upholstery that gives you the look of leather in an easy-to-maintain yet durable format. Faux leatherTapered legs for a relaxed lookMulti-position backConverts quickly and easily from sofa to full size bedWeight limit is 600 poundsSet includes: One (1) futonMaterials: Faux leather, foamFinish: Vanilla faux leatherUpholstery fill: FoamWeight: 69.5 poundsSeat dimensions: 14.5 inches high x 69 inches wide x 20 inches deepSleeping dimensions: 14.5 inches high x 69 inches wide x 38 inches deepOverall dimensions: 29 inches high x 69 inches wide x 30 inches deepFurniture Pattern: SolidFurniture Room: Bedroom, Living Room, OfficeType: Futon Set, Sleeper Sofa, SofaStyle: Modern, Contemporary, TransitionalMaterial: Foam, Faux LeatherAssembly: Assembly RequiredThickness: 6 InchExact Color: CreamSize: FullColor: CreamStyleContemporary, Modern, TransitionalMaterialFaux Leather, FoamTypeFuton Set, Sleeper Sofa, SofaThickness6 InchAssemblyAssembly RequiredColorCreamFurniture PatternSolid"
}