{
  "name": "Elements_Cross-design_Reclaimed_Look_Coffee_Table", 
  "price": "EUR 119.11", 
  "reviews": [
    "I wasn't sure what kind of coffee table I wanted so decided to get something low cost while I continued looking. This fits bill perfectly. The color is a dark brown, so I sanded it to uncover the weathered gray finish beneath. I didn't finish it with anything, just left it natural wood. It's in a room with Lee chairs and couches, large Pottery Barn clock, and Restoration Hardware media center. You would not know I only spent $120 at Overstock on the coffee table. It fits in perfectly.", 
    "This is a great piece. I am an Interior Designer and I bought this for my own house! I was very hesitant about ordering furniture online but the piece is solid wood and took 10 minutes to put together. It' s a great looking piece that gives a little rustic/modern look to your seating/living area and was exactly what I was looking for. The price can't be beat!", 
    "I loved the design of this table. It is a sturdy table with good weight to it. The crossbar is in the middle of the table, which is much better than expected (I was afraid it would be at the back). Really lovely frame BUT the wood is NOT what I expected. It's a weird dark brown color. Very coarse and has a weird tint to it. NOT anything near a shade of grey. Just dark, ugly brown. I'm going to keep it for the great price and try to resurface it myself.", 
    "The \"shabby chic\" element of this table is horrible because it is simply repeated several times across the table making it look ridiculous. The same 3-4 scratches appear exactly the same in a few spots. I tried sanding it down but there is such a thick layer of gloss (not shiny) on top that I need to get a rougher sand paper to try to sand out the uniform scratches. Was also given a bolt with no threads to go into a nut to hold the legs together & had to call to request a new set of hardware. Don't bother with this table, regardless of the price.", 
    "This table is simple and sleek, yet unique. I love that it has a modern, cottage-like feel, without being too country. Plus, it was a great price and very easy to put together.", 
    "I bought this for my living room and once I opened it decided it was too \"cheap\" looking as the wood looks fake...I thought this was make from actual wood, and it might be but the glaze they put on over the top makes it look cheap. It was not as wide as I had hoped but was impressed with the metal construction. Though I did not put this piece together (am returning).. it seemed to be of adequate construction, minus the look of the wood.This could probably be corrected if sanded down...", 
    "The wood top looks like cheap partical board- I was disapointed!", 
    "We actually purchased this coffee table to use the base only to support a marble coffee table top we already had. The original base was a massive, dark, \"black hole\" and I liked the clean, simple lines that coordinated with some detailing of the tabletop. The wood top is an interestingly distressed slate grey-black that creates a serviceable transitional style with the matte black, contemporary metal base. It was easy to assemble. it's not a heavy nor heavy-duty piece; it could be just right for college or apt. dwellers that don't want heavy furniture to move all the time. It is current looking and something you wouldn't worry about stacking decor on or using as somewhere to rest your legs watching TV.", 
    "The fake, laminate, table top is a light, khaki, tan color. It is NOT grey. (The legs are grey.) It appears as 3 fake pieces of wood with fake grooves to appear as 3 pieces, yet does so, cheaply, and clearly appears as Made in China. There is nothing \"rustic\" at all about this table. The \"reclaimed wood surface\" feels like a cheap. laminate counter top from the 70's.It is a heavy table with a modern design. The description could not be more incorrect. BEWARE!!!", 
    "Absolutely love this product!! Its sturdy, easy to build, and looks wonderful! It's like having a Restoration Hardware furniture but for a fraction of the cost!", 
    "The reason I would not recommend this to a friend is that this table is NOT grey, more like a honey oak. The table is of good quality for the price I paid. I think I will have to adjust the color myself.", 
    "Love the look of this table but looks cheaper than I expected. I bought it for our basement so it works fine, just thought it would be a more substantial piece for the price. Color is what I expected. Legs are more of a brushed metal and I was expecting it to be more rustic, artisan. Probably would not buy again.", 
    "I ordered this table because I like the look of wood and metals combined. This table was reasonably priced, very sturdy, SUPER easy to put together, relatively light-weight for being as sturdy as it is. There are marks on the top to make it look worn/weathered, but you can tell they were made by a machine (or something) because it's 3 dots and a slash in various parts of the table-- weird but doesn't really matter. This style with the cross bars (as opposed to the sister style with the bottom shelf) is a little less nice-looking. I would've preferred the bottom shelf, but didn't feel that it was worth the additional 50% of the cost. Overall, I'm happy with the purchase. It is a great minimalist piece, which will work best for people who don't have a lot of space (the table is long but not very wide), and is a refreshing change from Target/Ikea furniture.", 
    "We're overall fairly pleased with this coffee table. It's very heavy and sturdy, and the cross-pieces are attractive and well-made. I'm a bit disappointed with the top wooden piece: the description claims that it's \"reclaimed wood,\" but the pieces are all identical and appear to have machine-made little dents/scratches to make it appear reclaimed--only they're in the same place on each board! I should have known it wasn't really reclaimed wood for the price, but I was hoping it would be! Unlike some other reviews, our color was a fairly close match to the picture--a medium gray-brown.", 
    "The finish is distressed so beware. I like it but if you are looking for something that is smooth, this table is not for you. Easy to put together.", 
    "Just got the table today. Shipping was super fast (3 days). The table is simply awesome. It looks just like reclaimed wood, is very sturdy and easily put together. It has the look of a much more expensive table and fits perfectly into my living room. I would not only buy it again, but also recommend it to anyone looking for a simple, yet stylish coffee table.", 
    "Gorgeous Coffee Table very sturdy", 
    "Great table, just looks a bit small next to my sofa.", 
    "Very cheap looking. Should sell for **.** max", 
    "Love the gray tones in the wood. It looks more expensive than what it is.", 
    "Great fit but not the represented color. Ended up being more gray then tan/brown/wood. Decent construction for the price. We ended up staining it a bit darker to our preference and it's been good since then.", 
    "Was hoping for a bit more character on the table top, but for the price, it's OK.", 
    "Fits well in small living space", 
    "It looks somewhat better in the picture than it does in real life. But, it's a decent coffee table for the cost.", 
    "This table was easy to put together and looks great in our living room. Only giving 4 starts because the center part can get wobbly and the screws are hard to tighten, but so far it's worked great for us!", 
    "Purchased this table a while back and love it. Wood grain and texture look authentic. It is sturdy - holds up to the occasional red wine stain and feet resting on its edge.", 
    "I ordered this as a simple coffee table for a room where we watch TV. I wanted it to be small and uncomplicated and functional. This one fits the bill. It was easy to unpack and put together - I did it alone in about 10 minutes from start to finish. The metal frame is basic and the wood top is plain but what would you really expect from something at that price point. My only issue is there is a small area on one corner that has some damage and I plan on contacting overstock to see what they can do about it. Its nothing I cannot live with but I expected it to not have a piece broken off one corner right out of the box. I like it and if you don't have high expectations you will like it too. Also, the wood top is a bit more grayish than brown but still looks good. Not sure if they all ship that way or not? Hope this helps!", 
    "We have had this a few years now and it has held up ver well! Made very well and is exactly as I wanted. Matches perfectly in our living room. Would definitely recommend!", 
    "The table looked beautiful in the pictures, so I was very excited for it to arrive. Unfortunately, it's a yellowish brown, not weathered grey, and the \"reclaimed\" look is simply from poorly done white stain. i will be returning it.", 
    "Shouldn't have expected much for the low price, but it's a functional coffee table. Can't say the material is super nice, but it gets the job done.", 
    "I love it the moment I took it out of the box", 
    "It was easy to assemble. When I first opened the box, I thought it was too small for the room but it was perfect. Great price and quality!", 
    "Great sturdy table. Love the look!", 
    "The table was sturdy, however the color was not as depicted in the picture. Its was more of a blondish colored wood rather than grey.", 
    "Very pretty - obviously not a high end piece but it fits the bill.", 
    "The table looks nice but it's fairly flimsy and doesn't seem extremely solidly made. Not made for the price but I wouldn't want it to be my main coffee table or to put very heavy items on it.", 
    "I sent this to my daughter for her college graduate apartment, lucky girl, and she assembled it easily by herself. Very impressed, easy to put together, and it looks FAB! Another happy customer...", 
    "The top was bashed, perhaps in shipping. I thought it was also scratched. Customer service for the company was responsive. They claim the scratches are supposed to be there. Odd. They are sending a replacement top. Also, one leg did not fit properly into the table top bottom. Since it can;t be seen, I'm not worrying about it. It's not high quality. It is sturdy though.", 
    "Easy to assemble. Sturdy. The actual table top is less glossy/coated than it appears in the picture.", 
    "I bought this to go in my small den/guest room. It fits perfectly and its delicate style doesn't overwhelm the room. It was easy to assemble and looks like more expensive versions from retail stores.", 
    "After reading the reviews on this table I decided it probably wasn't a good buy, but I did like the base. We intended to replace the top with our own wood anyway. When the table arrived I immediately had to agree with those reviews - it was not solid wood. The edges of the table are taped with wood-look formica strips, the grooves are only an 1/8\" deep, and the finish is very uniform and unlike real wood grain. I'd have sent the table right back if I hadn't planned on replacing the top. The only thing true to the description is the base, which I like.", 
    "We ordered this for our basement/ man cave/ TV area, and it is great for that. The (fake?) wood on top is kind of a light brownish tan. Easy to assemble. Good price and sturdy enough for my husband and his friends to put their drinks and feet on. Nothing fancy that I would want for a nice living room or anything.", 
    "I put this in my bedroom and it looks great!", 
    "Table was easy to put together and appears to be very sturdy. Manufacturer used some kind of watery white paint to \"age\" wood and my table had quite a few drips and looked cheap at first but dripmarks were easily removed with a sponge and soapy water and now I like the finish a lot. Also, I recently hosted a party and a few of the guests sat wet glasses down without coasters (grrrrr!). Marks removed very easily the next morning. All in all, a good buy for the price.", 
    "Although it is cheap, it really looks cheap. You get what you pay for. I had to return it. The table looks incredibly cheap.", 
    "I read the other reviews so I was ready to get a table that wasn't like the one pictured. But most reviews said the table was darker and not the \" grey\" color. My table was a light wood , almost orange. But since it was real wood I sanded a little and restained it darker. It's a nice table if your not picky on the color or have time to restrain it.", 
    "Solid and easy to assemble. Nice accent for the living room.", 
    "I've sanded this down like 4 times already and changed the color :) I love refinishing furniture so once my puppy chewed the one corner, I've had a blast changing the colors around.....love this table.", 
    "This is a sturdy table but the top is MUCH more orangey looking than the pic.", 
    "I should have believed other reviewers...I also will be redoing the top. It just looks strange. Weird brown.", 
    "This coffee table adds the rustic touch I was looking for in my formal sitting room. The table is easy to assemble and very sturdy. Although close examination reveals it's budget-friendly aspects (reclaimed \"look\", factory-designed parts, etc.), it has a great design and brings together the room nicely.", 
    "Affordable rustic coffee table. Top doesn't look sealed so you may want to seal it before using. Wood top is soft and can scratch easy, but overall I like the look.", 
    "I love the look of this coffee table but the top was much darker than it looked online - I think we will sand it down and re-stain it - the design is great & I'm hoping we will love the final look.", 
    "This is a lovely coffee table, with versatile design. Highly recommend!", 
    "It is perfect to match my grey couch. It has very small hints of grey that accent the couch. However it is a light wood color. I'm not mad about the color so it works great for my rustic/cozy living room.", 
    "Solid construction. The finish of the wood takes stains easily- make sure to use coasters or protectant.", 
    "When I opened the package to look at the table top, I did not even want to open it up further. It looked like a piece of plywood with 3 lines. My husband insisted that he put it together and maybe I would change my mind. Nope. Being returned ASAP! So disappointed!", 
    "Wood is definitely not gray. It looks more like a \"pine\" but very cheap. Disappointed. Returning immediately.", 
    "It is way smaller than it appears.", 
    "Quality on par with the price. Not a big table", 
    "Bought this table for my daughter and we're very pleased with quality and value. Easy to assemble, however more brown than grey.", 
    "The table top is not grey but more of a brownish wood color .. but I love this table. It is very high quality and looks beautiful!", 
    "This is NOT a grey table-- this is a tan/light brown color. Really disappointed that it's not even remotely the same finish as in the picture. Also, it doesn't look like distressed wood-- I don't know why, but it looks cheap. Really disappointed. Keeping it because it's more of a hassle to return, and I'll try to do something with the color. Only really bright aspect is that it's really easy to assemble-- can be done in like 10 minutes.", 
    "For the money, this is a good table. Stylish and sturdy enough, but the color is definitely not grey. Honey better describes the table top.", 
    "First off, this table is NOT grey - it is brown. There is no way anyone would ever consider this color to be grey. Secondly, it was very frustrating to assemble. The concept was extremely basic but the screws provided were too short and what should have taken ten minutes took over a half hour because I had to keep messing with the screws - trying to get them to work!", 
    "The table arrived well packed and no damage. I was pleasantly surprised with the good quality. Color matches well with our apartment. Easy to assemble.", 
    "This is a great little table for the money. I love the style, the fact that it is solid wood, and not composite was a major contributing factor when deciding to purchase this table. It is a fantastic value.", 
    "I was disappointed to find that the wood color of the table is not at all grey, but a rather a yellowish/tan wood. I had bought this specifically to match our grey/blue coloring of the living room, so was upset to find the product was not as pictured.", 
    "Overall, I really like this coffee table. However, the color of the wood is not what is pictured online. In person, it it much brighter/lighter and has a stronger yellow in it than expected. That said, it is a good quality piece that still met my expectations.", 
    "Cheap looking legs and top.", 
    "The description is a grey coffee table however, it arrived and was brown. Also arrived damaged. Not great quality. Looks like fake wood.", 
    "This isn't a piece of furniture I would put in a fancy house, but I wanted it for a beach house rental, and it's works, because I wanted something on the small side, & not too heavy. The metal base is great, very sturdy. As others have said, the top isn't real wood, and it's kind of thin looking. There are a couple of spots that look almost like blistering or peeling, but it's holding up so far. It is fine for the price, but if it were my home, I'd probably want something a little more substantial.", 
    "My friend had this table in her apartment and I loved the look and feel of it. It the \"weathered\" style and imperfections. Only issue I have with it is that one of the pieces that holds the metal cross was broken. I don't have time to send items back to I am using as received. No issues though.", 
    "Very cheap, not quality. Dent in to, base metal is very cheap looking", 
    "This is NOT grey. I read the reviews and saw this comment as well but wanted to see for myself. Indeed it is a orangy wood color, nothing close to grey. We ended up staining it a darker color and it looks better now. It wasnt worth the packaging and shipping back since it was 60lbs. Easy to put together and looks nice. Kinda dinky but itll do.", 
    "Great coffee table, however the coloring is much different in-person, compared to the picture. This is tan/nude coloring and not gray! I was disappointed by the coloring. I was wanting more of a gray but the overall quality is good. Very easy to put together as well.", 
    "I like the crossbar style and the color of the metal, but this table IS NOT what it's portrayed to be. First the top is not gray- it's a golden light oak color. The distressed look is VERY fake and looks like somebody dipped a rake in white paint and raked it over successive strips of fake grooved wood top. I wish I could post a picture. Prior to ordering, it appeared to match my World Market Jackson dining table, so I thought I'd give it a try. I read the reviews once I received it, but I can't understand how it got 4 1/2 stars if so many were dis-satisfied with it. I am going to sand it down, do my own distressing (internet has great ideas on that) and then stain it a darker color to complement my other furnishings. I can say that I like the base, hence style rating I gave it. Worse case scenario, I can use the base and use REAL wood instead of this crappy thin plastic-edge piece4 of cr-- veneer plywood top. Good thing I'm handy. I don't want to risk the issues of returning anything to Overstock due to the bad reviews on returns. Sorry, I hate to give such negative review, but it's how I feel.", 
    "It is not what it looks like on the picture. no such thing as salvaged wood...", 
    "This table has great style and quality FOR THE PRICE. It fits the bill for a more rustic looking table, but it doesn't compare to similar tables that sell for over ***. The top appears in the picture to be multiple planks, but it is one large piece of wood routed out to appear like planks- not a huge deal- just an example of why it doesn't look expensive.", 
    "The finish of the table top is not as grey as I had hoped. The value, however, is worth keeping it! It's a heavier, sturdy table that fits great in my living room. Great piece!", 
    "I was so excited when I saw this table online. The picture was BEAUTIFUL! When I received the table, I was SO disappointed! It looked NOTHING like the picture! Also, it's not solid hardwood. Looks like MDF. Don't waste your time! It is not grey. It is faux \"weathered\" oak??? Has some gray and white. I would send it back but don't want to deal with the hassle. Already returned one item. Not a very friendly return system. Doubtful I will order from OS again.", 
    "I expected more quality of this product. I'm not so happy with the wood top of the table. Looks little bit cheap. I think price should be lower. Overall it looks good.", 
    "I was SO excited to receive this product - I even purchased a few other prodcuts that would go with this \"grey-ish\" coffee table and when I opened the box it looked NOTHING like the image displayed on the website. It looked more like a yellow pine finisha and the white marks on the table looked like somebody just took chalk and made it look distressed. I called immediately to complain about this product and they said I can return it but seemed more of a hassle than anything else. I ended up just keeping it for the price and will probably use this as an entertainment center/table. DO NOT BUY if you're looking for a grey finish.", 
    "Bought a couple of the elements items, they look nice, were easy to assemble and were fairly inexpensive; for the price I think its a good purchase.", 
    "I was so excited about this coffee table. To my dismay, it was TOTALLY AND COMPLETELY the wrong color. It arrived and I was so pumped to put it together. Take it all out of the box and immediately saw that the table top (supposed to be a grayish brown) was a orangey color. Unfortunately it looks nothing like the table in the pic. I called the manufacturer, thinking they had just shipped me the the wrong color and the sales associate informed me that table/model number only came in one color. Hmmmmm. I told her it looked nothing like the picture online and she \"informed\" me it was either the lighting in the pic was off or my monitor was messed up. Lolololol. Yeah. I wish I could post the pic of the table delivered on here to show the diffidence in color.....", 
    "Product arrived damaged today, and when I went through my orders to try to return it, it just lists \"not returnable\" on the order. I tried to contact customer service but for some reason the contact option page won't load now either. so incredibly frustrating!", 
    "This table really wasn't what I was expecting. The wood finish was a little off to me. Not really gray more of yellow tone. The base was ok. Sturdy but the finish made it look cheap. I returned it.", 
    "Just like other reviewers said, there is no gray in this table's color. It has a \"distressed\" effect added to it, which I see some are saying is cheap. But for $100-ish dollars, you're getting what you pay for. It's certainly mass-produced and not reclaimed barn wood or anything. The \"planks\" on the table aren't actual planks but rather 1/4\" carved lines made to look like planks. That said, I'm perfectly happy with this purchase. It is a good, sturdy table for the price.", 
    "Excited about the purchase of theis \"gray\" coffee table. Upon receipt very pleased with the sturdiness , simple design, and easy assembly of the table. The tabletop, however, was very poorly done and did not look like the picture. Rather than being gray it is a honey oak-like color that looks like attempts were made to distress it with white chalk. It does not give an authentic distressed look but rather a look of a small child taking chalk and drawing on the furniture piece. Very disappointing given the other positive attributes of the table.", 
    "Table was sufficient. A little small but good for co-op. Very easy to assemble. I would recommend to a friend!", 
    "I looked and looked for a coffee table with a distressed look. I was looking for a unique design. This coffee table fit the bill - functional, beautiful, easy-to-assemble. My husband put it together in about 15 minutes. As other reviewers have mentioned, the table doesn't actually fold in (the folding assembly is not functional, just aesthetic). I do wish it came different styles. The table looks great in my office/den area.", 
    "Arrived on time, easy to assemble, sturdy, nice looking table.", 
    "Colors of mine were close to picture, same comments about how they made the marks on the wood. The size and style are what I wanted though. The top is not real wood as stated, some type of particle board. We had a chair bump a corner and it just disintegrated.", 
    "Ordered unit. Arrived without damage. Very easy to assemble and quite sturdy. The top is supposed to be distressed but is poorly done. The unit top is not solid wood but appears to be a plastic-type wood laminate and is one of the ugliest colors I have ever seen. Other reviewers have noted same. I sanded the top down to remove the finish and restained it in Golden Oak with a wipe-on polyurethane finish. It looks quite nice now. If you want to invest some time and effort you can arrive at some thing nice but most people won't.", 
    "I went into this purchase knowing the reviews said this table is NOT grey. I guess I had hopes that maybe some coffee tables were grey and others weren't. Lo and behold, my coffee table is not grey. It's cardboard color brown. It's kind of a shame that Overstock keeps that incorrect description up, knowing it's incorrect. Regardless of the color, it's a nice coffee table. I'll try and figure out a way to make it match my decor through sanding and re-finishing. But if you're like me and trying your luck for grey because you really want grey, DO NOT BUY THIS COFFEE TABLE. It's not a gamble you're going to win. But if you want a cheap-ER coffee table that you can put some work in to to make it what you want, then go for it.", 
    "The table does not look like the table in the photo. The legs are painted metal, the top is cased in linoleum. Paneling looks extremely fake, not like real wood planks. This does not look like solid wood, it does not look like distressed wood, it does not look \"rustic\". It looks like a cheap Made In China (it is) product. Given the price, you get what you pay for and if you are looking for a cheap table for a dorm room, this would be great. Two stars only because the plastic on the top and leg construction seems like it would be fairly durable overall.", 
    "I like the table. It seems sturdy and the top is real wood. HOWEVER, there is nothing grey about this table. The top is not \"weathered grey.\" It is about the same color as a cardboard box. It's pretty, but it doesn't coordinate with my decor, so I'm afraid I'm going to have to send it back.", 
    "Good price. It looks more like weathered brown than grey.", 
    "This coffee table is a nice size and very sturdy. Took about 10 minutes to assemble. We also bought 2 end tables in the same design, so once you've assembled one, the others are super quick. The photo online is deceiving. The table top is certainly more brown or golden than the grey that is pictured here. However, it is has a subtle white wash, distressed look, that is modern and tasteful. This is not heirloom furniture folks, which ought to be evident from the price. But we are using it in a corporate waiting area, and everyone comments that they think it is \"cool.\" We have predominately greys/blues in the striped carpet tiles, so it works nicely. The table is modern but not too contemporary. We paired it with a nice black leather love seat and 4 sunflower deco chairs (also on Overstock). The table might be a tad on the skimpy side for a sofa, but with our love seat it is the perfect \"weight.\"", 
    "Great product. Easy to assemble, nice design, looks great as a modern rustic element in a room. Good size too.", 
    "This is a really nice table. Very easy to put together and seems very stable so far. The top has a nice weathered, sort of reclaimed wood finish so it fits in easily in any setting. Also given that the table top is already supposed to look weathered I'm not too worried about water marks etc.", 
    "This is a great table. We ended up buying another one and the matching desk. It looks like West Elm or another rustic, but modern type of feel. It is not heavy at all. But it is also not flimsy. Good buy for the price!", 
    "I've had this table for over a year now. It's always gotten compliments, and no one believes that it's from Overstock, or how inexpensive it was. I have a slobbery mastiff, and her \"visits\" wipe off easily. The finish comes looking perfectly aged, but we've seen that mishaps like tossed keys add a patina that blends perfectly. I was finally ready for a bit of an upgrade, so today I spray-painted the frame (not the table-top) with Rustoleum Universal Metallic in Satin Nickel. The table was great before, but I'm lightening some of my decor. I have to say that it took the spray paint perfectly. I wiped the legs down with acetone before starting, but didn't need to sand at all. Not knocking the original black at all, just happy to report that it's very DIY-able. This is the cheapest piece of furniture I've bought that I expect to own for this long!!", 
    "I thought it would have more craftsmanship for the price I paid, but it seems like the coffee table is one solid piece of wood, which makes it look cheap. The size is underwhelming, but it turned out to be a decent size because there is room to move around in my living room.", 
    "It was what I had expected. Colored matched and was what I was expecting. I was very satisfied!", 
    "I really like this table but bought it knowing that I would either put marble on top or real reclaimed wood. The top looks like a piece of wood that has had grooves and wear marks put in it and painted. Gives a rustic look to my contemporary room. It is very sturdy and fit together perfectly in a matter of minutes. I just ordered the matching console table, so clearly I like it enough to buy more.", 
    "It is very country looking, cute and easy to put together.", 
    "Love this table. Easy to put together, and very sturdy.", 
    "We purchased this as a gift - and were very surprised at the quality.", 
    "Product is ok. I should have known \"assembly required\" means fairly cheesy. Everything lined up ok and is as described, but it's just ok - nothing noteworthy and certainly not a conversation piece. It isn't worth it to send it back, as it fits our needs and it wasn't THAT expensive, but it's nothing to crow about. I would have been happier paying about 80 bucks than 150.", 
    "If I needed another coffee table I would buy this again. Very easy to put together and very solid. I would recommend this heartily to anyone.", 
    "Pleased on the whole. It fits nicely in my smallish apt. and blends well with my \"eclectic\" style of furniture which is a mix of danish modern and contemporary. Table does not look like an \"investment\" piece of furniture but does not look cheap either.", 
    "Overall we are very pleased. The product is very well made and easy to put together. It arrived with no issues. After assembling the tables, we like other reviewers, were left with the impression that they look much more expensive than they really are. We were a bit bummed after purchasing two of them, that the price dropped not long after our purchase, but even given that, we felt they were a good value.", 
    "I LOVE, LOVE, LOVE this coffee table. It assembled easily and is very sturdy. Also exactly what I was looking for: a reclaimed look table with a gray wash finish. One more wonderful purchase from Overstock!", 
    "You get what you pay for here (or less). Quality is poor. Thin metal legs feel like they will buckle, surface feels like a slight upgrade from particle board. There were six big scratches on the surface from the legs packaged. I have initiated a return, hopefully it goes smooth with Overstock. Would give 1 star, but for the price, I suppose the quality is to be expected.", 
    "I love this table it looks great in my small living room. It was really easy to put together. It has a weathered look so make sure that is what you want!", 
    "This table looks great in our living room! It was easy to assemble and perfect for our needs. We are happy with this purchase.", 
    "Easy to assemble, simple table, lightweight. Fits easily in my living room.", 
    "After looking in catalogs and stores I found this table here and decided to take a chance. I just assembled it and am very happy with the look. It's a perfect style for our family room and fits nicely in the space in front of our sofa to the side of the chaise piece. It's nice because it doesn't visually obstruct the space due to its sleek design.", 
    "This table is just as it is presented. It is perfect on the screened porch and was very easy to assemble. I did it by myself very quickly. It looks nice and is very sturdy for its composition. It's not a grand piece, of course, but it is well worth the money and perfect if you need a small, rustic table. I like the wooden board top combined with the metal legs very much. Nice look.", 
    "This was a great purchase. The table arrived in only 2 days and was very easy to assemble. The color of the wood is not really grey, but looks like actual distressed wood. I have seen similar tables in high end store for three times the price. It is a great size for a smaller apartment and is very sturdy. Overall, this is a fabulous table for the price.", 
    "this is one of the nicest looking coffee tables around...especially for the price! we love this table...so sturdy, great rustic/modern look and feel. It's easy to clean and very durable. I love it!", 
    "Coffee table is the same as pictured and doesn't look cheap at all. Looks great and was easy to assemble.", 
    "This is a decent table. It is well made, simple and easy to assemble. Good value for the price.", 
    "The table was well packed and easy to assemble. I am very happy with it and will definitely buy more items off of this site.", 
    "The table is sturdy and very easy to put together. I think it took me a total of 10 minutes. I'm very happy with how it looks. I think the most frustrating part was cleaning up all of the styrofoam after I was finished, but that just means it was packed very well.", 
    "I LOVE this table. It was so easy to assemble and once you do so it is sturdy and solid. The finish is great, looks like worn wood. Clean lines and metal stand keep it contemporary and not too rustic. I would definitely recommend this product.", 
    "Regardless of being miserable by going through 2 coffee tables and not being completely happy with the look I have been trying to achieve in my living room (to include furnishing on limited budget), I have found THE ONE!!! Also, I am very satisfied I waited - even after I kept trolling overstock.com to view this coffee table and the rest of the \"Elements\" living room furniture line. After MONTHS of watching this item, I was able to get a great bargain and read more customer reviews to aide me in my decision to purchase. While negative reviews of this item exist, the only thing I have agree with is that \"distressed\" or \"rustic\" table top resembles the type of style you would see at West Elm, instead of Pottery Barn.", 
    "LOVE this table ;-) i had been looking for a modern yet warm table and finally found it at the fraction of the cost. I took me les than 10 minutes to asseble to table while i was on the cellphone and watching tv. I wish they made a tv stand like that.", 
    "Great starter piece. The color is a medium brown with a country look to it.", 
    "I purchased this table after looking for awhile. I wanted something that looked nice and could also withstand a busy household without paying a lot. This table was the perfect find. It was very easy to assemble and looked great when built. The description states its grey however, it appears to be more brown which is fine by me. I would definitely recommend this product and if needed I would also purchase it again.", 
    "Perfect coffee table to a small apartment. The image from the site matched perfectly. Very easy to assemble.", 
    "Great little table. It is more brown than grey which I prefer. We have it sitting in front of a Day Bed on top of a rug for a nice urban look. The table was very easy to put together. For the price it is a good deal.", 
    "this is a great table. Its exactly what I was looking for....love it! So easy to put together....it took all of 15 mins!! :)", 
    "This table is exactly what you see in the photo. It is easy to put together and looks fantastic. It is brand new but looks like it has been in my living room for a long time, due to the distressed top. Easy to clean and well made.", 
    "This table is another example of why I love overstock. Fabulous buy for the money!!!! Very sturdy, heavy, and great quality. Color is more on the brown side as opposed to grey, however grey tones are there but subdued. I plan on using this piece as a bench at the end of a bed in my guest room. This piece has so much versatility. I love the distressed look and went with this particular one from elements cross-design over the other because a lot cheaper. I love that overstock offers unique pieces for such reasonable prices. A decorators find!!!", 
    "I am very pleased with this table. Great quality and easy to put together.", 
    "This table is great! Seems to be sturdy. We had an issue with one of the legs not being drilled properly so could not put it together but we contacted the company and immediately (and I do mean immediately) we had the new part which worked perfectly (I think 48 hours after we contacted them, the new leg arrived). It is more of a brown than a grey like other reviewers have mentioned but I really like the color. While its true that it doesn't completely look like actual reclaimed wood, I think its a great value for the money!", 
    "The description of this table was perfect for a small sitting area we have in my husband's home office. Problem was it was out of stock! I requested to be notified when it was back in stock and sure enough a few weeks later is was available. I could not be more happy. It ties all the elements of the room together. Was a snap to assemble and looks better than I imagined. The top is very sturdy wood but not really grey-more of a grey wash so alot of the natural wood peeks through.", 
    "When I took the coffee table out of the box, I was extremely disappointed. I do not like how it looks at all. I will be replacing as soon as possible.", 
    "A lovely off beat coffee table, very easy to put together and light enough to move around without any problem. Great for people who enjoy something that's not mainstream or traditional !", 
    "Beautiful table, exactly what we were looking for. Looks just like the picture and it's a lot sturdier than we expected.", 
    "We just assembled this table (easy) and its great! For our budget, it looks amazing. We have a reclaimed barn wood dining table, & it doesn't compete with that, but it pulls off the distressed table look very well. It's a smallish coffee table, which should be noted. It's sturdy & doesn't wobble at all. Love it with our jute rug!!!", 
    "Nice table for a great price. Quick delivery, good quality, and a great addition to our room.", 
    "I honestly thought this item was too good to be true, and nervously waited for it to arrive. When I opened the box I was immediately thrilled to see that the cool weathered color of the wood was true to what is seen on the website. Everything was packaged very carefully and the table was easy to assemble (took me less than 15 minutes on my own). It is a wonderful addition to our living room, and at a significantly lower price than the very similar looking table I saw at XXXXXXX. In love! Thanks Overstock.com", 
    "I love this new table. It was easy to assemble and looks great. Nice industrial look with the warmth of the rustic wood. Great price as well.", 
    "Anyone considering purchasing this table should note that the actual product is A HUNDRED TIMES MORE BEAUTIFUL than it appears on this site. I have never been one to marvel over furniture, but this coffee table is breathtaking. I have received so many compliments since adding it into my living room. The wood has a number of dings, cuts and scrapes, which truly make the piece look repurposed and ONE OF A KIND. You will NOT regret this item. It would be worth it even if the price was several hundred dollars higher.", 
    "The color of the table I received was more greenish-brown than grey. The wood has been distressed to make it look like reclaimed wood but it is very obvious that it is not really reclaimed wood. Overall it still looks good, is sturdy and works for the space I ordered it for.", 
    "I think the top was made of pressed wood, not solid wood. The metal was lightweight and overall kind of a cheap but an attractive piece. I guess you get what you pay for but I returned mine. The return was expensive b/c it weighs so much so I lost *** on this piece just paying for the return.", 
    "Would recommend. Would actually consider a larger version as a coffee table in the living room. The unfinished wood look works in my contemporary house. Assembly was quick and easy.", 
    "I have a small apartment and this table fits in well (not bulky at all). It is sturdy and exactly what I was looking for.", 
    "A good basic coffee table. It is a little on the small side which surprised me, even though I did review the measurements. The \"distressed\" look is a bit on the fake side but the real stuff costs serious money so it was a good compromise. One leg was missing the rubber nub on the bottom which made it wobble. Fortunately the company mailed one as soon as we called.", 
    "the product is cheap/poor. i guess that is why it is only $$$. the legs/beams of the table are metal hollow poles. our intention in buying this product was the refurbished/antiqued look, but the legs make it look like look like very poor quality. very dissapointed.", 
    "quality piece of furniture at an affordable price. after reading reviews of the table i felt it was a safe bet and it lived up to its reputation.", 
    "I wanted a coffee table that was a bit rustic-looking and not too bulky for my space, yet one that fit my budget. This table exceeded all my expectations. It was easy to assemble - I was able to do it myself without any assistance !", 
    "I like this table. It was easy to put together and looks great in our family room. I struggled trying to find one and this one works with the other things we are doing in that room. Even with the iron legs a no lower shelf the talbe feels really sturdy. I'm happy with the purchase.", 
    "this product is exactly as described and imagined. it is decent quality, good solid wood. looks more expensive than it was. very easy to assemble. i am satisfied with the product.", 
    "I saw a similar coffee table for well over a thousand dollars. Although this is not really \"reclaimed\" wood, you would never know. I expected it to be very lightweight and unsubstantial based on the price. But to the contrary, it is heavy-duty and expensive looking. My decor is contemporary and it fits in quite well. But I also think it would look good with any style, depending on how you accessorize it. Love, love, love it!", 
    "This table was easy to put together and very cottage/ beachy chic! It looks just like the picture. Great price !", 
    "This table is perfect in every way! The wood is the perfect weather grey wash! I want another one!", 
    "I am very happy with the table...it was easy to put together and works well in my informal TV area. The picture shows that the top is thin or light in weight, not a heavy plank. I was hoping it would be heavier than it looks but it is exactly as the picture indicates. It arrived within 3 days and the assistance with my order was great.", 
    "Very good looking piece of furniture. It's sturdy and substantial and of pretty good quality especially considering that it was relatively inexpensive. This coffee table is one of those pieces that will compliment modern or contemporary style or even an updated country or rustic style. Glad I bought it!", 
    "Received this just today after ordering it on Feb 1st. The delay was due to weather according to the UPS tracking site. Nevertheless, it arrived in perfect condition, and it was easy to put together. I purchased it to use in my bedroom to hold my TV and DVD/DVR. Am very happy with it and would recommend it if that's what you are looking for.", 
    "Very easy to put together, looks great in our living room.. I'm a little nervous about water marks so I have put a tray on the table. hopefully it doesnt scratch... great piece for the price."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Elements-Cross-design-Reclaimed-Look-Coffee-Table/5217958/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5217958/Elements-Cross-design-Reclaimed-Look-Coffee-Table-af90eee4-54c1-4063-a217-c103ef63c4b7_600.jpg"
  ], 
  "description": "Update your living space with old-world style with this reclaimed\nwood coffee table. Constructed with an all-wood table top and\nsupported by a metal cross-style frame, this charming accent piece\nis reminiscent of turn-of-the-century farm houses and cottages. The\nframe is weather resistant with a powder-coated finish, making this\npiece durable as well as aesthetically pleasing.Solid wood and metal construction for durability and\n  longevityA weathered gray wood top delivers an old-world patina for\n  country charmThe graphite metal frame is weather resistant with a\n  powder-coated finish for added resilienceNon-mar foot glides protect your flooringCross-design frame complements a variety of decorsThe use of reclaimed wood is on-trend and Eco-friendlyTable Dimensions: 18 inches high x 42 inches wide x 20 inches\n  diameterAssembly RequiredStyleContemporary, Industrial, Rustic, UrbanMaterialMetal, Oak, Reclaimed Wood, WoodTypeCocktail Tables, Coffee TablesFinishGrey Finish, Oak Finish, WeatheredShapeRectangleAssemblyAssembly RequiredColorBrown, GreyFurniture Frame MaterialMetal, Wood, Wood & MetalFurniture PatternSolid"
}