{
  "name": "Element_Tall_Narrow_5-shelf_Bookcase", 
  "price": "EUR 100.70", 
  "reviews": [
    "I purchased this to fit within a certain skinny space I had, and of course for book storage. This isn't the best build-it-yourself bookcase I have seen and I have a number of them between my home and classroom. With three adults putting it together we still had trouble maneuvering and aligning all the parts with the correct holes. It sits slightly crooked and isn't the most professional looking piece (keep in mind it sits next to three other such bookcases that are much nicer and were cheaper).I would recommend you keep shopping for something that will look nicer in your space.", 
    "Works perfectly in my pantry which is located under my staircase, so the space is odd. It was not necessary for us to attach it to the wall. It stands sturdy on its own. Very similar in quality and look to that big box \"blue & yellow store\" stuff ;-). I also shopped there but they didn't have a size that worked for my space. It looks great, better than wire shelving. Shelves are adjustable so I can have big things like dog food container on the bottom. Assembly was easy. My husband and I did it together in about 15 minutes. I probably could have done it myself but some pieces and the assembled bookcase are kinda heavy. Instructions were OK, but not superb. I might have misunderstood some things but my husband being more versed in hardware language understood everything perfectly. The back is the only flimsy part which is a super-thin piece of pressboard with a fold in the middle, but it looks fine, it's not noticeable that it's flimsy. You could skip attaching the back and have open shelves and it would work just fine. We attached the back with a staple gun rather than nailing in a gazillion little nails that were provided. I plan on ordering more pieces from this line cuz the size works for me and the quality is fine.", 
    "We had to find a storage shelf that fit a very tiny spot and this was perfect. It wasn't too difficult to put together and looks very nice.", 
    "This unit was perfect for the purpose and place it was needed. It was an inexpensive piece and easily assembled.", 
    "Purchased this bookcase for my sewing room fabrics. It serves the purpose; however, back of bookcase was a paper product so wasn't very sturdy.", 
    "This was the perfect piece to fit into my office and matched the other furniture. Easy to assemble and a very sturdy bookcase.", 
    "This is a very good shelf. It worked out perfect.", 
    "After waiting the lengh of time indicated I was excited for my bookcase to arrive so I can finish the redecorating of my bedroom space only to find this long and heavy package contained 2 damaged side pieces. Now I have to wait for them to ship out teplacement parts and hope they wont be damaged.", 
    "Bookcase was very simple to put together. It took about 30 minutes-- all pictures no words. Good craftsmanship! A few commented on the back of the bookcase-- considering that it's just a visual and does not provide structural support, for me it wasn't an issue.", 
    "It came with 3 shelf's not 4.", 
    "Exactly what I needed for my closet", 
    "Very nice and easy to put together", 
    "This shelf has been a great addition to my small apartment. Thinking of getting another!", 
    "You get what you pay for ... Looks ok , not sturdy", 
    "decent looking pressed board color was lighter than expected", 
    "Easy to assemble. Perfect size for a small space.", 
    "The piece showed up broken in two separate areas. Seems like the shipper cannot keep a long box flat which causes bending and breaking in the middle. However; the manufacturer was outstanding and shipped another with no question and in record time. Bookshelf itself is average quality.", 
    "IT JUST PERFECT FOR WHAT I NEED! IT'S A LITTLE HEAVY AND TAKES TWO PEOPLE TO PUT IT TOGETHER. STURDY! (THE ONLY PART OF PUTTING TOGETHER IS THE BACK IS HELD ON WITH 50 NAILS)", 
    "This was very easy to put together and it is sturdy.", 
    "It is needed storage in a small space. It was easy to assemble and once put together sturdy and sleek looking."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Element-Tall-Narrow-5-shelf-Bookcase/9999176/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9999176/Element-Tall-Narrow-5-shelf-Bookcase-4d6b6f8a-1efa-4b87-aaa5-df079c39988c_600.jpg"
  ], 
  "description": "Enhance your study or office with this narrow bookcase, offering\nplenty of storage with a conveniently small footprint to fit in\nsmall corners or tight, unused spaces. This bookcase features five\nwide shelves, four of which are adjustable, allowing you to display\nyour books, knickknacks or photos according to your needs.One 80\"H x 16\"W x 10.5\"D bookcasePEFC certified sustainable wood is both durable and\n  eco-friendlyAvailable in beige, black, brown, gray and white colors to\n  match any decorFour adjustable shelves and a fixed one provide generous and\n  customizable storage spaceStyleContemporaryMaterialWoodFinishBlack Finish, Oak Finish, Wenge Finish, White FinishShelf TypeBookshelvesAssemblyAssembly RequiredColorBeige, Black, Brown, Grey, WhiteNumber of Shelf5Product FeaturesAdjustable Shelving"
}