{
  "name": "Elements_GreyBrown_Coffee_Table_with_Shelf", 
  "price": "EUR 138.61", 
  "reviews": [
    "I bought this table after an exhaustive search for a lower-priced, weather wood piece. I wanted the rustic look for a more polished space. The table came VERY quickly, which I was very pleased with, as I was excited to set it up in my living room. I have to admit, when I first took it out of the box , I was a little disappointed. It didn't necessarily look much different than it did online, but the way it was worn was very...unnatural. It looked like someone just took a very rough sander to the wood pieces, and went to town. It's quite distressed, but not in the way that natural would distress it, which is how I imagined it. Granted, for the price, I can't really complain. Two negative comments however: #1-the instruction sheet says to attache the top shelf first, which I did. But when you go to put on the bottom shelf, you realize \"Oh man, I should have put this one on first\" because you have to practically shape-shift it to get it through the side and place it. So I had to take the whole thing about (not happy about that!), put the bottom shelf on, and then attach the top piece. #2-I couldn't actually attach the bottom piece! The predrilled screws on the bottom shelf did not align with the notches in the metal frame, so I couldn't screw it into place. It's not a huge deal, as the shelf sits just fine without being screwed in, but it was pretty annoying that it was off kilter. Other than that, as soon as I accessorized the table with some books and whatnot, it came together, and I actually love the piece. Great value, fast delivery!", 
    "This table is OK in quality but it is super small. If you have a normal 88-92 inch couch it looks too small. I received the table, assembled it to find out that the table was wobbly. I am going to return it, not exchange it. The table is much less expensive compared to some other stores that have the bricklayer style tables, but I would recommend going with the more expensive ones. This is a cheaper version of the real thing and it looks cheap.", 
    "On the plus side: This is an extremely sturdy product, so if you're getting it for an area that will see a lot of roughhousing and tough use. this fits the bill. It takes about 15 minutes to assemble and the assembly is straightforward -- 14 bolts, allen wrench included.. On the minus side: The wood top and shelf are pretty ugly. First, the top and shelf aren't planked to mimic reclaimed wood. It's a piece of wood with grooves cut into it. The grooves aren't very deep. My husband said it looked like the paneling they had in the basement when he was a kid. Then there's the \"distressing.\" If you're expecting some kind of shabby chic charm, you would be mistaken. It's got a thin coat of whitewash and some gouges. I really do mean gouges. That wouldn't be so bad, maybe, except that the gouges are at perfectly regular intervals, so the piece looks damaged, like it banged into something repeatedly during packaging or shipping. And I think maybe they could have sanded the edges of the tabletop a little better, it looks like it just came from the sawmill. So, we aren't very happy with the product. On the plus side, it's sturdy and a nice size for a bench, so we're considering a cushion cover for it and tossing it in the guest room. That's probably a good solution to the problem, but we really wanted a coffee table. Maybe before turning it into a bench, we'll see if there's some way to rescue the top, like a semi-opaque stain in a darker color, some surgery to improve the look of the 'planking' and/or an actual faux finish distressing.", 
    "In general, I have been very satisfied with all my Overstock.com purchases and look thoroughly at reviews before making a purchase. If you've looked at reclaimed wood or barnwood coffee tables in furniture stores and like them, you may be disappointed in what you receive. The top is very heavy and sturdy, as are the metal legs, and seems to be solid wood as claimed, but it looks JUST like 1970's wood paneling that you would find in an old living room or cabin. Most of the tables you see in furniture stores will have separate slats or have some distressing to make it look modern rustic, but this is more like a grooved system (again, wall paneling style). It looks like veneer, but it's not? Nobody will think that you have a reclaimed or barnwood table - so if that's the look you're going for you might be disappointed. It's also quite small, so make sure you measure your area before ordering! I have to admit that I only pulled out the top before putting it back in the box for a return, and did not put the table together.", 
    "Bought for the beach house along with the desk. Perfect - looks great and is so easy to clean from sand and spills. love having the shelf underneath to hold games. would buy again.", 
    "Nothing really grey about this coffee table. It more of a maple/oak color with sanded down/scratchy parts that I suppose have some greyish plaster filling. There are some weird scratch marks on the shelf pieces.. at first I thought it was a mistake then realized they were purposeful scratches to make the table look rustic/weathered. It is some sort of particle board made to look like wood pieces which would actually be alright except that one of the corners came frayed/bubbled up a little. It's too much trouble for me to send back so i'll just live with it..maybe sand it down..and just paint the table some funky color anyway. it's cheap enough to play with. PUTTING THE TABLE TOGETHER: pretty simple and wouldn't have taken as long as it took me except that I followed the directions. Don't follow the directions. You can't put the table together in the way that they tell you to do it. Best to put one leg on..attach the bottom shelf on one side..and then add the second the second lieg, that worked. easy peasy. It appears durable and sturdy and at least functions better than the ottoman cushion I was using before. Dimensions advertised are true.", 
    "After assembling 3 of these (2 side tables and 1 coffee table from same line) here's what I found - the boxes arrive and they are VERY heavy, especially the coffee table. The parts are nicely packaged, but the instructions should be modified - the tables have a shelf which should be inserted after the first set of legs is attached. If you try to put the shelf in after both legs are attached, you risk scratching the metal (ask me how I know) - the bolt holes do not always align perfectly, but with a little pulling and pushing, you can make it happen. Overall, I'm very satisfied - the tables are much, much heavier than I thought, and I'm happy with quality - it took a little over one hour to assemble all 3 tables and they look great!", 
    "We were looking for something with an industrial style to use for a media center in our small family room off the kitchen. This table fit the bill to perfection. The style is great and it is very sturdy. We were impressed with how well it came packaged. All parts were there and it was easy for the two of us to put together. The best part is that is looks great!", 
    "This table was the perfect size for our small living room and fit the scale of our small couch. We also liked the style of it (wood/metal) so we went ahead and purchased it. The holes that are pre-drilled are not in the correct places and we had some \"editing\" to do to make this table work. If you aren't willing to do that, or want to get a table that's ready to go right out of the box, I'd skip this one.", 
    "Top looks mildly distressed, made out of a panelling kind of look. Not horrible but not as great as I expected.", 
    "The picture was exactly as the table looks in person. We were very happy with the price and quality. Very easy to assemble.", 
    "Great table and easy to assemble. The wood on it looks very nice. Also very sturdy, great quality.", 
    "This is exactly what I was looking for to complete my new living room :-). Easy to assemble. Great colors. durable quality. Hex wrench included for assembly. Overall I'm very pleased with table. I only wish they manufactured it slightly larger. But it will work!", 
    "Beautiful table. It came quickly, was very easy to assemble and looks great for the price.", 
    "The coffee table is attractive and sturdy. I'm using it to hold a medium size glass greenhouse. It was a little difficult to put together. Definitely a two person job.", 
    "As many other reviewers already mentioned - if you are looking for a distressed metal coffee table this price cannot be beat. The distressing doesn't look totally natural, but with the wear & tear it will get in my home, that will work itself out soon enough. One caution - although the assembly was quite easy, the underside edges of the shelves are rough and caused a pretty nasty splinter early on, so be careful. It is a good height (seems taller than most) and I love both the storage and the look.", 
    "Arrived early, well packaged. This a beautiful table, clean open lines. The color is more of a dark brown than grey. It fits into my small apartment living room with no bulk or fuss. One of the reviewers noted that the bottom self should be inserted first...THIS IS GOOD ADVICE....LOL! I was able to get the whole thing together with lining up the holes with the screws and then tightening them all at the same time. Its a sturdy, coaster- required piece, I would definitely recommend it", 
    "I just got this table yesterday, and it is very nice. It was heavier than I expected and was packaged well inside the container it was shipped in. It comes in only4 pieces; the table top, shelf, and two legs. It had 22 screws and took less than 10 minutes for me to assemble myself (I used a power screwdriver with an allen head bit - not the little allen wrench that it came with). I polished it up with some furniture polish and started using it. The distressing in the wood is pretty accurate to the photo but, the color is much darker than the photo representation, which is why I gave it a 4 out of 5 stars. I was really hoping it would be more like the photo color, as I was hoping to add some lighter pieces to my living space, but overall I am enjoying it. It is made of real wood, which was the reason I chose this product, I do not like veneered pressed board. If you are okay with the color being darker, you will love this table.", 
    "I was dissapointed about the color, I guess they call it grey because they get the weathered look with a grey dust over the brown. But I would never call this table grey, it is medium-dark brown. The quality is good and it looks wood but if you are looking for grey or light color this is not your table.", 
    "I have had this table now for a few months and absolutely love it. I just recently went into a boutique type store in my neighborhood and saw a very similar piece that was WAY more expensive. This piece is just what I was looking for - industrial and a good combination of metal and wood. The weight of it is great too because other inexpensive tables I tried had that hollow sound to the top which was an obvious indicator of the quality. The size is perfect for my TV room, which is on the smaller side and it goes great in front of my sectional sofa. I would definitely recommend this table to anyone!!", 
    "Overall I am pretty happy with the table. It has the reclaimed wood feel at a fraction of the price.The table is aged down manually to look old, which in some cases actually looked painterly. A white wash was added that I thought cheapened the table. But I put a coat of \"Restor-A-Finish\" (like a stain wipe) over the table and it rid the white paint marked areas and made it look a bit nicer.One of the pre-drilled holes on the under side did not line up, so one screw was unable to be inputted - but there are quite a few per leg so I'm sure it won't be an issue.", 
    "Bought this for my shore house after looking around becacue I wanted a distressed, relaxed table that people could feel free to put their feet on, but still looked good. Easy to assemble and dimensions are perfect. Very Happy and would recommed to anyone!", 
    "Perfect size for a small apt living room. Loved the look of the grey wood so I bought the matching side table. Great quality, easy to put together - love it!", 
    "This is a well made piece of furniture and have seen similar designer versions for much much more, if you are considering this, you will not be disappointed. It is true to color, size and apperance.", 
    "I read all of the reviews knowing that the wood resembled 1970's paneling, but I decided to order anyway because I loved the contemporary design and the size was perfect for my space. Also, because I needed a bottom shelf. I thought I would be able to replace out the wood with some better quality wood plywood panels, but when I received I found that the table top and shelf were attached to the metal and it would be a lot of work to replace. Yes the paneling does look a little cheap and is definitely on tan side, but I think you could sand it (appears to be real wood top?) to get out the grooves and whitewash look. It is very heavy and sturdy and it works for my living room.", 
    "I am glad I chose this coffee table - I like that the wood is more of a light/medium brown (the pictures looked gray to me). Think the natural looking wood balances well with the contemporary metal frame. The table is surprisingly sturdy and I had trouble carrying the box up to my apartment by myself. Assembly was pretty quick and self-explanatory. The only caution I would give is that the table came with a couple of nicks in the wood - which I don't mind as I think it adds to the reclaimed look, but others may not appreciate.", 
    "This is a cute table, but watch out for the quality of the legs. I had to have 2 new sets of legs sent out to me because the first set was scratched and the second set was not built to square. The company was great to work with and I did eventually get both legs I needed in good shape.", 
    "Nice style overall. The wood is more yellow in person than in the picture, but overall these were easy to assemble and have held up well over the past year.", 
    "This is more tan than great but other than that it is exactly what I expected. Perfect for our family room.", 
    "Looks good in our living room", 
    "This table is sturdy and has great style.", 
    "great, quality, timeless design, it goes well with all furniture in the house.Not too difficult to assembly, just follow the rule of having all your bolts loosely tithe than when is fully assembled you tithe them all. Great quality pictures are loyal to the real thing.", 
    "I bought this for my living room and it looks terrific. It came quickly, took about 5 minutes to assemble, and has held up great. It looks fantastic in my living room. Simple yet pretty!", 
    "Great table, heavy base- which I love. It was easy to put together and a great price!", 
    "Love it! Traded in our chunky clunky black MDF coffee and side table for this set. Really helped lighten the room and make it much more airy feeling. Good heavy wood, tables are surprisingly heavy for being so open, but in a good way. One complaint on the side table the metal was ever so slightly bent so when I was putting together, one screw popped back out, but it doesn't affect the stability and can't visually tell. Overall my husband and I love them. Great purchase!", 
    "Great table. We bought it for the family room. My daughter put it together in about 15 minutes! It is sturdy and a good price!", 
    "This is a great table !!! Looks great! Looks way more expensive than it is", 
    "If you are looking for the table in the picture... this is not it. It is a terrible orange/light brown colored wood. Seems to be old house siding or something as others have said... it's just a piece of wood with some shallow grooves cut in it. That would probably be fine if it wasn't so ugly. Not like the image at all. The photo on this site is completely dishonest. Not what you get at all.", 
    "Love this table. We've had it for over a year now and it looks good with everything we own. Great purchase!", 
    "Ordered this coffee table thinking it would be of a gray/brown wood tone... But it's orange! Returned the item.", 
    "Looks great, and fits nicely in our small sectional sofa. Pretty easy to assemble, though the pre-drilled holes didn't line up exactly.", 
    "I have had this table for over 5 years and it is still in great shape. A wonderful buy from overstock.", 
    "Only opened the top of the box to see the top of the table, made with what looks like cheap wood paneling and in person is more of a yellow shade of wood rather than grey as it looks online. Shipped it back.", 
    "has good weight, can take some abuse, in rental unit, still looks brand new. easy to clean", 
    "do not be fooled by this picture. The table is YELLOW PANELING, not gray and beautiful recycled wood, Ugliest thing I have ever seen! Put together and staying because its to much hassle to send back. Small very small DO NOT BUY THIS!!! DO NOT BUY THIS!!! RIP OFFFFF!", 
    "Nice and the industrial look--the 70s paneling on the tops was a bit of a surprise--would have been better as a solid service instead of looking like imitation cardboard.", 
    "I was looking for a smaller footprint simple design table and this fit the bill. It did not come with directions but was simple enough to put together. As one other poster mentioned attach the bottom shelf first then it's a breeze to turn it over onto the top shelf and attach and then tighten all the bolts. The color is a hot more of a yellow-ish brown hue vs brown/grey not the end of the world for me as I'm handy with paints and stains and will work on it to give the color more character. My only really negative comment is that it looks more like 1970's paneling from your grandmothers basement than it does reclaimed wood..though I suppose you could say you reclaimed it from the basement lol. I figure the paint or stain work I do on it will help hide that a bit. That said, great price and nice look", 
    "Perfect adition to my sun room the top is a wahed out oaky, giving it a beachy look. Very nice", 
    "I expected this to be a grey tone wood, but it was a mustardy gold finish and did not go at all with my rustic décor. Sent it back.", 
    "Unfortunately for me, I picked this table for the price and look (I wanted a grey coffee table) but the color of the wood is much more of an orange birch with some very light white stain on it. The color is significantly different from what is shown in the sample pictures. The table is easy to assemble but not all the holes lined up for the lower shelf so I only used 4 out of the 6 screws. It's not wobbly but I think a basic requirement is that I can fully assemble the piece. Price is good but overall I was disappointed with this purchase. I recommend Overstock update their pictures for this product or otherwise put a disclaimer on the page saying there could be color variations on the wood. I would not recommend this product to a friend if they're looking for a grey coffee table.", 
    "This table looks nothing like it does in the picture. First, the color is entirely different. Instead of grey/brown it is orange. It looks extremely cheap and the quality is poor. If you want the coffee table in the picture, do not order this. Not to mention, if you are unhappy with it, it is a major PAIN to send back...and you must get store credit instead of a refund unless you want to pay $30 in shipping costs. Very disappointed.", 
    "The picture is misleading. The color is more tan than grey/brown.It has a distressed look which comes off as cheap looking.", 
    "This cocktail table is the perfect size for our condo. It would be great for an apartment also! Easy to assemble!", 
    "Very nice and sturdy coffee table. It is a perfectly sized and substantial piece of furniture. Very easy to assemble (about 10 min). I would recommend using coasters under your beverage glasses or maybe applying a coat of a water-based satin poly.", 
    "Great coffee table! Easy to put together and it looks fantastic. It is made of solid material that will last.", 
    "The color wasn't what I expected but that happens when you purchase online sometimes. I wasn't happy with the overall look and quality of the table so I returned it.", 
    "We loved the style and dimensions of this coffee table, but we were so disappointed when we received it. The color was a weird tan/brown and NOTHING like the picture. Such a disappointment!", 
    "The color of the coffee table (wood) I received is not what is depicted in the picture. The Elements Ladder Shelf is the color I received. This coffee table looks to be a grayish-brown wood, whereas the one I received was a lot lighter and more maple looking.", 
    "Great piece for a great price. I would say it is more brown than gray. It's sturdy, and low maintenance. We are really happy with it.", 
    "It took me about a month to get up the courage to purchase this coffee table. After reading some of the reviews I thought it was going to be terrible but it's not. It's a great little industrial looking coffee table with 2 tiers in the perfect smaller size which is EXACTLY what I was looking for. We converted our old dining room into an office/ sitting room/ library and there was not a lot of room for a coffee table yet it was most definitely needed. It really brought the room together. I had done a tedious search given that the dimensions needed to be smaller. Most coffee tables are much deeper and wider. I can't believe that someone complained about the size of this. It's clearly stated on the website. No need to give a crappy review just because you forgot to measure. How ridiculous. Anyway, I love it. It's great for styling with books and the like and it added a ton of style to my room. If you price similar ones, this is a bargain. Yes, I would purchase it again in a heartbeat.", 
    "Great little coffee table. It looks well-made. It seems sturdy and was easy to put together.", 
    "Product arrived just as described. Perfect fit in a busy household.", 
    "I love this table. Even the blizzard two days before didn't get in the way of the delivery. My satisfaction level with the product and Overstock is at 100% keep up the fabulous work.", 
    "I agree with previous posters that the wood material is slightly reminiscent of wood paneling. However, the overall aesthetic is good and it fits well in our modern living room.", 
    "I was looking for a small coffee table since I live in NYC and we all know how small the apartments can be. In addition, I make a decent living, but when you're starting off after college you just want some decent furniture at a decent price. Enough about me... the coffee table was pretty spot on for what I was looking for. I'm happy with my purchase and it fits in with the other wood products I have in my apartment. If you want a large coffee table for a house and don't pay over half your income in rent, you may want another table... unless your looking for something to fit in a small room. You can't beat the price for a small table on a budget depending on the look of your apartment. I'm satisfied with the table... until I can afford Pottery Barn or Crate and Barrel :)", 
    "This is a great, small size coffee table with the perfect 'worn' look!", 
    "This is an OK table. It looks much cheaper in person. It has these \"weathered\" marks on the table but they are done so badly it really cheapens the table. It's the exact same 2 line scratch mark placed in the same spots of both surfaces, it's ridiculous looking. If it wasn't for those, the table would look much better. As for the color, it is not grey, it's more brown. The table arrived damaged but Overstock sent us another one. Though they didn't pick up the damaged one so we had to get rid of it ourselves. We bought this for our living room but will be moving it to the basement, it's just too cheap looking.", 
    "It is a beautiful table, my wife and I wanted a nicer one compare to what we had before (an ikea one), and we are happy with the purchase. It is easy to assemble, actually my wife did not herself without any help. The delivery was amazing, it did not take more than two business days to receive it. We could not believe it.", 
    "Very nice furniture. Good Quality. easy to ensamble. Very satisfied", 
    "I looked everywhere for a table that was smaller in size and not dark brown, I had no luck. Everything was either too big, or too expensive. The table style is very nice and the quality seems very good. It was easy to put together, I didn't follow the instructions though. I leaned the bottom shelf against my desk and put the legs on, the laid the table top down on the packaging and attached the legs to it. Then I just turned the whole thing over, this seemed to work fine for me. Overall I am happy with this purchase.", 
    "The wood is more brown than gray, and the metal parts are also a but more brown than gray.The quality is good for the price and style and comprable to higher end furniture. Easy to assemble.", 
    "I bought two of these tables to put together to make a large coffee table. I love them! Great quality and easy to put together. I love the rustic look of the tables and they go great in my living room.", 
    "This coffee table has an awesome worn, vintage sort of look to it, while still appearing new. The metal is sleek and clean but the wood top looks like it came off an old pirate ship. Basically, it's awesome. The metal screw-together construction makes it super sturdy, and the size is perfect... adequate space for in front of a couch without dominating the floor. All in all, couldn't be happier with this thing. It rocks.", 
    "Great coffee table for the price - we were just looking for something basic and this looks great in our living room. No need to spend $400+ on a coffee table. Easy to put together, light weight. Would highly recommend.", 
    "Besides the color, good. It's definitely brown, not gray. Also, be sure to look at the measurements. Much larger than I thought it was going to be.", 
    "I was trying to recreate a room I saw in Ethan Allen's and this table is very similar to a *** one. Has a rustic, vintage look I was going for. Couldn't be happier with the purchase, great price!", 
    "Great coffee table. Came promptly, cheap shipping, easy (very) to assemble. Looks great.", 
    "Love the table, easy to put together. Has a very rustic, understated look- spills easily wipe off. Not too big for 1000 sqft house.", 
    "Really pleased, I had looked for over a month and just kept coming back to this piece. We needed a smaller scale coffee table and this one was perfect. I would suggest getting a tape measure out to look at the dimensions before you buy it. It is hard to tell the size of it from the picture. We had purchased another table from a furniture store that was similar and returned it because it rocked back and forth. This one was allot less expensive and very sturdy, no problems with it shaking or rocking.", 
    "A very cute table at a reasonable price. We've had for a few months and it has held up very well. Also has received a number of compliments. My only complaint is that the wood top came a little scratched. It somewhat fits with the reclaimed look and isn't too noticeable, but you can tell that these scratches were unintentional and due to poor packing.", 
    "When I received the table, the box was really damaged. There was a small box inside that was supposed to have 22 bolts and an allen wrench inside (according to the included directions). That box was ripped open and empty; it looked like a used box had somehow been sent instead. I did find 13 bolts scattered through the rest of the large box, plus 2 superfluous different style bolts that (again, according to the directions) I am not supposed to have. There are 7 scratches on one table piece, and 6 on the other. It really is a beautiful table, and I know I will enjoy it once I get the missing pieces and can put it together.", 
    "We love this table set! It is sturday and industrial looking with a nice modern flair. The color of the wood lends itself to many decor colors.", 
    "I wanted a very expensive Ballard Designs coffee table, but didn't want to pay so much. This is almost identical to the other table, and half the price. It is very good quality. My daughter spilled water on it and we didn't notice for an hour, and it wiped right off. No water damage. I love this table!", 
    "This is a great table for the money. It is well built and very easy to assemble. It is exactly the look I was looking for!", 
    "We got this to use with the new sectional and will end up using the table as a TV console as it fits perfectly in the space where the built in was to go. We will get something else as a cocktail table. Nice product overall.", 
    "This table is perfect for our earth-toned decor and greyish beige family room. I put beeswax on it as soon as I got it and haven't had any problems with it. I don't worry at all about my 18-month old messing it up.The only thing is the sharp corners were a concern, but you'll have that with any rectangular table with corners. We get lots of compliments on this table and the price is great.", 
    "For the price, this is a great find. Similar looking styles go for triple this cost. However, the title is completely deceiving, as there is nothing \"grey\" about the table. There wood has need stained a rich brown, with an almost frosted/weathered pattern covering the top layer. Up close, this pattern looks cheap and very unnatural, but from a distance, it's totally fine. The table is small (as the dimmensions show), but it was simple to put together and seems pretty sturdy. (NOTE: don't screw the top shelf to the frame completely until you have secured the second shelf. despite what the instructions say!) Because of the petite size and very artifical \"weathering\", I don't think anyone would guess this were a very expensive table. Overall, I'm happy with the purchase and think it's a decent copycat of the expensive reclaimed wood/metal tables.", 
    "Solid, nice cocktail table. Great size, sleek lines. Shelf is a bonus. Weathered wood top.", 
    "A decent table for the money -- well-built and attractive. Manageable size. Wood appears to be engineered and has a repeated pattern that mimmicks a \"distressed\" or \"hand-scraped\" look -- not authentic, but for the money, it's decent. A great budget buy.", 
    "We purchased the coffee table with shelf and sofa table with shelf to replace mismatched furniture in our living room. The tables fit in very well with our casual style (leather sofas, jute rug, brick fireplace, some weathered/antique pieces), and they also have a very clean, uncluttered appearance. We really like the greyish-brown weathered look of the shelves. The assembly took only minutes (screws, bolts, allen wrench), the pieces are sturdy but not too heavy, and the packaging was very good - nothing disturbed or bent during shipping. We use the coffee table as a TV stand for a flat screen TV - the bottom shelf holds the other components well (the cords were easy to hide to one side). We did not want a bulky, heavy looking TV stand and this works perfectly.", 
    "I'm not absolutely IN LOVE with the table, but I like it a lot. I have been casually looking at coffee tables for about a year now and I found myself returning to look at this style. The price is reasonable compared to Ballard Design which has one very similar...and not to mention awesome shipping! I would LOVE this table if it was about 2 or 3 planks wider. We have a large living room with large furniture and the table looks a little small for the space.", 
    "I am a fan of *** furniture, but not a fan of their prices. This is a great piece and an amazing value!", 
    "Sturdy, well made and easy to put together. Overall a superb coffee table.", 
    "the bottom shelf was a bit damaged but we go it replaced and it is great", 
    "This table, and a few other purchases have made me a big fan of overstock. The table looks very antique. It could go well in a couple different types of room.... my apt is very industrial looking and it goes great. There are a few little \"dings\" in the piece done on purpose that are a little too perfect to look natural, but once the table is accented with your coasters, centerpiece, etc, you will not even notice.... I just had a cocktail party and my friends complimented it several times.", 
    "Many seem pleased withi this table. Mine is less gray, more brown. And once assembled, it wabbles. Arrived quickly but otherwise a bit disappointed.", 
    "The product was easy to put together, stable and an excellent value.", 
    "Very well wrapped and delivered and made with quality components or so I thought... not even a couple of moths after putting it together the shelf cracked all the way... I know it is made to look old but not broken and no, the crack does not make it look more authentic. Really disappointing!!!", 
    "I got the coffee table with shelf and matching end table with shelf and am very pleased with both items. They were easy to put together and are very heavy and sturdy. Wish the coffee table was a little bit bigger but thats all. They look great!", 
    "Absolutely wonderful piece. Easy to install and you dont have to worry about maintaining it.", 
    "I received this within 3 days. Which in itself is amazing. My concern was that it would not be color accurate and perhaps seem or feel a little flimsy. But its actually really sturdy and it really feels like a reclaimed wood piece almost. Feels a bit industrial too. The color is spot on and the whole thing just looks awesome, Im super happy so just ordered the matching side table to. You can't beat that price. The only thing I'd say is the instructions are backwards, it says to put the top shelf on before the bottom and that makes no sense at all. Bottom first, then top. Easiest assembly ever. Though note that package is pretty dam heavy to lift alone."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Elements-Grey-Brown-Coffee-Table-with-Shelf/5217961/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5217961/Elements-Grey-Brown-Coffee-Table-with-Shelf-5d808fd7-2bcd-4c1f-a0d7-e570be007b87_600.jpg"
  ], 
  "description": "Enjoy a solid and durable place to rest your coffee cup and put up\nyour feet with the gray brown coffee table from Elements. Made of\nsolid oak wood and metal for durability, the table features a lower\nshelf to store books, picture frames and other decorations. With a\npowdercoated, weather-resistant finish, this table is sure to\nwithstand long-term use as a cocktail table in the den or a coffee\ntable in the living room.Constructed of solid reclaimed oak wood and metal for\n  durabilityFeatures storage shelfNon-mar foot glides protect your floorsFrame is powdercoated with a grey-brown weather-resistant\n  finishMeasures 18\" H x 42\" W x 20\" DStyleContemporary, RusticMaterialMetal, Oak, Reclaimed Wood, Steel, WoodTypeCocktail Tables, Coffee TablesFinishGrey Finish, Oak Finish, WeatheredShapeRectangleAssemblyAssembly RequiredColorBrown, GreyFurniture Frame MaterialWood & MetalFurniture PatternSolid"
}