{
  "name": "Emerald_Chandler_Reclaimed_Wood_Cocktail_Table", 
  "price": "EUR 256.65", 
  "reviews": [
    "I love this table. It's sturdy and gorgeous - for the price, you won't find anything better. It was pretty easy to put together despite the fact we were missing about 75% of the hardware needed - but a quick trip to ********* and $5 later we were ready to go and had it together in about half an hour or so. Totally recommend this piece to anyone who wants a rustic-look on the cheap. As a side note, which is probably limited to my experience only: the box was damaged badly during shipping. Thankfully there was no damage to the product itself and overstock's customer service were all over it to make sure everything was ok. I really was very impressed with their initiative to follow up with me. I first posted a tweet with a picture of the box and within 5 minutes I had received a phone call and an email about possibly needing to return the product etc. If you have any qualms about ordering online, rest assured the overstock customer service team is super helpful should anything go wrong.", 
    "This is a bit smaller than most coffee tables, so it's a good fit in our small old house; and the shelf makes it more functional since we often have piles of books to stow. The shelf is also a nice place to put your feet up.It looks just like the photo, except the finish is somewhat different - it's a slightly darker brown with a very slight touch of gray/green to it, and a satin surface. The metal legs are a similar but more of a darker bronze color. It looks good to me and goes fine with the mix of stuff we already have.It's made with real wood planks, not plywood or particle board or worse; the instructions say it's reclaimed wood - and it could be since there are some small random holes and the surface isn't perfectly flat (but that adds character).It's fairly heavy and sturdy feeling and was very easy to assemble.Lost one star because the nuts and bolts were loose in the box (the little bag they were in had a hole), and because it smelled of drying varnish for a few days after we put it together, and because the cross-pieces on the underside of the shelf have sharp corners that might hurt a bare foot poked under there (you could sand them a bit to fix that).", 
    "Table legs should be made from a thicker gauge steel. the table is shaky...very disappointing!", 
    "Cheap, poorly made table. Wobbles like crazy!", 
    "This is a fantastic table for a terrific price. I can't understand those who write in their reviews that the table is not sturdy...idiots who can't use a simple hex wrench..tighten the bolts all the way people!!!! don't be afraid to use a little muscle. It took me 10-15 minutes to put this table together then I WALKED on it and I'm a 6'1\" 250 lb bodybuilder!!I have a gorgeous home and am fanatical about my furnishings. I have several other beautiful reclaimed wood pieces that cost me thousands of dollars yet this simple affordable table which i use in a sunroom extension to my kitchen gets SO many compliments...a great deal!!! Im buying the end tables next...", 
    "Bigger and classier and more substantial and expensive looking than the picture can show. I get many admiring compliments and I felt like a shopping champion after I pulled it out of the box. Made me want to pop a champagne bottle. It's awesome.", 
    "It was extremely easy to put together and took me less than an hour. It is absolutely beautiful. I was a little worried that my decor wasn't rustic enough, but this table seems to match a lot of different styles anyway. It's only 60 lbs and, again, an easy assembly. Not that I'm big, but I practically jumped on it to test out the wobbly comments other reviewers had made, and it seems perfectly sturdy. A really great buy for the price!", 
    "I get so many compliments on this coffee table. Everyone loves the reclaimed wood style! The item is just as pictured. My only complaint is that I have the table on a jute rug and it seems to be rather wobbly despite trying to adjust the legs.", 
    "Great table, sturdy enough where you can put your feet up. Great purchase, definitely looks more expensive than what it was.", 
    "I found this table after months pining over a $700 table in a PB catalog. So happy I bought this instead. It is incredible sturdy, looks great and took less than 10 minutes to put together. The first one I ordered was damaged in shipping, but Overstock customer support was excellent and shipped me a new table right away. The new one that arrived was perfect. I do think my table is a little darker than what is pictured, but I expect a little variance when you order a reclaimed wood item. This was exactly what I was going for in terms of style and quality -- at a fraction of the cost.", 
    "This is an incredibly beautiful table. It is surprisingly sturdy as well. Would definitely recommend this table to friends and family.", 
    "I love the look of this table but it the legs are poor quality. The table shakes every time you touch it or try to put a cup on it.", 
    "I was hoping for a smooth-surfaced coffee table, so a reclaimed wood piece was probably not the best way for me to go. Assembly was not difficult and the overall look is great - a really nice blend of some rustic and industrial that would look great in either style room. Because it is made with reclaimed wood, the tabletop surface is not flat and smooth, so it will not work for puzzles in our game room, but it's perfect for drinks, etc because the planks are wide and there is plenty of flat surface, just not a completely flat top. It's a gorgeous piece that is a conversation starter when people see it.", 
    "I'm very happy with this table. It was the perfect size for my living room and complimented the industrial loft style I was looking for. The price was great because normally the reclaimed look is really pricey but I thought the price was very reasonable. Every time I walk by it i'm pleased so I know this was a good buy.", 
    "Unbelievable deal for a table that would cost 4x as much at a designer store. This is a beautiful, sturdy, and high quality table that will add great design to any room. Highly recommend.", 
    "Great table with a wonderful profile. I purchased this for a salon reception area, the smell was a bit strong upon opening the box yesterday, but it has dissapated today. the customers love it and many have inquired where I bought it from. Easy to assemble and strong base. Hopefully it will hold up to a busy salon and high traffic guest usage well.", 
    "This table looks great and was easy to put together. Great value1", 
    "This beauty is truly gorgeous! It was well worth what I paid for it! Love the feel of real wood which is rich with texture and color!", 
    "I purchased this for my modern log cabin decor ~ it's exactly the size and \"rough\" rustic look I wanted. Very easy to assemble. Sturdy and very well made. Nice having the lower shelf too. Keeps top display uncluttered. Love it.", 
    "This table is awesome and also very sturdy. I had a professional put it together, perhaps that's why mine is so much sturdier than other reviewers? It looks more expensive than it is, we are very pleased.", 
    "We were initially concerned that this table would be too short for our living room, but it's a perfect height when placed in front of our average couch. It's easy to assemble and because it's reclaimed wood and a little rustic, it looks great with the other different shades of wood in the floor and other pieces of furniture. Highly recommend.", 
    "I love this table. It was super easy to put together and, to me, it looks just like the picture. Yes, the top is uneven but I like that. I read some other reviews and they said the legs are flimsy but I don't find them to be. Good table and a great price! I liked it even better when I saw it on another website for $$$ more ;)", 
    "You must be desiring a rough finish for this one. Very nice looking and sturdy", 
    "This is a very solid table, easy to put together and sturdy. Beautiful refurbished solid wood. It was exactly what we were looking for.", 
    "Sturdy, stylish, and practical. Super easy to put together. We've been browsing coffee tables for about a year and just couldn't find the style we were looking for at an affordable price, until we came across this gem. Love, love, love this piece. Great buy.", 
    "This is a lovely, sturdy coffee table. The imperfections and variations in the wood add warmth and character...exactly what I was looking for. I have already gotten compliments on it. It took me about an hour to put it together by myself. If you have an extra pair of hands, it will take an even shorter time.", 
    "Love it!! Overall good quality for the price. Was going for the industrial feel. Nice and sturdy on carpet floor. Easy to build.", 
    "This table is so so wonderful. It is truly better than I anticipated it to be. It has rich color and the awesome rustic feel that I was going for. I would highly recommend this table.", 
    "I love this table! You will not find a better table for the price! Easy to assemble and looks great! Very happy with this purchase!", 
    "The quality of the table below is not so good.", 
    "it just comfortable table", 
    "I love this table. It is sturdy and has a beautiful rustic charm.", 
    "This is a great table! This table is awesome! So worth the money I paid for it. It was even better than I thought it was going to be. Nice and sturdy. Real rustic looking wood, made very well. So happy I bought this.", 
    "I love it so nice very good quality and ties the room together", 
    "Great table. Just as pictured.", 
    "Love this table! Not even on the top, but the wood is beautiful. Get so many compliments - ordered the side table and coach table (use as tv stand) and love the set - they match, which I was concerned about - but all look great together!!!", 
    "Sturdy, easy to put together. REALLY GOOD DEAL. Love it!", 
    "Though the picture looks darker than the actual table....it is still a beautiful piece. Very easy to put together...1,2,3, and you're done! Wish I could find a matching dining table", 
    "This photo does not do the actual coffee table justice! I am in LOVE! I must let you know this is REAL wood!!!! It's perfect, heavy and sturdy. I actually stood on top of it and I weigh 155 lbs!", 
    "Beautiful coffee table! We love it!", 
    "The Cocktail table and end table were purchased for a Vermont ski house. Lots of reclaimed wood in the decor but we were running out of budget and had to cut costs. Found these items and are very happy with the quality. Very well packaged, sturdy wood, easy to assemble, tools included. The reason for 4 starts.....not made in America. Otherwise, this is a great purchase for the price.", 
    "It is much sturdier than I expected. The wood is beautiful.", 
    "I bought this coffee table, and I am so happy with it. I'm always getting complements about how pretty the table is.", 
    "Easy to put together, surprisingly sturdy, looks great with other \"reclaimed-looking\" furniture. Very satisfied.", 
    "This table is perfect size for my living room. It looks great. Very easy to put together. It is well made, very sturdy, solid wood. I have a dark leather couch and dark wood flooring and it is perfect contrast.", 
    "Fairly easy to put together, real wood. All in all very pleased with the quality of this for the price.", 
    "Easy to put together, but a little bulky for one person. No problems though. Love the look, the style and sturdiness!", 
    "Item came in a timely manner, well-packed, and easy to assemble. It is sturdy and looks great!", 
    "Love it! Sturdy, real wood table at Avery reasonable price. Looks great in my living room. The matching end table is also great.", 
    "Love my coffee table. Very simple to assemble and looks exactly as it does in the picture so no surprise when you get it. Great to suit a rustic style!", 
    "we have bought all kinds of furniture from many different places over the years, and have had some real junk. The end tables and coffee table we purchased here were very sturdy and well made for the cost. It took some time to figure out how to get the wood pieces in place because the directions were very minimal - but that was probably only due to WHO was putting it together! We're not the best at assembly, but overall, great product.", 
    "Very happy with this table. Exactly what we were looking for. Easy to assemble and very sturdy.", 
    "Assembly was very easy. Table looks great. Everyone who sees it comments how beautiful it is. Fits perfectly in my living room.", 
    "Very happy with my purchase", 
    "I love the weight, feels more expensive than what I actually paid. The wood finishing is beautiful. Highly recommend this table if you're into the rustic/farmhouse look.", 
    "One of my favorite furniture purchases. Such a great addition to my living room! Found in few other sites but wasn't ready to dish 2x the price. Came across it on overstock for such a great price I couldn't pass it up. Unfortunately they forgot to send the nuts and bolts but credited me for it and I was able to make do with parts from lowes.", 
    "sturdy structure. hard wood with a vintage look. not difficult to put together. surface is a bit on the narrow side but big enough for our apartment living room", 
    "This is a great table. Surprisingly it's actually made of slabs of wood, not some sort of wood-like substance. Unlike some other reviewers, we found it to be very sturdy and all of the hardware was present and accounted for. Only took a few minutes to assemble. We love it!", 
    "BEAUTIFUL table!!! Wonderful addition to our frog. Literally took 5 minutes to put together. Love reclaimed wood. If you're looking for an original table this it it. I also purchased two matching end tables. Compliments every time someone walks in the room.", 
    "My daughter loves it for her college apartment. It has a \"reclaimed\" wood look, its very sturdy and a great value for the price.", 
    "The table looks very nice. I'm particularly happy to find a product that is real wood rather than MDF with veneers.", 
    "This table looks so much better in person. Very pleased with it and very easy to put together .", 
    "I'm in love with this table! The wood is beautiful and the table is sturdy. I was afraid it would be flimsy because of the price. Definitely fits the rest of my decor.", 
    "A very sturdy well built table. Beautiful reclaimed look. Looks perfect in my living room", 
    "Love this table. It is heavier than I thought it would be and looks great in my family room. Definitely a piece that is suitable for kids.", 
    "This table is exactly what I was looking for, and you can't beat the price. Love it!", 
    "Beautiful table easy to assemble", 
    "I'm a big fan of reclaimed wood furniture and this piece is excellent.", 
    "Exactly as it looked online,If not better. I am very happy with this purchase and was easy to put together!", 
    "This was my first experience with overstock I bought this table for rental property .we loved the table almost didn't want to leave it there everything was perfect the shipping the table the whole experience", 
    "Arrived a few days ago - packaged well. Took box apart - no missing parts - no damage. Put bolts in manually, then tightened w/allen wrench. Left other side a little loose as suggested by another reviewer so there is play to get lower shelf inserted. Once that was done, just tightened the remaining bolts and put table in place. Took about 20-25 minutes from start to finish. Color is very close to picture w/very light poly type finish (low shine). Wanted rustic to blend with my This End Up pieces. Works very well & love that it is wood. If you want a rustic casual look - this is perfect. I have a mix of southwestern and casual and this fits right in. This is a solid piece & should last for quite awhile.", 
    "Sturdy, easy to put together, looks great, all I wanted, highly recommend.", 
    "Love it! Great piece for the price. Sturdy and easy to put together.", 
    "Bought for my son and he says that this table is absolutely beautiful! He loves it.", 
    "It's a very nice table and great value. The thing to note is that it's not a complete smooth surface because it's reclaimed wood, but it looks great. Also just a tad wobbly, but it is still pretty study.", 
    "love love this ..it goes perfect with my brown tufted leather sofas.", 
    "This table is perfect for a living room coffee table. Easy to put together, and good quality. Gets a lot of compliments!", 
    "Well detailed. Some oddly placed holes on the sides of the table but it functions well as a coffee table in our very basic loft style.", 
    "Very sturdy, 2 levels, fits great into my modern living room, environmentally friendly, easy to clean", 
    "I love the look of the table! It's finished beautifully and looks exactly how it's pictured! This is the second time I've purchased a piece of furniture online and have been extremely satisfied!!", 
    "Stylish, sturdy, well-made, easy to assemble and it arrived in 3 days. Incredibly pleased with this purchase!", 
    "This was delivered pretty quickly after placing the order, and the actual piece looked exactly as assembled. I got compliments from my guests about this item.", 
    "Wood is solid, great finish and looks very attractive. It was very easy to assemble and once assembled very sturdy. For the price it is an excellent value. I will likely buy a second table for my boys man cave because it looks like it will take the rough use and still look great.", 
    "Love this table so much. Excellent buy and will have it forever!", 
    "the only thing that would make this table better would be a lift top! love it though. smooth top and shelf on the bottom is great. looks sharp with the rustic decor look in the house.", 
    "Easy to assemble, very sturdy, nicely rustic-looking. Exactly what I wanted.", 
    "Love this table! Easy to assemble and looks just like the picture. Very happy with this purchase.", 
    "What a beautiful coffee table, well designed and made, the reclaimed wood was preserved to it best natural color, very sturdy, easy to put together, thanks for shipping this table to Hawaii, it worth every dollar we paid for shipping here, We love it.", 
    "Exactly what I wanted it to be!", 
    "I was looking for an affordable option for a reclaimed wood coffee table, and this definitely fit the bill. It looks really nice, is sturdy, and is a great size - all within a good price point. It was also super simple and quick to put together.", 
    "Looks great and is very sturdy !", 
    "Nice table for the price. It smelled like chemicals when I first opened the box, but maybe it was the packaging. Thinking about getting the end table to match.", 
    "We love this table. It is exactly as we pictured it. Easy to assemble, sturdy, and of good quality. We are happy with the purchase.", 
    "It's a great looking table. Very study. However, the wood does emit a foul odor. I've had it for a week and it's still not gone.", 
    "I love Etsy. I really do. But, when you're trying to furnish a place in a hurry, waiting 2-3 weeks for custom built doesn't work so well. This table was one of my solutions. Nice look, great price, fast delivery. And, a big hats off to the reviewers who tipped us readers off to putting the legs onto the lower shelf FIRST, unlike what the instructions say. After that, easy-peasy.", 
    "Well priced, very sturdy, Easy to put together.", 
    "So the table arrived in a timely manner but without a single screw or washer to assemble it. A quick call to Overstock didn't really help since they couldn't tell me whether the hardware would at any point be available so, thanks to my handyman we got creative and simply moved the legs over a few centimeters and drilled new holes. So, unless you happen to have a professional handyman in the house or large drill bits on hand, be prepared... Quality control is not what it once was. The table itself is fine. Rustic looking. I do wish it were a tad darker but I can live with it.", 
    "Beautiful cocktail table for a great price. It's the perfect addition to our living room and we are so pleased with this purchase.", 
    "Easy to assemble; after using it for several months now I can say it has held up wonderfully and remains sturdy and solid. Looks great too!", 
    "Really happy with the table. It was easy to put together and it looks great!", 
    "Really great table, goes well with my other items. Looks expensive.", 
    "Very sturdy and great quality for the price. we love it", 
    "Such a great table. Easy to put together too", 
    "This is a sturdy, cute, solid table. Assembly was easy!", 
    "Live this table , perfect size for living room , beautiful finish", 
    "Sturdy, rustic and functional. Love this table! Easy to assemble.", 
    "The coffee table is pretty once assembled. It is slightly smaller than I expected, but fits perfectly in my informal living room.", 
    "Easy assembly, I love the distressed look", 
    "Love that it is solid wood and well-constructed. Purchased for our cabin with a rustic modern design theme and we love it! Will use coasters but the top seems durable.", 
    "Love this table! It really does look beautiful and was pretty easy to put together. I do question whether it is actually reclaimed wood vs. wood that is made to look like it is reclaimed wood? But either way, it looks great.", 
    "Excellent quality. Super easy to put together. Constantly get complements on it. Love the reclaimed wood.", 
    "Looks very nice in the living room. very easy to put together. very heavy duty Reclaimed wood.", 
    "This is a great table, it exceeded my expectations. Easy to assemble.", 
    "It's beautiful, sturdy and rustic and we get tons of compliments on it.", 
    "We love the look of this table. It's rustic, and appearance is consistent with pics on the site. The only thing about this table that I'm not 100% happy about is that it has a little wobble to it. The way it is designed, there is naturally some side-to-side wiggle. It's mild, and not a deal breaker for us...but if you are looking for something super-sturdy I'd look elsewhere.", 
    "Great table! Love the style. Simple to put together, I did it myself. It's sturdy, and well worth the price.", 
    "Exactly what I wanted. Looks great, quick delivery, easy assembly (although the screws were all over the box and I had to carefully dig through packaging). Great value!", 
    "The table looks just like the picture, maybe a tad bit darker. It only came with 12 screws so it's not labor intensive, took me about 20 mins by myself to put together. If you tighten down the screws it will not wobble. Very sturdy. It looks gorgeous in my living room. I like how it is heavy duty and made of real wood. Definitely a conversation piece. Not like any other table I've seen. Will be buying the matching end tables in the future.", 
    "great value for the money", 
    "We get so many compliments on it. It's sturdy, relatively easy to put together, and is a great statement piece in a living room. Perfect balance of rustic and cozy. Very happy with this purchase!", 
    "Good table very rustic for a cabin", 
    "Perfect coffee table for my home. Goes with all my other furnishings and recent is a great accent piece for the room. Easy to put together, too!", 
    "A little lighter in color than pictures but overall this is a great product for the price. Looks very stylish.", 
    "Absolutely love this piece. Loved it so much that I bought the other pieces by this same company", 
    "fantastic price, pretty easy to assemble.", 
    "The table is really nice! At this price point, I am really happy with the quality and looks. Very easily and quickly went together and has a nice smooth finish on the top (I was worried it may be rough).", 
    "I have had this table since late summer in our family room and I love it! It is nice and solid and has held up to my kids and my husband. I don't use coasters and there are no marks on the wood. I really like the rustic style.", 
    "Great looking and great quality for the price! We have a little bit of a industrial look in our apartment and this piece fit right in!Its a little heavy. nothing negative really to say about it!", 
    "Love this table. Very easy to put together and very sturdy. I always receive great compliments on it!", 
    "This table looks awesome! The wood is great quality and it was very easy to put together. It's not totally flat, some boards stick up a bit, but I like that about it!", 
    "This table has a really nice look. For the price it sturdy enough, I would not put it in a frequently used room, or a room where young kids are a lot. I think it is a good table for the price and look,", 
    "It is sturdy, quality table. I do not agree with other negative reviewers. It is not quite the design or quality of C&B and alike, but very close, and the price more than compensates for it.", 
    "We are in LOVE with this table!!!! It has a rustic feel with the distressed wood top and the metal accents also give it a little industrial feel. Everyone who has come over has commented on how much they love our new table!", 
    "Well constructed. Table top looks nice and is thick enough to stand on. I ended up buying the whole set. Took 15 minutes to assemble.", 
    "Better than expected. This piece looks fantastic in my living room. Just gorgeous. This was a great buy!", 
    "I was pleasantly surprised by how heavy and sturdy this coffee table actually it. Real wood. Fairly easy to assemble. Looks great. My boyfriend even bought the same one for his apartment after seeing mine.", 
    "I have been looking for a rustic coffee table and this is just perfect! Sturdy and heavy this is a high quality table and was so easy to put together. Great purchase!", 
    "Reclaimed wood is pretty neat, and I like the iron industrial element to this table as well. It is a good-sized coffee table, and the extra shelf below is quite useful. This is probably the only real wood coffee table in the price range, and I would definitely recommend it!", 
    "I absolutely love this table. I like that you can put magazines on the bottom shelf without cluttering the top. I hadnt really thought about how the wood of the table would match the hardwood floors- but I put a new rug under the table- and it brought it all together. It really makes a statement in the room. The table is well made and only took a few minutes to put together. I would definitely recommend it!!!", 
    "Very happy with this purchase.. The table was easy to assemble is very well built. And has a rustic but contemporary look.", 
    "Other than being a little larger than i expected this is the perfect coffee table. The wood is gorgeous and the table has the look of a fine piece. Easy to put together and very sturdy. A beautiful accessory especially for this price.", 
    "firm, awesome look ,cozy..", 
    "The table arrived on time without a hitch. It is of very good quality and was easy to put together", 
    "I love this table. It's the perfect size for my small, two-cushion couch, looks gorgeous, and was very easy to put together by myself. I have it placed on a carpet and have had absolutely no issues with it being wobbly or unsteady.", 
    "Beautiful table but bit tricky to put together. Keep the screws really loose until you put the bottom panel on.", 
    "Solid construction and easy to assemble. Nice but not so nice you feel bad about propping your feet up on it to watch TV. Really attractive.", 
    "Pretty much everyone that comes into my small city apartment comments on this table and how beautiful it is. This was a total cinch to assemble and is really sturdy. It looks like raw wood, but there is some sort of coating on top so that nothing snags and it's a total even surface. I can easily place cups (or wine glasses) on top and don't worry for a second about it staining anything. The only down side is that it's a little on the heavy side, so I needed help getting this upstairs. But for the price, this is beyond a great value. I'm totally pleased with this purchase and would recommend it to anyone.", 
    "Perfect fit for.my.living room. My only complaint is that no matter how tight the screws are it still wobbles a bit", 
    "Reasonable price, very easy to assemble, and absolutely beautiful! Lots of character.", 
    "This table is well made and looks way better in person. I do warn anyone with babies or small kids-the edges are very pointy.", 
    "Table feels solid and looks rugged without looking too rustic. I like the fact that it has reclaimed wood. Very pleased with this.", 
    "Very easy to put together and great quality. Hasn't scratched yet even with toddler playing cars on it. A little scratch wouldn't matter though; it would just add to distressed/reclaimed wood look.", 
    "This is a sturdy, attractive and easy to assemble piece. It looks great with the Laramie reclaimed sofa table, they match almost perfectly.", 
    "This was simple to assemble. It looks good. The wood is very heavy. This is a very sturdy coffee table. It was too dark for my decor and I painted it white. It looks FABULOUS! I'm not big on painting wood, but everyone loves it, too. (mind you, it was fine before, but for my home, painting it was perfect)Pros: sturdy, attractive, easy to assembleCons: the initial smell right out of the box was nasty, but it dissipates in a few daysI would recommend this to a friend", 
    "an absolute 5 for something that comes in a box. Just heavy enough it takes 2 people to move. Very nicely finished off. great rustic feel.", 
    "We love this coffee table! It was exactly what we were looking for and it was super easy to put together. Definitely recommend this one!", 
    "I love it. It arrived flat in the box but super easy to put together with just a few screws. Super easy to clean and substantial enough in weight and form to feel like a much more expensive table than it is. :) That's a nice combination. Would buy again in an instant.", 
    "I am completely in love with this coffee table. It's a beautiful addition to my living room, with a natural wood feel. As a visitor described \"it's a great mix of masculine and feminine\".The delivery was very fast (2-3 days), and the box was delivered to my upstairs stoop in great condition.It's very easy to assemble - only 4 pieces and they give you the hardware (including the tiny alan wrench). Once it's put together, it's a very sturdy piece.Note: the table top is reclaimed wood, so it's not necessarily going to be completely flat/even across the whole table. It's also slightly varnished, which I like because it's easy to clean and does not show dirt.", 
    "Love this, I have received lots of compliments.", 
    "Happy with the cost-benefit for this item", 
    "Looks like the picture. Nice reclaimed wood. Table is sturdy, but not real heavy.", 
    "I had end tables in reclaimed wood and was looking for cocktail table to match. This complements my tables beautifully. Was easy to assemble and looks great.", 
    "It came really quick, there was absolutely no issues with delivery or missing parts like it was mentioned in pevious comments. This table is great- it looks awesome, it's sturdy and durable. It was already tested by my toddlers - milk spills and play dough games. It's an amazing deal!", 
    "I really like this table!! The reclaimed woof is great and it's bigger than I was expecting. A tad wobbly though... I think the screws will need to be retightened from time to time. But overall, great table and great value.", 
    "This coffee Table is absolutely Georgious! Looks more expensive and was exactly what my lake house needed! If you tighten the screws properly there is no wobble.", 
    "Such a great table! It took about 10 minutes to put together (it comes in four pieces, not 40!) and it stylish and sturdy. Looks great in my loft. The table definitely has a reclaimed wood look and really ties our whole living room together. Also, I saw this table on another site where they were trying to charge way more for shipping -- this is why I love Overstock!", 
    "Affordable reclaimed wood piece. Very sturdy and looks great in my living area.", 
    "Cheap, poorly made table. the table wobbles and the construction looks very cheap. It is not what i thought it would be. totally disappointed.", 
    "Very pleased with this coffee table. Its very attractive reclaimed wood. Sturdy and was easy to assemble.", 
    "I was sooooo surprise....it looks amazing in our living room", 
    "Table was easy to put together and looks great in my living room", 
    "We purchased this table for the media area of our basement. It was easy to assemble and looks great. Some of the boards on the table top are quite uneven, but because this isn't in an area of the house where we expect perfection, we don't have an issue with it.", 
    "Love it - very sturdy and good price. highly recommend.", 
    "Love love. It was a great addition to my living room. I wanted something different that would change the tone in the room and this made a perfect addition. Great rustic feel", 
    "Unique table, matches some other reclaimed wood pieces of furniture around the house. Table is plenty sturdy.", 
    "Bought this table for my son who just bought his 1st place. He wants a bit of a lived in, industrial vibe. This is a nice size table....very substantial without being overwhelming. It is heavy and very sturdy. Love the real wood planks. It is an excellent value! Would absolutely by it again.", 
    "I love this table. It is plenty big enough for a normal size living room. I put it together myself and it is solid. No wobbly legs. I get lots of compliments. Rustic, yet elegant. Gorgeous wood.", 
    "highly recommend- we really love it.", 
    "Looks exactly like the photo- gives a great rustic touch. Very sturdy and easy to assemble but definitely need 2 people to put it together. I love this piece!", 
    "Great price and great quality love this table", 
    "We get a lot of compliments on this table. It is very, very nice looking. It was easy to put together, but we were not able to put in one of the screws under the table. This has, so far, not caused any issues, but I am cannot say how it will affect the table in the long run. It is still a very nice table. Not too heavy, and not too light.", 
    "Easy to assemble, exactly as described. Perfect for that industrial look.", 
    "This has an ideal rustic look that steers well clear of looking like recycled junk. It was easy to assemble, looks great and is easy to clean. I love it!", 
    "This table is wonderful...It is solid and high quality and has a beautiful color! The only reason I did not give it 5 stars was because it is not part of a complete set. The Chandler set includes an end table, sofa table, and coffee table but does not include a media stand which was a huge disappointment to me because the set is just wonderful. Still recommend this table but if you like your furniture to match you will have to search for a media stand that goes well with this table.", 
    "This rustic coffee table came packaged very well and was very easy to put together. Love the look of it and it is very sturdy. There bottom of the legs are adjustable which is great for a slightly uneven floor. Love it.", 
    "Table looks great and is made well. Very pleased!", 
    "I LOVE THIS TABLE! Everyone that has seen it comments how much they love it. Easy to put together and very sturdy. Great quality!", 
    "Real wood !! Strong table, great material . This table & the smaller one are the best . I picked it online & my boyfriend loves it so we are both very happy with it .", 
    "buying furniture online is definitely not something I like to do. This table is real wood and looks like it was way more than the less than two twenty five I paid for it. I put it together myself in about 20 minutes. You have to do one of two things: 1) put top on and keep one side of legs really loose to get the bottom shelf on or 2) put the bottom on first and then the top. I am very very happy with this purchase and thank all of the reviewers for helping me decide to buy this table.", 
    "Love this piece! Sturdy and great look!", 
    "Could not be more pleased with this coffee table! I shopped for a long while looking for the right table for my lake house great room; this is perfect! Rustic enough and yet shelves for all the books that stack in the room and not too large or small . It arrived quickly, was easy to assemble, is solid wood and very sturdy. A great price and value.", 
    "Sort of manly. Sturdy, cool. I love it. Practically no assembly.", 
    "Great quality wood, and very sturdy. Definitely worth the price", 
    "Love this!! Even better than I would have expexcted.", 
    "Real wood, no fiberboard or veneers, looks great, very sturdy. Not sure how others screwed up the assembly to make it wobble, doesn't seem possible if you have half a brain.", 
    "Rustic and simple. easy to put together.", 
    "I purchased this based on reviews and am 100% pleased with it. 2 things I need to advise: the color is a wood with gray/green tone not as pictured, also no directions only a vague picture of bolt assembly so I remember to assemble bottoman shelf to side bars/legs 1st then assemble that structure to table top. Best to lay tabletop upside down and measure exact center of bar placement on underside of tabletop BEFORE TIGHTENING ANYTHING. Had I not done the measuring of metal side leg placements my legs would have been one more towards front and one more towards back of table -you want legs centered exactly. Wait to tighten and I mean tighten all screws at the end and the table will be solid as a rock no wobble. Also the metal legs may look thin but the are STRONG. I tried to bend one and it wasn't gonna bend. That's a good thing!! I was skeptical about this table but when it was assembled I am so happy I chose. Please follow my advise and you'll feel the same.", 
    "I love this coffee table! I have gotten many compliments on it. It is very sturdy, and I love the industrial look. It goes perfectly in my 1922 bungalow with chocolate bamboo floors; classic but with a modern touch. Very happy with this purchase!", 
    "Love this piece. Great price !", 
    "Very sturdy, expensive looking. Was easy to put together.", 
    "While it's not a bad \\table for the price, the claim that it is reclaimed wood it an utter lie. This table is made in China, from new milled pine (or something similar) that has been stained with an antique stain and then sealed. It's easy to put together, and it actually looks pretty good for what it is, but \"Faux Reclaimed Wood\" is a more accurate description.", 
    "After reading some reviews I was a little concerned about the quality of the materials. This is a beautiful piece. It appears to be solid wood and the steel strapping is plenty thick. When assembled properly it is solid and stable. Zero rocking on solid floor. Bonus: The wood is well sealed and it holds up to water which pools without seeping in or staining. I will occasionally treat it with bees wax to maintain the waterproofing. My only regret is that the end tables are too large for our space so I'm still trying to find suitable ones.", 
    "This is as described, heavy reclaimed wood, the color is like the picture, it is a sturdy good looking table. Love it.", 
    "I'm impressed with this table. It arrived with sufficient packaging to protect the pieces in transit and was quick to assemble. The table surfaces are constructed with wood jointed together. Screw nuts are visible on the sides of the wood but they are inset so they don't interfere with function or livability. The jointed boards are not planed on the top, so there is natural and intentional variation on the top surfaces. This is part of the design. It not totally clear in the description/photos. So if you need a totally smooth surface, this isn't the table for you. It's quite sturdy. No issues with this feeling or appearing flimsy. It has a rustic look without appearing clunky.", 
    "Perfect, love it. Sturdy and easy to assemble.", 
    "It's gorgeous and totally sturdy.", 
    "Love this table. Sturdy and easy to assemble. Best feature is it's gorgeous in my family room with my transitional furniture.", 
    "Table is beautiful with unique table top uneven but rustic in nature and unique. It's perfect and easy to assemble, sturdy.", 
    "Exactly what we were looking for. Looks great, solid, not too big and easy to put together!", 
    "Great value matches other pieces really well.", 
    "I didn't think this would be so sturdy but its perfect. The color is slightly lighter in person than in the picture but its great! The size is perfect and I just love it!", 
    "This is the center of my seating area in my hair salon. Beautiful", 
    "I have had this a few weeks and I have received many compliments already. Initially I was scared to order but right after I opened it I knew I loved it. It was pretty easy to assemble. The wood is beautiful. Everyone is surprised at how much I spent for it. I shopped around at a lot of furniture stores and this is a great price for a great piece.", 
    "Beautiful wood. Very sturdy", 
    "I get a ton of compliments on this table. It really is awesome, especially for the price", 
    "I am surprised with the quality of the material and craftsmanship of this coffee table. I was expecting a cheap quality, but this table is from that. The wood looks like it was really reclaimed and it gives the table a unique look.", 
    "This table has been a great addition to our family room. The picture simply does not do it justice. It was more difficult to put together alone but would be easily done with 2 people. I also have not had issues with the sturdiness as other reviews have indicated. Highly recommend!", 
    "I am so glad I pulled the trigger on this table. Everything arrived intact, and the wood is just beautiful. Based on the dozens of reviews I read, I understand the tone of the wood naturally varies with each table, so I was a tad nervous. Mine turned out to be a very lovely, warm, and bright blonde wood with a hint of almost charred grey undertones. I don't know what the hang-up is with other reviewers' comments on sturdiness -- I made sure to tighten down all the hardware before use. Solid as a rock. I had a second set of hands on this, just to be safe with the wood. It's also incredibly light once constructed -- 60 lbs, so movement is easy if needed.FYI: this isn't an ugly, roughly finished piece. I love the idea of reclaimed wood and the good behind it, but all the reviews citing how too \"rough\" and \"rustic\" this table looked did put me on guard until I was finally able to view it in person. The manufacturer took care to give the table top, sides, and shelf a nice soft finish for a semi-gloss, clean appearance. The dark bronze legs also lend a nice masculine note to the table's overall aesthetic (think: gently aged barn tools). I'm just really in love. Ordering the matching end tables this week.", 
    "Exactly what I was looking for. The piece is sound, and pretty easy to assemble.", 
    "Metal legs are flimsy and cause the table to wobble a bit from side to side. Front to back is very stable and it is a pretty table.", 
    "Very sturdy, beautiful piece of furniture. Love the reclaimed look. Great value!", 
    "Piece came as shown. Very pleased with the quality and the lookup. Easy to set up.", 
    "Looks great! Easy to put together... helpful to have 2 people to help put it together.", 
    "Great reclaimed wood table, sturdy, stylish look.", 
    "Looks just as good if not better in person. SOLID table! Gorgeous!", 
    "love the color and storage", 
    "Looks great, good quality, easy assembly. Makes the space very rustic but modern design. Love the reclaimed wood", 
    "Easy to assemble, looks great, sturdy. Very happy.", 
    "Nice, sturdy and easy to assemble", 
    "Very sturdy table. Easy to assemble. Works well with various interior design styles.", 
    "Great table! very sturdy, very easy to assemble, looks very slick and modern. Not too heavy either.", 
    "Very nice,very authentic, very impressive. Color is not as warm as picture shows. Went together easily, seems quite sturdy. A good value!", 
    "I bought this table for my front sitting room and it is exactly what I was hoping for. It is sturdy and was pretty easy to assemble. It adds a nice warmth to my cool colored room. I love the little nuances in the wood. Buyer beware that this is reclaimed and it will have imperfections. It's the imperfections that made it perfect for what I needed. Highly recommend.", 
    "Looks great! Easy to put together and very sturdy. I would highly recommend!!", 
    "Great size and easy to put together. Looks fantastic!", 
    "Very easy to assemble. Exactly what we were looking for.", 
    "Looks great in our industrial modern family room...It looks just as beautiful as the pics and just has such a unique look. Easy to put together. Love it!", 
    "Table is just as pictured. I really wanted the rustic reclaimed wood look and this table does just that with a lovely clean finish. Very easy to assemble, sturdy strong wood. And arrived quickly. Highly recommend.", 
    "This table looks nice and really fits with the furniture in my apartment. Two things to be aware of, however: first, this table is painted with a heavy varnish that smells awful for about a week. I stuck it in my hot garage to let the VOCs offgas from the thing. God knows what kind of varnish they used but it smells terrible. Second, the legs are quite flimsy. They are built from 1/8\" sheet pot metal and the entire thing is held together by about eight hex bolts.", 
    "Easy to assemble and looks great. Have not had it long enough to see how it ages but hopefully the reclaimed wood continues to look good.", 
    "I'm very happy with this table", 
    "Looks just as pictured. Wasn't too hard to put together(did it by myself but would have been easier with help). Only reason this didn't receive 5 stars is because its just a little shaky but not bad.", 
    "This table is beautiful! The reclaimed wood with the iron gives it the rustic look that I was aiming for!", 
    "Delivered in a box; problems with finding hardware (bolts, washers, etc.) that were strewn around the box amidst the styrofoam (rather than in the little bag that was actually empty); a bit of a mess, and several washers missing. However, the coffee table was easy to assemble (though still missing those washers), and looks good in our TV room. Worth the price.", 
    "Great deal, nice looking and good quality!", 
    "Just got this coffee table this week. It was super easy to put together. Very sturdy and great design. Love it.", 
    "We are very satisfied with this table. It looks hefty, and was easy to assemble.", 
    "Awesome Piece price for the quality", 
    "Very nice quality table. As described and well worth the money. Very easy to assemble.", 
    "A little more rustic than I was looking for but sturdy and lovely wood.", 
    "took all of 5 mins to put this together. quality is excellent and it looks even nicer in person with the reclaimed wood. Just wonderful!", 
    "This table was easy to assemble, looks great, and is very sturdy. I was worried it would look to \"manufactured\" when I was going for a more \"salvaged\" feel but they did a great job with the wood and it really looks nice. We've received many compliments already.", 
    "I love the look of reclaimed wood, but this was a little too rustic for my style. Easy to assemble, but just doesn't look like the quality I would expect for the price. Although it seems sturdy, the legs are thin and look cheap. Too much of a hassle to take it apart and return it -- I'll use it in the garage and then put it in the garage sale and take a loss.", 
    "Love this table. It is everything I wanted. Easy to put together and the speed of delivery was amazing. I live in a cabin in the mountains and I received this table in two days.", 
    "Nice finishes. Looks perfect in my farm/ranch house. The room is not large and it doesn't overwhelm the room. Great focal piece because of the reclaimed wood and it's the perfect size paired with my sectional.", 
    "Pleasantly surprised by color and sturdiness.", 
    "Beautiful coffee table. The reclaimed wood is so heavy and sturdy I wasn't expecting it to be so dense it's just beautiful. However the hardware is a Beautiful coffee table. The reclaimed wood is so heavy and sturdy I wasn't expecting it to be so dense it's just beautiful little flimsy. Compared to the density of the wood I wish the hardware was thicker. All and all still a gorgeous table. Better quality than I expected really.", 
    "The table is really pretty. It's a great color and I love the style. It looks like the picture except that you can see the holes for the screws all the way around the top of the table. That bothers me.", 
    "Bought this table as an alternative to a pricey table I had been considering from Pottery Barn. Table looks amazing for the price! Quick and easy to put together, sturdy and looks great with my other PB pieces. Everyone comments how beautiful the wood is. Would highly recommend as an alternative to the pricier furniture store reclaimed wood pieces.", 
    "We wanted a simpler piece that was not so bulky. This fits the bill perfectly, yet is very sturdy.", 
    "This table is gorgeous, relatively minimalistic, simple, rustic look. I am handy but anyone can put it together. Not overly heavy, so you may move it around with a little effort. I got compliments on it and even asked me where i got it, my friend will be purchasing it for her apartment in NYC.", 
    "This table is amazing! Looks great in my small living room. Offers storage underneath and is sturdy. Does not wobble at all. Only complaint is that I needed to put wax on the top to protect it from drink ring stains", 
    "Simple to put together, the wood was in good quality. There are screw holes on the side of the top. They are there for obvious reasons, just caught me by surprise. They are sanded and haven't caught on anything.", 
    "I just hope they still sell these in 5-10 year when I need another", 
    "I have no idea what others are talking about... This table assembled nicely, and is very sturdy... We are not placing it on a rug or anything, just the carpet.. But over all Its a good table.It is a rustic looking table.. The planks are not straight, so you cannot really slide a cup over it easily.. I think it would have been nicer to have it planed nicely.. But over all I thought the build quality, and the bracing was done very well. It is a table that should last quite a while.", 
    "As advertised. Using as an outdoor table. It's a solid, heavy piece. All hardware was included and was easy to put together. Look great !", 
    "Received quickly as usual. Nice quality, easy to assemble and looks great. Looks exactly like the picture.", 
    "I am extremely happy with this item. It was a cinch to put together (even though the directions were a bit vague (put the lower shelf on the legs first) and a couple washers were missing. It is still extremely sturdy and beautiful! The wood is very heavy and high quality. It goes perfect in my rustic/modern living room!", 
    "Looks very expensive and made of solid wood. Easy to construct and goes well with the decor we have (natural fiber rug & brown leather sofa). Love it!", 
    "This is a great table for the value. Love the combo of the distressed wood and black iron. We've had it for a couple of months now and it is holding up well!", 
    "Table made of very good quality a little darker in color than as shown in the picture but have already received compliments on it. It is so different and unique and made of very sturdy quality. A nice accent piece in my rustic styled living room!", 
    "It's a great coffee table with a rustic look.", 
    "Great table, make sure to note the size, but you'll be happy with it.", 
    "Went out of stock and requested notification when it was back in. Purchased it as soon as it was. Glad I did. Exactly as pictured. Smaller scale coffee table. Arrived quickly. Packaged well. Easy to put together. Lost of compliments on rough hewn quality and reclaimed wood. Goes well in my rustic industrial living room", 
    "The coffee table is beautiful!! Assembly was pretty easy. Looks great in our living room.", 
    "The Coffee Table was nice. It came in one piece, looked like the picture and was the style I was after. But the stain odor was intense! Overwhelming. I am pregnant and it made me nauseous and paranoid that I was inhaling toxic fumes. So I had to return it. No way was I gonna expose myself to any chemicals.", 
    "Great piece for half the cost of what I was looking for elsewhere! It has that old, new look to it and stands up to our grandchildren just great!", 
    "Table is exactly what I was looking for. A few minor issues with holes lining up exactly. Very satisfied overall.", 
    "Love the look and quality of this table. Have already had 2 friends ask where we got it!", 
    "I LOVE this table! Easy to assembe, perfect for my small apartment and have gotten many compliments !!!", 
    "Table is beautiful and holding up very well after a years usage. The finish was darker than in the picture, but just as pretty. Very sturdy and the second shelf is great for books. Really pleased with this piece.", 
    "Just love it, how it looks and fits into the dining room", 
    "This table is perfect! Great size beautiful coloring to it.", 
    "Easy to assemble. Very sturdy. Looks great!", 
    "Was looking for something unusual for a coffee table and this fits the bill perfectly. Easy to put together and very sturdy. Just love the rustic but industrial look of it. Highly recommend if you are looking for a table that doesn't look like all the rest. Very very happy!", 
    "Just beautiful and well built.. Very easy to put together.", 
    "nice look for the money. Has a bit of dark almost black in some areas.", 
    "Wonderful piece of furniture. Looks as pictured. Incredibly easy to assemble, something I usually dread. Well worth the price. Well packaged for shipping.", 
    "If you like the rustic look of reclaimed wood with wrought iron, this table is a steal. I've been looking for something like this for months, and this table at this price is one of a kind. The only thing you need to be aware of is that when you first open the box, and assemble the table, the odor of the wood is somewhat strong. That completely dissipates after a day or two. The size, the look, the quality (it's heavy!) is all A++.", 
    "I was very pleased with the cocktail table. It is so much more than I had expected from the pic. It's excellent quality with a bit of rustic charm and goes well with my blue leather sectional. I was very tickled with this product.", 
    "Beautiful product, easy to assemble, excellent price", 
    "I couldn't be happier with this coffee table. It looks and feels like a much more expensive piece of furniture—it's really beautiful. It arrived quickly and was fairly simple to assemble, true to color, and very sturdy.", 
    "This item arrived quickly and is exactly as pictured. It's super easy to put together. It's perfect for our rustic décor.", 
    "We use these at The Clarendon Hotel and Spa and they're just as good as those made by high end hotel suppliers...", 
    "Exactly what I expected. Sturdy.", 
    "I was so skeptical about ordering online, but was really pleased when the table came. It's durable and heavy. Love it.", 
    "The table legs are made of thin metal, by pushing the edge of table, the table will vibrate back and forth a few seconds. The table is certainly is priced well, but I would have rather paid more for a table with sturdy legs. I have no doubt that if I was to stand on the table it would collapse.", 
    "We like not having to worry about scratches. This table looks great.", 
    "Just had this delivered on Saturday, and I love it! The table is excellent quality. The wood is gorgeous and durable, with lovely little imperfections that make it unique. The table was easy to put together (I did it alone and it only took 15 minutes), but important - don't tighten the screws until the very end! I'm obsessed with the new table. What a great find.", 
    "I wanted something with steel legs and \"used\" wood. To this product, I added stain and paint to make it fit the other furniture in the room. A very good item for the low price.... beat the socks off anything that I could find locally (and I looked around a lot to find just what I wanted).", 
    "I highly recommend this coffee table. The reviews were right on. Sturdy you can put your feet up. I have gotten so many compliments. When putting together be sure to line up before you screw it together. Enjoy!", 
    "I love this table and get compliments on it all the time. It's very sturdy and well made. Very happy with the purchase.", 
    "The holes in the hardware did not line up properly. I hate doing returns so I forced the screws in so the table is a bit flimsy.", 
    "I was looking for a coffee table to finish off my family room basement. I wanted something all wood that had a rustic vintage industrial vibe. This table looks better in person. I am a female and was able to put it together. Sturdy, functional, and good looking. I recommend this table.", 
    "It came within 3 days of ordering. I was able to put it together on my own. Instructions seemed light but came together well, and I'm not a super handy woman. Looks gorgeous in my home. Very sturdy and beautiful!", 
    "Its a great looking table, < 10 minutes to assemble, arrived within the week. Like some of the other reviewers have mentioned, the only issue I have with it is that the wood is significantly darker than what is pictured in the photos. The black and grey undertones are strong. I still like it, just slightly disappointed the shade was not as depicted.", 
    "This wood top on this table is really beautiful. I was hesitant to buy because I worried it may look too rustic but the wood is very warm and would look great in any casual setting. It is very sturdy and good quality. I highly recommend this table!", 
    "Great coffee table, love the mix of wood and metal. The wood is slightly darker than the image (or at least how it appears on my computer). The table has a smooth finish and has been pretty resistant to watermarks or stains so far. Very happy with this purchase!", 
    "Easy to put together and looks really great. Love how there is a bottom shelf. Seems very durable and a good price point for a new, industrial style coffee table. Note: if you have trouble aligning screws with pre-drilled holes, keep them all fairly loose and get the screws in the holes before tightening. This was the one issue we had, but when we did it this way it fit perfectly!", 
    "I was a little unsure due to the reviews- but I am SO happy I bought this. Works perfectly in my industrial-farm-chic living room. Ended up assembling by myself (which is not a good idea) . Make sure to NOT tighten the screws before full assembly. Its a beautiful piece!! I would post a picture if I knew how to.", 
    "Purchased this table to go with a greige style room. Ala blacks and woods and grays. The table is heavy and solid feeling without the feel of an 'assemble it yourself\" piece. Looks like the current styles listed in the ****** catalog for a third of the price. Very happy with this purchase. Easy to assemble (took all of ten minutes). The wood is darker in person but not super dark. I love the rustic-industrial feel of this piece.", 
    "This is a really nice table. I needed a smaller table to go between the couch and the entertainment console in my mancave (pool table takes up a LOT of space. It's the perfect fit for my space. It was simple to put together - 12 bolts and 10 minutes. I used an allen bit on my drill driver which made it go quicker. Even if you don't have one for your drill, use a good allen wrench. The ones that come with furniture are junk. I really like the style of the reclaimed wood. It's perfect to rest a beer on. The only reason I wouldn't reccomend it to a friend is because I want mine to be unique.", 
    "I absolutely love this table. It did come with a few scratches, some were natural from the wood, and some were obvious actual scratches to the wood, possibly done in shipping and handling. Even with the scrapes, the table is just beautiful. Its very sturdy. Has a great weight to it, but not too heavy to move around, I was able to put it together myself in just a few minutes. I would definitely recommend this table to anyone looking for a farmhouse, rustic, or cottage type table. Also the color is a tad bit darker than the picture, its an even better color in person.", 
    "Love this table...great buy would recommend this for sure", 
    "I have bought a number of pieces of furniture from Overstock and while they are not always perfect, the value is unbeatable. The customer service is excellent as well. No complaints.", 
    "So easy to put together, gorgeous industrial/rustic look- solid, high quality piece", 
    "The wood and metal looks great to me... however the parts were not even close to fitting together. The lower portion of the table appears to be 4+inches too long to even fit within the provided legs. Maybe there was a mixup with parts because I cant think of a way that this could happen otherwise.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Emerald-Chandler-Reclaimed-Wood-Cocktail-Table/8816778/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8816778/Emerald-Chandler-Reclaimed-Wood-Cocktail-Table-2a2ebbb4-2cd6-4b38-ac94-e4f391e3a6a3_600.jpg"
  ], 
  "description": "Use this reclaimed wood cocktail table to store a multitude of\nitems. Featuring natural tones, this table has a rustic appearance\nto create a warming aura reminiscent of a log cabin, and the metal\nlegs complement the rural design while increasing durability.Constructed with reclaimed wood and metal for a rustic,\n  traditional appearanceNatural finish pairs well with cool and warm colors for easy\n  accessorizingBottom shelf provides additional storage spaceMade with metal legs for increased durabilityCocktail table measures 18\" H x 24\" W x 48\" LStyleTransitional, UrbanMaterialMetal, Reclaimed WoodTypeCoffee TablesFinishNatural Finish, ReclaimedShapeRectangleAssemblyAssembly Required"
}