{
  "name": "Engage_Sofa", 
  "price": "EUR 1066.01", 
  "reviews": [
    "Love this sofa. Modern, firm but not too firm, just great solid quality. Overstock worked with manufacturer to ensure item was flame-retardant free which is great because I don't want to sit on something saturated with cancer-causing chemicals. Really happy with this purchase. Got it in oatmeal - it's more a brownish speckled color, slightly grayish but more a warm gray, taupe-like, not a cool gray. I like it and it has become one of the nicest spots in the house to lounge on....", 
    "Everyone who walks into our place for first time says \"What a beautiful couch!\" (We just purchased a home & so friends and family have came to see us often and that's the first thing everyone says)We purchased it in \"Oatmeal\" and the fabric is truly nice and the color is beautiful. It matched the color shown online. FYI. It's very firm, not uncomfortable, not a TV couch at all, it's comfortable for a living room couch. We bought long black pillows and they make it look even nicer. they also support you back when seating", 
    "This sofa is a fairly stiff one but it works well in a mid-century living area. Really happy with it!", 
    "This sofa is fantastic looking, so if it's just an accent piece, go for it! Unfortunately, it feels like a bedrock sofa straight out of The Flintstones. It is VERY hard. Another issue is the arm height. If you're used to lying sideways, propping yourself up against the arm to read or watch TV, forget it. The arm is so low, it hits in the small of my back. There's no way to nestle in and get comfy.", 
    "I really like the way this looks in my living room, though it is a tad on the low side (not a problem for me as I am short). It was a bit stiff/firm when we got it, but seems to have softened up. This is a fairly lightweight sofa, so I hope it holds up to use.", 
    "Love the mid-century look. It's sturdy, but the foam in the cushions is hard hard hard!! Good for a formal room, but do not buy for everyday (TV) sitting.", 
    "We absolutely love this sofa. We bought the Atomic Red color and its looks absolutely stunning. We bought this for our living/play room. Its brings pop of color to the room, all (4) of us can sit comfortably in this sofa. Can't beat it for the price.", 
    "This item arrived via freight shipping due to it's large size. I ordered it in Granite, which turned out to be the exact color I wanted. It is a grey with some brown undertones, but it goes with everything. It is high quality fabric, feels like it will last a while and not show wear. As others have mentioned, it is rather firm, yet comfortable. I use down throw pillows and absolutely love this sofa. I ended up ordering the armchair to go with it!", 
    "We purchased this couch for our reception room in our office. It gives it the perfect touch. Not too \"homey\" and not too \"officey\" (for lack of better terms). The material is nice. It is everyone's favorite piece of furniture. Our staff likes to sit on it to take calls just because they like it so much. Well worth the price.", 
    "Excellent choice for our midmod family room. It is stiff, but we are enjoying it everyday, especially the compliments from our visitors! We've had the sofa for a month. Fast shipping and easy assembly. We did remove the plastic feet protectors and replaced with floor grips for our wood floor to eliminate sliding.", 
    "This sofa is beautiful, although a bit hard to sit on.", 
    "A $$$$ sofa that looks like a $$$$ sofa. Got oatmeal and it seems to go with everything in our 1960 mid century modern house and decor. Nice fabric and wood.", 
    "This sofa looks great, but it is not made for extended sitting. The back and bottom cushions are really hard/firm, and we had to put a pillow from the bed behind for more comfort. Fortunately, we bought this sofa for a side room not the main living space (we only used it in the living room while waiting on our comfy couch). The sofa does look great, and it's fine if you are not sitting on it for a long period of time. The only other issue I have is that the seat cushions are not reversible. They are not attached, but they are not finished with the same fabric underneath. All in all, I'm pleased with the purchase.", 
    "Be aware that Modway is slow to ship and difficult to track items. For me, it was worth it. Comfortable and firm without being too hard. One of the cushions had a mark on it and they replaced th whole cushion with no problem...again a bot slow to arrive. I will order their products again.", 
    "Very uncomfortable to sit on. Cushions have no flex in them at all. Great if you are Fred Flinstone. My advice, do not buy furniture on-line especially when they charge you a $$$ shipping fee to return.", 
    "Fits well with my mid century modern look. And brightens the room. It is exactly what I wanted.", 
    "I love this couch! Purchased it in Oatmeal because the grey was out of stock. The color is much greener than in the photos online, which is fine. The only construction needed for this was to screw the legs in - super easy. Would definitely recommend, but perhaps not the Oatmeal color!", 
    "Exactly as expected as per reviews, rather firm but that works for 2 medium teens and parents to watch a movie without rolling into each other! Fabric is medium grain, nice quality, quite taut. Atomic Red is on the orange side as expected. Overall trim and stylish and Fit the bill perfectly for us! It's not a $$$$ piece but it is more than worth the price.", 
    "Always worried when buying something online that it will not quite look as good in person; this looks better! Although I don't mind, cushions are very firm; so if you are looking for something to sink into, this is not for you.", 
    "I like firm sofa's and this style. I've owned this one for a month now and it is a wonderful sofa. Great style in my apartment, actually a good napping sofa too! (Again, if you like the firmness). I get a lot of compliments on it and people are shocked when I tell them I found it on overstock as it looks like a high end modern furniture store purchase. Takes about 3 weeks for delivery, all you have to do is screw the legs on. Very solid and I'm very happy with it!", 
    "We ordered this sofa for the waiting area in our office. It looks terrific! The gray has a little more blue than I anticipated, but it is beautiful. It sits firm and will benefit from a couple of lumbar throw pillows for the shorter folks in the office (me). The legs match the finish of the Astro end tables (also fabulous) perfectly. Perfect!", 
    "I loved it! Very modern looking and plenty of space. The deliver was super fast. I was very suprised that it arrived within a week. The only thing is that the cushions are little hard, but I'm sure they will soften fast. I recommend this sofa.", 
    "wanted to love this but never took delivery saw and felt the fabric (oatmeal) and thought it felt flimsy and color made it look very cheap. ill be careful next time not to get sonething without having a closeup pic of the piece. service is great!", 
    "Love It! Looks great! Firm cushions, and very comfortable."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Engage-Sofa/8789758/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=5", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8789758/Engage-90.5-inch-Cherry-Wood-Leg-Sofa-cd10ab7e-dd86-4dac-a9af-d3eb1594504a_600.jpg"
  ], 
  "description": "Add an inviting splash of stylish elegance to your decor with this\nstunning fabric sofa from Modway. With a chic tufted back and\ncherry-stained rubberwood legs, this sophisticated modern sofa is\nsturdy and supportive, and it is sure to impress your guests. The\ngorgeous design of this sofa makes an instant impression, and it\nworks beautifully with mid-century and contemporary decors.White plastic glidesSet includes: One (1) sofaMaterials: 100-percent polyester, rubber wood, plasticFinish: CherrySeat dimensions: 19 inches high x 81 inches wide x 24.5\n  inches deepDimensions: 32.5 inches high x 90.5 inches wide x 33 inches\n  deepStyleContemporary, Mid-CenturyMaterialFabricTypeSofaAssemblyAssembly RequiredColorBlue, Green, Grey, Red, YellowFurniture PatternSolid"
}