{
  "name": "Euro_Style_Carmela_Coffee_Table", 
  "price": "EUR 327.05", 
  "reviews": [
    "This was such a disappointment! I love the shape, the lines, the size BUT it was packaged SO poorly that not only was there a storm of crushed styrofoam when I opened the box it appeared that pieces were just thrown in with NO thought to proper packaging. The first piece I took out was a broken leg. I sent it back immediately and though I'd like to have the table pictured on the website I have NO faith that this manufacturer can produce it.", 
    "We bought this table, deciding to \"try it\" after the earlier reviews; we had purchased the matching end table about a year earlier and were happy with it. The coffee table was a nice surprise. The packaging was good - no problems with the product. Assembly was easy - my 84 year old father and 16 year old daughter assembled it with no problem. The finish was fine and matches our Danish style couch and chair.I would recommend this table.", 
    "I was preparing for this table to look a lot worse based on the negative reviews. We decided to go ahead and get it since it seemed to be the perfect shape for our one year old to walk around (no sharp edges) and was reasonably priced . It's a nice looking table. It's not the coolest looking piece of furniture, and there's probably something that would look better with our couch, but we're going for function over style here and this table fits the bill. As for the quality, time will tell, but it looks like it will hold up.", 
    "We returned this table. It had very nice lines, but the quality was terrible. The finish on the legs and the top were two different colors and the top veneer had ugly defects all over it. Very disappointing especially for the price.", 
    "I was so excited to get this table. I actually purchased it from another retailer. I cannot explain how poor the quality and the packaging from the vendor was, both ends of the table were completely crushed on all 4 corners. Thinking it was a fluke I sent it back for a replacement. The replacement table was even worse! It literally had a huge chunk out of the side where I could see the table through the box. At that point I was done and finally returned it for a refund. What's sad is this has nothing to do with overstock, and is all the vendor who manufactured it. Don't waste your time with this brand.", 
    "Good for small spaces. Cheap wood surface that scratched the first day. Love the mid century style but the overall quality is poor. They could have used a slightly better quality wood top and it would be perfect. It's ok for now but this ain't no family heirloom!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Euro-Style-Carmela-Coffee-Table/7154056/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7154056/Euro-Style-Carmela-Coffee-Table-62841b19-99e6-431e-8ad6-49d09949bfef_600.jpg"
  ], 
  "description": "With a nod to mid-century modern, add an eclectic touch to your living space with this beautifully rendered coffee table from Euro Styles. From the rounded corners of the lovely walnut-finished top to the sleek minimalist lines of the legs, this table brings both form and function to your home. Sturdy construction and an additional bottom shelf for books, magazines, display and storage make this piece as functional as it is stylish.\nMaterials: Veneered/wood Finish: Walnut Walnut veneered MDF topSolid wood baseDimensions: 17.7 inches high x 23.6 inches long x 43.3 inches wide StyleMid-CenturyMaterialMDF, Veneer, WoodTypeCoffee TablesFinishWalnut FinishShapeRectangleAssemblyAssembly RequiredColorBrown"
}