{
  "name": "Floating_'U'_Walnut_Finish_Shelves_(Set_of_3)", 
  "price": "EUR 21.61", 
  "reviews": [
    "These shelves are great, I ordered several sets for my living room. It says not to use a drill, but we did anyway in order to get the anchors in the wall. The installation instructions aren't very good but it doesn't take a genius to figure out how to install the shelves. They're stable and look good.", 
    "Great little shelve's. SO easy to put up. Not too deep though. I put up my 4 inch potted plant's on some and, my new salt and pepper grinder's on another. They are usefull and, they look great also.", 
    "They are exactly what I expected and wanted - affordable, nice looking, functional for my purposes. I have a very small bathroom, and small cabinets and closets. I can never get to one product without knocking a million others over. In addition, I have a lot of wallspace behind two bathroom doors. I bought 4 sets of these shelves, and hung them all over that wallspace. They are mostly hidden, since the doors are always open against the wall. They're thin enough to fit back there. I have *all* my products on them - hair products, perfumes, lotions, deodorants, skincare, etc. and I love them. The only negative is the hardware they came with - they were cheap. We had to buy some good wall anchor screws at the hardware store to really secure them to the walls (where there are no studs).", 
    "These are so perfect for any decor. They are MUCH smaller than I had expected, but they worked perfectly on the empty wall in our bedroom. The white is a very bright white and the shelves are sturdy. Very happy with my purchase and will probably by more!", 
    "Great little shelves for the price! If you have small spaces that need a little fun, these are what you're looking for!", 
    "These shelves are okay, but not really what I wanted. I am using them but not where I had planned. They are small and cheap looking...but the price is quite low.", 
    "I needed some shelves for our bathroom and these are great. Not great quality but you can't tell once they are hung up. I discarded the cheap wall anchors supplied and used some good ones so the shelves will stay up. Now that they're in place they hold all the shaving supplies including straight razor and brush and soaps. They look super on display.", 
    "These are okay shelves (look like picture) but do not use the hardware that comes with them. The anchor kits are cheap and horrible. They kept going through the wall (as in all the way into the wall) and the screws would not hold. Use your own anchor kits and shelves should hang fine.", 
    "Horrible instructions, impossible to put up.", 
    "Not what I really needed. Used in bathroom added wood bars to front. Excellent quality.", 
    "These we're pretty straightforward, and finished off the collage on my wall.", 
    "Like the look, will know more about hanging them when I finish but so far so good", 
    "Very easy to put up, very sturdy", 
    "Good for small spaces. Nice for the walls in stair cases.", 
    "Simply wood painted white. No style, just plain", 
    "these are great . very easy to put up and dont fall of when you move stuff.", 
    "Nice wall unit I'm happy w purchase", 
    "just perfect for what i needed", 
    "Looks good, but shelves are too shallow to provide real storage. A few accents are about all they can hold. Aesthetics only.", 
    "I had wanted to use these as pedestals to display some ceramics, but they are NOT drilled to be installed in the inverted position as was stated in the description! The finish was acceptable, I had ordered the white ones. I returned them.", 
    "These are being used in my dining room for some decorative items. For the price I think they're great. They are not very deep so they are only for holding smaller items. They are also not amazing quality and the \"template\" to help you drill the holes in the right place on your wall is \"slightly\" off. Overall they work well for the price.", 
    "It was good. I liked it.", 
    "can be hung in various ways and I like that a lot", 
    "These are not the best quality. But ok for my extra bathroom.", 
    "They look great...love them!!!", 
    "These worked out perfect for the space I had for them. Easy to hang and look great.", 
    "I use them for trophies in my office, decent strength and design.", 
    "Easy to put up Great deal for the price", 
    "Easy install they are exatly as pictured. Would buy again", 
    "Easy to install! It makes the house look more lively!!!!", 
    "it good great on my wall my family have gave me comments on the shelves had to buy another set.", 
    "Perfect for what I need them for. Smaller then I had expected, but beautiful.", 
    "Easy installation and perfect for any room.", 
    "I absolutely love it! They look awesome on m wall", 
    "The shelves look just like in pictures, nice material regards to the price. The anchor didn't really fit in the wall but you can just hammered it in. However there's a defect on the smallest shelf. The screw can't slide through one of the hole on the back of the shelf, so we had to readjust it a little and it most likely won't hold anything heavy at all as it will tilt the shelf. These serve their purposes (decoration), no major complaint.", 
    "Perfect for displaying items.", 
    "bought the white set for my daughters room and they were so easy to put up and look amazing!!!", 
    "fast shipping and very good seller", 
    "These shelves were not too difficult to install. You know measure twice drill once. Make sure you have a level and you might want to get some better mounting hardware, the stuff that comes with it is ok if its straight wood but wallboard your need beefier toggles.", 
    "Good price, east to install.", 
    "Love them, fit perfectly in my apartment", 
    "Ordered white shelves got dark ones. I called and Overstock reordered them in white and I got dark again. I kept both sets and painted them Overstock, don't advertise what you don't have.", 
    "Just as described worked very well for what I needed", 
    "I use it to display small sports memorabilia.", 
    "not too easy to install but i loved it, it looks good, serves its purpose", 
    "Enjoy the way it displays my wares", 
    "They look great in my bathroom", 
    "We hung them above the toilet in the bathroom and they are perfect.", 
    "Look pretty at my son's toom and my living room!", 
    "I have a small space, and hanged them together, forming a drawing. very versatile", 
    "Great item and quick delivery", 
    "Great price for these floating shelves - a really nice way to show off your collectibles. I bought two sets and they look great on my wall.", 
    "Loved it, very cute & great price", 
    "The provided template to mark and level is real handy.", 
    "good buy, looks really nice on my wall", 
    "Great little accent on a narrow wall, simple to hang.", 
    "These are a huge disappointment. Cheap craftsmanship.", 
    "Pretty good quality, however they are not as long as they look in the pictures. I suggest looking at the dimensions so you know the exact length of each before buying. Still nice shelves and if dimensions work, definately worth the buy. Looks great in my bathroom.", 
    "These are nice accent shelves; they are attractive and interesting on the wall.", 
    "Love this product, good price and good quality!!!", 
    "Perfect for those things you want to display but don't want a toddler knocking off the shelves that they can climb or worry about a bookcase toppling.", 
    "Didn't like the way they went in the wall, couldn't get a super flush fit but they look nice.", 
    "They are okay if you want to use it for smaller items.", 
    "I ordered these in white and installed them in a bathroom. The color, quality and ease of installation was all great. I have gotten several compliments on them from guests.", 
    "These are a unique and attractive addition to my bathroom, and can be arranged so as to keep the wall balanced. Well made, too.", 
    "Cute and great for a small space.", 
    "Perfect and contemporary look...awesome after assembly", 
    "These functional and versatile shelves are well made and can be hung with the ends up or down. I have bought three sets and love them.", 
    "I think the shelves are quite useful for small items on the wall", 
    "I had a very small space I needed a few shelves, . They even provided a template making it easier to level when drilling the holes.", 
    "I like the shelving - great price but haven't installed them yet.", 
    "Good piece for bathroom wall", 
    "Very nice, well built, just what I wanted.", 
    "They are okay. I expected them a little bigger but I manage to find something to use them for.", 
    "easy to put up. Looks great in the bathroom.", 
    "looks great Excellent, soon ill buy few more", 
    "I bought these, not sure of their true functionality. I love them, easy to hang (came w/perfect directions), and they look amazing on my bedroom wall!!", 
    "I was expecting to be able to use these shelves in both directions: shaped as a \"U\" and an flat side up. This is not the case. They can only be used one way.", 
    "Hard to hang.. I gave them away", 
    "perfect for books and decorations!", 
    "Very well made and sturdy on the wall! They are -very- dark walnut, almost black.", 
    "Not as long as expected but still worked", 
    "The shelves are beautiful.", 
    "Put them over my office credenza and they look great. Fill a 36 inch space nicely", 
    "Wood color is nice and attractive, the wood extends from the wall maybe an inch or so, so you probably would not install where there isn't enough room(hallway) people or guest might bump into it.", 
    "I truly love this piece of art it brings out beauty in my living room.", 
    "This was a gift and she loved it. She said it gave her more room for her photos to display instead of all on the tables. And on one she also was able to display small figurines.", 
    "Easy to assemble and when placed in the right place, they can look quite stylish", 
    "Got these in white for my bathroom for make-up, perfume, candles, you name it. Were very easy to hang and they make my bathroom look kind of whimsical with", 
    "These shelves are very easy to install and would be an great addition to any wall.", 
    "This product was perfect for decorating my bedroom. It's pretty good quality and came with instructions and items needed to hang it up on the wall. It also seems to be pretty sturdy.", 
    "Good quality love them in my sons room beautiful set place nicely in a room. Displays all special gifts that were given to my son when he was born", 
    "Love the slim style and dark color...enhances my decor", 
    "Purchased these for our guest bathroom. Looks great. Quality is good. Would strongly recommend.", 
    "Great little shelves you can place almost anywhere without using much wall space.", 
    "The shelves are super small not at all what I expected and they aren't very stable.", 
    "Nice touch to den or living room. Nice shelving you can put anywhere.Excellent for nick nacks or photos", 
    "I bought a set of these little shelves and love the way they look on my wall. They have the nails and the holes on the back to hang them straight and easily. In fact, I am going to buy another set for another room.", 
    "Easy to hang , came with measured lines and working pieces. Big enough to hold frames on the shelf. Arrived on time, no complaints. Plan to order more.", 
    "Very cute! I used this for my girls reading room. This is easy to install. It comes with a hole chart to mark the wall!", 
    "I am using these floating shelves as bookshelves in my son's nursery. I love the modern look they provide!", 
    "The product really match my other furniture in my living room.", 
    "I bought this as a gift for my sister for her new apartment. She enjoyed it and has finally hung it up after a year! :)", 
    "Good deal! Happy to discover the great deals at Overstock.com!", 
    "Although the shelves are lovely, they are extremely difficult (close to impossible) to mount. The mounting devices fall into the wall whenwe tried to put the shelves up. This is totally unacceptable. If my husband was not as handy as he is, I would have sent it all back.He had to improvise a hanging system to get the shelves on the wall.", 
    "Hi. I purchased these shelves for my daughter's room and have been very happy. They were easy to install (thanks to a handy measuring 'tape' included with the directions) and have held up well. Definitely a good buy.", 
    "These are perfect to store and display my face cream and makeup brushes (in attractive glass containers) on the wall in a bathroom with no medicine cabinet. Not very wide, so I couldn't fit my orchid plant so I had to figure out something else for that, but otherwise a great solution!", 
    "Easy to fix, looks much more expensive than the price & good quality too.", 
    "Great product. Priced accurate and performs as advertised.", 
    "Great product...however I hoped to have used the product non U shaped but the grooves for the screws are only designed for a U shaped hold. I still managed to use the shelves, not how I wanted but it was still functional. I would recommend to others but dont try to use upside down.", 
    "Shelves look nice and I think that they are a good value.", 
    "You get what you pay for. I like them but not anything special.", 
    "it's very easy to install and nice in decor. I will bay it again.", 
    "The floating shelves are the same as the website regarding color and size. They only took a few moments to hang and look terrific, just be aware they are not very deep and only suitable for small items. I have some 1930's cups and saucers that look perfect and I am very happy with the product and the reasonable pricing.", 
    "Cool shelves that can be used either side as a \"U\" shape or upside down for a unique shape. Overall I am pleased with my purchase.", 
    "Super fast shipping, great product. Awesome price.", 
    "These shelves are perfect for my bathroom. I painted them black to match my decor and I just love the simplicity of them", 
    "Love the shelves! I installed them on my kitchen wall and I'm using them as a 3-part spice rack. They look great. Easy to install. I think they will last a while.", 
    "Excellent addition to my \"man cave\" walls. Easy to assemble.", 
    "Shelves are much smaller than I expected, although site description was correct when I looked back to check. Good quality, made for a smaller wall than I planned on hanging them on!", 
    "Need a drill to create hole for screw sheath for actual screw.", 
    "Looks better on line than in real life. I would not recommend this item", 
    "The Floating Shelves is what I was looking for \"they are Great\"", 
    "The shelves are awesome! They look beautiful. I was confused hanging them because the instructions didn't have any words, just pictures.", 
    "I wanted these 3 shelves to stand battery operated candles in a dark stairwell. They worked perfectly.", 
    "Decent quality for the price, dont expect solid wood construction. Light weight hollow core, easy to install and secure to the wall, dont put abything heavy on it, unless the you use a stud finder and secure the mounting screws directly to some wood. Its just common sense that any shelves mounted on to sheet rock and not the studs behind is very limited in holding power.", 
    "The shelves are a pressed wood with a fake dark print of wood grain, so I was disappointed with them at first. However, I decided to hang them anyway and they look really good on the wall.", 
    "These shelves look much nicer in person than the picture shows. I just love them. THey are sturdy and look fabulous against my grey/blue walls. Very happy with these. The price is phenomenal - I expected a lower quality at this price - but they are actually very good quality.", 
    "Bought three sets of these shelves to display pictures in an empty nook. Used the smallest shelves for a some accessories. Turned out beautifully and I have received lots of compliments on it. Very pleased with the product.", 
    "The shelves are great accent shelves, we placed two sets on each side of our flat screen tv and it loods great, easy to put up and good length and width to dsplay, candles, books, etc.", 
    "These shelves were very easy to assemble. I would by them again.", 
    "Good shelves for the money. up close they look cheap but I put them high on a tall wall and they serve the purpose just fine", 
    "Very sturdy, and simple to put put up. Can be put different ways for different looks, which is great.", 
    "The shelves look really good above the bed. We actually are using the bottom two (the smaller ones) for keeping our cellphones, watches etc. while sleeping, and the top one holds pictures. They add character to the room. They were delivered in time, and were easy to mount, modulo some amount of drilling and hammering through the walls.", 
    "I needed something that added character to my wall and these did just that. Perfect for small light books and items as they are not very deep."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Floating-U-Walnut-Finish-Shelves-Set-of-3/6783148/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6783148/Floating-U-Walnut-Finish-Shelves-Set-of-3-3022540c-ae82-49fc-88e6-7b4f4dc964eb_600.jpg"
  ], 
  "description": "This set of 3 nesting 'U' shelves makes space utilization efficient\nand is perfect for displaying your favorite books, collectibles,\nphotos, toys, awards, CD's, videos, decorative items and more. They\ncan be hung with the vertical sides either up or down, according to\nthe effect you want to create. With the vertical sides up, it is\nlike having a built in bookend. With its contemporary walnut\nfinish, they are the ideal accent for any living space. Minor\nassembly is required. Use these decorative shelves to make an\nartistic display with pieces of your prized collection, or turn the\ntables and use them for a utilitarian purpose. These compact\nshelves are made of durable, laminated MDF and fit onto small walls\nin kitchens to store spice jars or in laundry rooms to keep\nessentials close at hand.Colors: Walnut and whiteFrame materials: Laminated MDFFinish: WalnutSet includes three (3) nesting 'U' shelvesNumber of shelves: Three (3)Hardware includedMaterials: Laminated MDFStyleContemporaryMaterialMDFFinishLaminate, Walnut FinishAccent TypeDisplay CabinetsShelf TypeBookshelvesAssemblyAssembly RequiredColorBrown, WhiteFurniture Frame MaterialWoodNumber of Shelf3"
}