{
  "name": "Furniture_of_America_'The_Crate'_Square_Coffee_Table_with_Open_Shelf_Storage", 
  "price": "EUR 205.75", 
  "reviews": [
    "I adore this coffee table. It's unique, sturdy, practical (lots of nooks & crannies for storage or decorative pieces) and gorgeous. It looks much more expensive than it actually is. I've never assembled furniture before so initially I was intimidated to put it together but it turned out to be a breeze. Absolutely no regrets with this piece. It would be 5 stars all the way if it was real wood.", 
    "The table was easy to assemble. It is small but is perfect for our nock in our L shaped couch. It is also lightweight so it's easy to move around and clean.", 
    "I was impressed that the coffee table arrived quickly and the package was not damaged from transport as I live in Hawaii. However, there was one crack line on the surface of the board, it seemed cosmetic so I will use a furniture marker to cover it up instead of returning it. The item is exactly as shown, my husband and I were very happy with the purchase. I would of given a 5 star but due to the crack line I gave it a 4 star.", 
    "Everyone that sees this piece loves it. It took a really long time to put together, though, and I've put numerous pieces of furniture together. If you have a free afternoon and need a stylish new coffee table, I'd definitely recommend this one.", 
    "I was so excited about this table I got home at 9:30 pm and wanted to stay up to put it together. Unfortunately I only got 1 screw completely screwed in and two half way screwed in. Why you ask? Because of the horrible SHODDY screws that were provided. There are 40 to be exact that need to be screwed in with an allen wrench, which is provided. The first one was tough and started squeaking immediately from how hard I had to push to get it to screw in. The 2nd and 3rd the same, except more tough than the first. So tough that I could only screw them in half way before I single handedely stripped both screws. I'm strong, but not that strong. This is just poor craftmanship and after a trip to lowes to get more materials to put this together tomorrow I will be happy when I never have to put this together again! I WILL NOT recommend this to ANYONE!!!", 
    "This piece adds a unique touch to our living room. Already got many compliments for the same. This is not real crate as I thought, but processed wood. But it has got a smooth finish and the walnut color is really nice. Assembly was not difficult. Overall, very happy with the purchase. Thanks to overstock for the free shipping.", 
    "I wasn't expecting this quality for this price, great value. Delivery was as described, right on time (a little heavy for an old man but not too bad. Assembly was a breeze, directions were adequate, parts were all accounted for. Even with two arthritic thumbs it only took about three hours to assemble.", 
    "The table itself looks great, but that's about it. It was a pain to put it together. Each plank came as a separate piece and we spent all weekend assembling it. The screws that came with the table (about 40) were very hard to fix - they easily go into the wrong thread, which would make it impossible to pull it out or to push it in. Overall, we liked the design but the instructions were poorly written and the parts (screws and wheels) were very poorly designed.", 
    "My son in law stated it was very difficult to assemble this because some of the pilot holes weren't drilled correctly. Other than that, it has great style.", 
    "Love this table!!! It's on casters, so can go anywhere easily!!! Use either a cocktail/coffee table (I'm using it as a cocktail table) & got the coordinating corner table!!! My guests always remark how good the two look!!!", 
    "Good size, easy to move, plenty of storage space and looks great.A little complicated to assemble, you will need a extension to manipulate the allen key.You only need to put glue in one side of the sticks and it will be enough.The paper stickers are fine to cover the screws, be sure to put it in the right direction of the patterns. You will be very satisfied with the results. Good luck!", 
    "the finish is not veneer as in describtion but plastic with painted wood patern.", 
    "This table is really nice. We got multiple compliments on it. But as some reviewers mentioned, the bolt holes are open and come wth wood grained stickers to cover them. Those stickers make the table look really cheap! So I went and bought 3/8 inch round head wooden button plugs with shoulders (shoulders are critical to keep the plugs looking uniform -- plugs with no shoulders will insert into the bolt holes at varying depths and will look bad.) I stained the wooden plugs with dark wood stain and then glued them into the bolt holes. Although the plugs are not flush with the side surfaces of the table, they make the table look much classier. Also, be very careful not to overtighten the bolts!! If you do, they will cause bulges on the various surfaces of the table (on the side of the bolt holes).", 
    "This table is very pretty and was put together with no problems. I like having the extra space below and that is goes all the way through the table, works well for my small dog to fit through and nap inside.", 
    "I love my new coffee table. Very unique and contemporary. The only draw back was the installation cause it comes with so many holes and parts, but the result was gorgeous coffee table.", 
    "Took a while to put together but when I was done I realized it was worth it. Very sturdy. Easy to maneuver. And looks great.", 
    "Overall I like this table. Color is just as shown in the photos. I don't care for the wood grain sticker material that is supplied to put over the screw heads but that is a minor issue. Assembly went pretty good. I recommend using a cordless drill or screwdriver with a 4mm hex bit. Assembly will go so much quicker. Also you will need more glue for the dowels. I may put on taller casters or perhaps attach blocks on the bottom to raise the supplied casters.", 
    "I LOVE this table! Kinda funky and seriously awesome. We had no trouble putting it together and it looks great!", 
    "Nice table but it sits a little shorter then expected and it takes quite a bit to put together. Other than that I love it.", 
    "It looks beautiful but lacks quality.. overall a good purchase for the price", 
    "We love love love our new coffee table. Although it was super tough to put together it fits nicely in our living room. We also opted out on putting the wheels on it because they looked cheap compared to the table itself. Definite recommend!", 
    "This coffee table really looks amazing in our living room. However, the process of putting it together was kind of a pain but in the end I think it was worth it. One star deducted due to the difficult and time consuming assembly.", 
    "I have been using this for about two weeks now and no complaints so far! Yes, it took a few hours to put together but was not difficult, only time consuming. Sturdier and better materials than I expected at the price as well.", 
    "Easy to put together and looks great with my couch. It is perfect for our projector to sit in and be hidden.", 
    "For our small space and our sectional it's the perfect size. Good luck putting it together but once it's ready it's just as bold as it looks in the pictures and we love it", 
    "This is pretty good looking piece.Get a power tool to assemble it it has a lot of pieces.", 
    "It is cheap but i expected more. Returned the first shipment because it had broken parts. The second one also has a few chipped ends. That might be UPS fault but the built quality is also very low.", 
    "Easy to put together and shipped way faster then expected!", 
    "I got the weathered white It looks great in my space but it took about 5 hours to put it together- way longer than I thought. The instructions are clear but for a majority of the big screws it took a great deal of effort to use the bloody allen key to screw it in. I thought my hand was going to fall off and have taken 2 aleve. I sprayed some WD-40 on the screws and it did seem to help make it smoother a little bit.", 
    "This was a nice piece however it took forever to put together due to the screws constantly stripping.", 
    "It was hard to ensemble but it looks good in our living room.", 
    "The table was purchased for my daughter and she loves it and it's a great centerpiece in her living room.", 
    "Good quality, took under 1 hr to assemble. Love Love Love this table!!!!!", 
    "Once assembled it looks great. Issue is with the long screws attaching each of the parts. Drilled holes in pieces are a little too small so getting them properly screwed in was a challenge. Worth the effort.", 
    "Its very useful , adds nice decor and space for many small things", 
    "Although difficult to assemble this coffee table is a perfect size and looks more expensive than it was! I love it!!", 
    "Not hard to put together. Pretty sturdy. so far so good.", 
    "I was so excited to find this coffee table that I saw in a Pinterest picture!! It is well made and beautiful and looks just perfect in my cozy living room :)", 
    "This is really a great looking piece of furniture. Not as fun to put together alone, I would highly recommend a partner when putting it together. Hubby would usually be of assistance, but I was on my own for this one. ; )", 
    "I LOVE this table. Gave it 4 stars instead of because it was complicated to put together and requires either someone who knows what they are doing or a lot of patience. At least that was our experience. But it looks wonderful and is exactly what we wanted. The indent in the middle is a great design!", 
    "Love the design and space... easily blend in with my furnitures.", 
    "Satisfied! I had lots of compliments", 
    "Took my boyfriend a long time to put this together. The screws and tool were of very low quality. Once he was finally able to put it together it looked great with the exception of the stickers provided to cover up the screws. Looks cute though!", 
    "It took a little work to put together but other than that this is an awesome addition to my living room!", 
    "THE TABLE LOOKS GREAT. IT WAS NOT EASY FOR ME TO PUT TOGETHER, BUT IT IS TOGETHER AND IT LOOKS PERFECT.", 
    "Perfect feel to my family room!", 
    "I expected a sturdier product. Hard to assemble and it looks a little cheap but serves its purpose and I like the size.", 
    "Very satisfied customer. The table is a little smaller than expected but that's my fault because I didn't pay attention to the dimensions other than that it's great", 
    "This coffee table was a pain to put together because of how hard it was to tighten the screws. My husband had to put gloves on to prevent blisters. It looks amazing and worth putting together.", 
    "The only problem with this table is putting it together which was rough on my arm.", 
    "It's perfect for a small apartment. Good quality and sturdy!", 
    "Could be more sturdy but cleans easy", 
    "It is small, but suits our space. We are happy with this coffee table.", 
    "Easy to put together; beautiful table for the price.", 
    "Unique, and arrived quickly. Looks beautiful with my light grey sofas, visitors have already mentioned that they want one just like it.", 
    "If I had know how painful the assembly would be, I wouldn't have bought it. The top veneer layer also came off at 2 corners before it was even set up. It looks good though now that it is finally assembled, and the corner layers have been super glued...", 
    "Very easy to put together, very stylish and sturdy too. Highly recommend it!", 
    "This is great. A bit too long ro assambly but gorgeous! I'm so happy with it!", 
    "Different style, unique, great item. Great talkative piece. Goes well with any style home. Amazing product!!!", 
    "Proper guide was not provided; took a call and connection to three people before I got a usable guide - still not the correct guide. Holes had to be re-drilled, not enough glue provided. I have put together many pieces of furniture over the years, and had a business where I built with wood for customers; if you're experienced be ready to take 6 hours to put this together, if you're not experienced get someone else to put this together for you, or don't buy this. I give this three stars ONLY because once it is together it is very nice and usable.", 
    "Make sure you have your own tools for this job and don't rely on what comes with the table.", 
    "comes with a crappy allen key and holes not big enough. screws are very difficult to get in. Had to get an allen key attachment for power drill as it was impossible to set up.", 
    "Easy to assemble. Versatile. Cost-effective, AND LOOKS GREAT!", 
    "looks great in our living room!", 
    "It took my a good 6+ hours to assemble and its not easy trust me i was so frustrated with the assembly process. some the nails will only work with the tiny tool they provide. overall i have thought multiple times to throw out the product during the assembly process but finally i was able to fix it with few peoples help . I would definitely not recommend this product for anyone.", 
    "We got this as a wedding present and the kids love it! It fits a wide range of decor. I'm sure they will have it for many years to come.", 
    "I ended up giving up putting it together and paid a handyman. It took 2 handymen 1 hour to put it together. Take the stickers off BEFORE you put it together.", 
    "I consider myself pretty good at assembling furniture; however, this was work! It took me about 4.5 hours. It wasnt hard, but a lot to assemble so prepare yourself!", 
    "We love this table. Purchased for an Asian theme living room. The deep center we put a zen garden with white sand. Gorgeous!", 
    "It was mildly difficult to assemble, but once it was put together, it was beautiful!", 
    "I really like how this table looks in my living room, and it is the perfect size for an apartment. The storage space is handy. It took quite a lot of time to assemble and the allen wrench it came with for assembly wasn't the best, but we had tools that made it okay. Time spent on assembly was worth it htough.", 
    "Great quality, love this item!", 
    "Good value for money. Took some time to assemble as it requires Allen key but overall excellent unit. The edges tend to be a bit sharp otherwise love it.", 
    "The only con is that you have to put it together using a small allen wrench and when you're done your fingers hurt from turning the small wrench.", 
    "Exactly what we looked for, easy to assemble and sturdy in our living room.", 
    "Piece looks great once together. Packaging was good, no damage. Only complaint was difficulty with construction. Allen wrench is provided to bolt everything, but the holes weren't predrilled properly. Had to crank every bolt to get it flush with the wood. I'm not the strongest, but I've never had trouble putting anything else together.", 
    "A little hard to put together.... But I look just like the picture. Everyone who come over loves it!", 
    "The pins that hold the center floating drawer keep falling out, it's just a matter of time before they either get lost or the drawer becomes unusable.", 
    "Great product. Looks elegant.", 
    "great............................", 
    "This is a lovely piece but the allen wrench items were a little tough to screw in completely.", 
    "Wood looks very real. Table is sturdy, if you can follow directions it is not hard to built.", 
    "Love this piece. Looks great in my living room. My grandson loves the box in the center, uses it as his garage for his cars.", 
    "Love this table! Good for storage and decorative", 
    "I absolutely love this coffee table. Very unique.", 
    "This is an awesome table with a lot of space and very contemporary look. Loved it !!", 
    "Beautiful. Easy to put together. Love it with the end tables.", 
    "I think this table is pretty good. It's smaller than I expected and it isn't actually made of wood. Looks nice and wasn't too hard to put together.", 
    "product is nice and was easy to put together", 
    "It looks nice. It is similar to Ikea assembly and Ikea quality. But, for the price it has a nice aesthetic.", 
    "I really do love this table and it is everything I wanted! give yourself and hour at least to put it together though. Its not hard to put together just time consuming!", 
    "you get what you pay for I guess. Cheaply made.", 
    "lol long putting it together but fantastic look!!", 
    "It took a while to put together since it comes all in pieces, but the quality is good and the table looks great. Love all the nooks in it ... very unique.", 
    "Great buy...fits elegantly in my living room!!!", 
    "Great coffee table, great color, great design, just not the greatest quality. All in all, it is a great buy!", 
    "We are quite pleased with 'The Crate' coffee table. my husband was a little taken back by the size of it at the outset - he thought it was too small for the room - but once he got it in just the right spot it was perfect for the flow of the room. I'm still in the process of styling it, but so far I love it.", 
    "Well packaged and protected during shipping. Easy for one person to assemble. Looks exactly like pictures! Very pleased!", 
    "lovely table once u put it together.....great for the price except I had to hire someone to put it together....many, many pieces and a stinky little tool", 
    "The product Quality was not what I was expecting. Additionally, far too much assembly was required, pegs, glue and screws. All together there was over 100 pieces. The problem with particle board is that if you screw things up, the product is basically junk.", 
    "Had this shipped directly to my son. His comments were that he had a little struggle with starting the process of putting it together - just pictures, no directions. He was very happy with the final result.", 
    "I LOVE this coffee table-it has room for things to be put in the sides as well as on top. The optional tray/middle section is great for remotes and drinks that I don't want my cats to knock over when they are playing. It has great sides for pictures and trinkets to be displayed. TAKE YOUR TIME & read the directions so you put each side together carefully. I didn't install the rollers on the bottom so I don't know about them.", 
    "It took me 2 days to put this together. The first day my hand hurt so bad from using the allen wrench. I don't have lots of tools on hand, but luckily I found an allen wrench grip holder and it made it a breeze after that. I love the look and it works great in my living room. My only problem was putting it together without an allen wrench grip.", 
    "This is a good coffee table for the price. It fits perfect in the space I needed it for, I have a couch similar to the one pictured. it was easy to put together and I love that it has wheels and is easily moved around by the handles. Only negative, the corners and edges on this table are sharp, wouldn't be good in a home with small children.", 
    "We got a new sofa sectional so I was looking for an affordable, unique coffee table. This table is very sturdy and looks great. Even my older kids think it looks great. It's nice to have the open sides to set things in. It arrived on time and in perfect shape. Shout out to UPS for the delivery.......it was a heavy box. The only negative is it does take a bit of time to put together. And for me that's what my husband is for.", 
    "I really like the look of this coffee table but it's not real wood. My friend put a piece of tape on the corner of it and the entire finishing of wood ripped off. Not thrilled but you get what you pay for. I would recommend trying to build this yourself instead of wasting the money on this flimsy table.", 
    "Very happy with the item, looks great and was easy to setup. Looks better than it did in pictures at overstock website-really pleased with this purchase. One down-side is the cheap covers they included to cover the screws. I decided not to even bother with them and just left my screws uncovered. Gives it a rugged, rustic but classy look-I think. Overall, great purchase.", 
    "Looks really good! Nicely made but takes time to build", 
    "This table goes extremely well with my house theme. It's good with being low profile. The quality build is amazing as well for the price. Overall I love it!", 
    "The table is beautiful! I love it but the assembly took me almost 5hours! It's crazy", 
    "This is the center piece of my living room and is a conversation piece", 
    "Love how this table looks and it was easy to put together, but unfortunately does not hold up very well. My son has had it for a couple of months and they have some issues with chipping.", 
    "Easy to put together and very sturdy!", 
    "I purchased this and i am very happy with the quality and storage space. It was a little tough putting together as the screws require an a special wrench (that is included) but the tool is small and hard to work with.", 
    "I love this table. Before I moved into my apt I was looking for a nice table and saw this on Pinterest. After searching I found this table. Wish I bought two", 
    "The table looks nice, pretty easy to assemble, but it does not seem to be sturdy enough to withstand the everyday abuse from young kids.", 
    "This piece was easy to put together and I like that it's on casters so it's easy to move for vacuuming. The dark stain does show the dust more quickly of course but we wanted a piece that the kids could put their feet on, eat at and play games on that would look OK even beat up over time. We've had it over a year now and looks good despite wearing at the edges from shoes and minor scratching (which you could probably fix with a furniture marker). We store games, free weights and small photo albums on the shelves as they're pretty shallow. The center square is made with pretty flimsy wood so won't hold anything heavy but we use it for the TV remotes or we flip it to lay flat when we play games. Overall a good purchase.", 
    "This is perfect for our sectional sofas and the wheels are a bonus. Now for the BUT! It took our son who can do anything over three hours to assemble this with help from our daughter who arranged the many, many pieces. BTW: They both are in their 40's in the event one might think they are children", 
    "It looks great. However, not real wood, so don't expect it to look like a high end piece of furniture.", 
    "Good value, a little challenging to assemble but got it done and looks great!", 
    "I got the dark oak color. It's gorgeous. Love the storage along the sides. I will say, it takes a while to put together. Make sure you read the instructions and it is more of a 2 person job (putting it together).", 
    "Everyone loves it! I've gotten so many compliments on how unique the piece is. Great buy!", 
    "Yes, like most reviews say it does take time to put this together. This is because you have to manually screw in every part. No power tools! My husband built this in two days. Mostly because his hand got tired the first night. I helped him finish the second night. But it's soo worth it! This is my favorite piece in the house and we've gotten lots of good comments. There was a chip on one of the panels, you can tell this was due to shipping, because the box was dented in. But the table comes with stickers the same color of the table that you can use to patch up any flaws. Definitely would recommend.", 
    "Love the table but it took me a couple hours to get it set up.", 
    "we love the table, fits right in with our decor, quite unique. Shipping arrived quite quickly. Thank you", 
    "I got the espresso finish, I would've liked it to be darker", 
    "Happier than a lion when his trainer walks into the cage wearing a pork chop jacket.", 
    "The box was handled terribly in shipping and yet nothing was damaged! Was surprised at the amount of assembly this required. Be careful not to over-tighten some of the screws. It looks okay, but we have bumps on the top surface where screws were over-tightened and doesn't look that great, but our fault. For the price, it's decent and I would probably buy again, but it's definitely a \"fake\" finish on it. The casters are great to move it around easily and it's really sturdy.", 
    "I like my table and the size is just right. I live in a single bedroom apartment and didn't want something too big. I assembled the table by myself and it was pretty easy to do. The only problem with my table is when I tightened one of the screws at the bottom it broke through the bottom panel and a piece of the wood splintered off. Thank goodness it happened on the bottom of the table so nobody can see it. I even left the wheels off. I like all the different angles and storage space it has.", 
    "love this table looks great in the living room", 
    "I love this coffee table. It may not be the most comfortable place to put your feet, but the tray in the center is a good place to keep drinks safe from curious dogs. (Very important in our 3-dog house.) It's easy to wipe clean. The four spaces in the bottom are great for displaying pottery (or whatever) or keeping books and other media. Having wheels makes it extra easy to move. The wheels lock when you want it to stay put. I would have given it 5 stars, but it was difficult watching my boyfriend put it together. Seriously though, it was a little difficult to put together and the illustrations for doing so weren't great, so it was a bit frustrating (for him). In the end, we both think it was a great purchase.", 
    "I really like the design of this product. Even though the material is not high quality but just like the regular ikea thing, but still good for the price you paid", 
    "was pleased with the way the table looked once I assembled it.", 
    "It is a great unit and very useful", 
    "wonderfull,eveyone whos seen it likes it tooo", 
    "Easy to assembly and looks beautiful. This is a wonderful item.", 
    "Once assembled this coffee table gives the appearance of being stain crates a fixed together into a coffee table. The illusion is good, but not great. I attribute this to the need to design a table that's sturdy and firm and indeed once assembled this table is rock solid. It took me about 90 to 120 minutes to build. This is largely due to the number of screws and dowels required in the assembly. I'm very happy with the table, one star off for not looking 100% authentic. But I'm willing to accept that given how well this is engineered and it's sturdiness.", 
    "This table is quite large - we needed space for storage and this has plenty! It is sturdy and looks great. The only drawback - there are some elements that are a bit cheap - stickers to cover the screws as opposed to wood, but small complaints, especially for the price.", 
    "I wasn't sure if I was going to like this but it exceeded my expectations. It looks great not cheap. It wasn't hard to put it together. I would buy it all over again.", 
    "This table is pretty cool looking, however the quality is very poor. The particle board chipped and split while assembling. The screw covers are made of paper, not even worth putting on. I am not overly happy with it and I will be trying to talk to the company.", 
    "This is a very unique and stylish piece of furniture. The size was perfect for our needs Easy to assemble. I would have preferred such beautiful design to be made of hardwood instead of particle board", 
    "I'm very happy with my purchase. The table looks great, very unique and stylish. However, it was a bit of a pain in the .. to assemble. The parts are not the actual crates but basically flat pieces of wood, so even each crate has to be assembled separately. Also they are not actual crates because half of the bottom is missing so you can basically look through the sides of your table once assembled.", 
    "Great quality! Constantly receive compliments on this table.", 
    "Very pleased with this product! Easy to put together and very sturdy! I love that it comes in a variety of colors. You won't be disappointed!", 
    "Love this table! Adds a nice touch to my living room and I love that I can roll it out of the way if needed. When mine came however a little corner of one of the panels was damaged probably during transit. Otherwise it's great!", 
    "The coffee table definitely works well as a center piece. I have the \"weathered white\" color, which has a nice beach house/coastal feel. The quality of the \"wood\" isn't the greatest, but it's sufficient for gentle use and looks good from afar. Putting this piece together was laborious, and took a toll on my fingers. There's a lot of Allen wrenching. I would suggest making this a two or three person job just to divide up the labor, but one person can definitely get this done in a couple of hours. Pro-tip: Use an Allen wrench sleeve or some sort of barrier between your hand and the Allen wrench. Overall, I'm pleased with this piece after one week use.", 
    "love it! it did take a while to put together and an electric drill is ideal, but it really is a beautiful piece of furniture, sturdy, no imperfections. i was a little worried reading other reviews but this was a great experience :)", 
    "Arrived on time the build was not that bad, I was able to finish within and hour. The instructions are simple to follow and it looks great in my living room", 
    "Arrived on schedule and its definitely a great addition to my living room along with my L-shape couch. I have a terrible tendency to loose my remote in between the seat couching, so I been forcing myself to always leave them remote in the convenient center shelve in order to keep better track of the remote. I have always hatted to look for something that was in my hand a second ago.", 
    "Table makes my living more stylish It's a fantastic table to display n store stuff", 
    "Putting this together took a bit of time---you end up using glue for some parts and you have to be careful to wipe it off so that it doesn't become visible when it hardens. Some of the strips (very small) are stick on vinyl which I don't like but don't detract from the look unless you know what to look for. Overall, I am pleased since it is a \"budget\" item and I felt like I got what I paid for.", 
    "The finish on the \"crates\" is poor. I can see the runs in the paint. Or at least that is what it looks like.", 
    "Nice piece of furniture and fits our room well. We didn't expect it to come in so many pieces though. We thought some of the sides would be fully assembled but every slat had to be fastened together. It took better than an hour to build and would have taken longer if we didn't have a power screwdriver.", 
    "This table appeared it might be a little weak and not durable online but once it arrived and was easily put together looks more amazing, solid, and a better color than what I could have even hoped for. Highly recommend this to anyone wanting a cozy nook or country cottage theme!", 
    "Even though it is fiberboard and veneer, this table looks good and is very practical. I like the casters and the storage and the square shape is perfect for my living-room.", 
    "Well, here is the issue. When you look at the table in the picture, try to envision having to assemble every piece - and I mean every piece. I am pretty skilled and I never had to work so hard putting a piece of furniture together. The instructions are pretty bad, and even the English is bad.Once you put it together it looks decent, but if you don't have at least three hours and a ton of patience, don't bother.", 
    "Like the style. It is on heavy side, but 8 of the screws were too short, so I had to buy longer one from local hardware store.", 
    "", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-The-Crate-Square-Coffee-Table-with-Open-Shelf-Storage/8753455/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8753455/Furniture-of-America-The-Crate-Square-Coffee-Table-with-Open-Shelf-Storage-4e598971-6595-4257-b811-0dbe99014255_600.jpg"
  ], 
  "description": "This square coffee table inspired by artisan wine bottle crates\ncombines elegance with practical function. The four open shelves\neasily hold your books and knickknacks, while the stylish top with\nkeyhole accents provides ample space for coffee mugs and magazines.\nAdd a vase or clock to the center flip box tray insert to\npersonalize the wood coffee table with your own style. Set includes: One (1) coffee tableFour sided open-shelf storagesInspired by artisan wine bottle cratesCenter flip box tray insertKeyhole accents for added classic styleMobile structure with smooth, moving wheelsDurable medium fiberboard and veneer constructionMaterials: MDF, veneersFinish: Vintage walnut, espresso, weathered white       Flip box tray: 3 inches high x 9.5 inches wide x 9.5 inches\n  deepOpen shelf storage: 13.5 inches high x 20 inches wide x 13.5\n  inches deepDimensions (overall): 16.9 inches high x 31.5 inches wide x\n  31.5 inches deepStyleContemporary, Mission, Rustic, Transitional, VintageMaterialLaminate, MDF, VeneerTypeCocktail Tables, Coffee TablesFinishEspresso Finish, Natural Finish, Oak Finish, Walnut Finish, Weathered, White FinishShapeSquareAssemblyAssembly RequiredColorBrown, Natural, White"
}