{
  "name": "Furniture_of_America_Bauston_Modern_Espresso_Storage_Coffee_Table", 
  "price": "EUR 238.24", 
  "reviews": [
    "Just what I expected - lots of wonderful storage - took about 90 minutes to assemble.", 
    "Looks great in our new family room. Took some time to put together but well worth it. Very pleased!", 
    "Easy to put together, but takes time though. Looks good and excellent quality!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Bauston-Modern-Espresso-Storage-Coffee-Table/11069433/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11069433/Furniture-of-America-Bauston-Modern-Espresso-Storage-Coffee-Table-ea7c34b2-8b05-4b51-9049-b08c3531280c_600.jpg"
  ], 
  "description": "Let this spacious coffee table speak for itself while paired next to any seating piece. The understated storage compartments offer ample room to keep items stowed out of sight while the wide open shelf creates a designated area for display items.\r\nSet includes: One (1) coffee tableFinish: EspressoUplifted tabletop supported upon silver finished polesTwo (2) flip-down storage compartments with decorated acrylic panelsSpacious open shelf area below tabletop to display decorative piecesSimple, modern-inspired structure looks beautiful in any living spaceMatching end table and sofa table available, sold separatelyAll dimensions are approximateOpen shelf dimensions: 5.5 inches high x 43.3 inches wide x 23.6 inches deepStorage dimensions: 7.9 inches high x 20.8 inches wide x 19.7 inches deepOverall dimensions: 18.11 inches high x 47.24 inches wide x 23.62 inches deepShape: RectangleType: Accent Tables, Coffee TablesProduct Features: Includes HardwareStyle: Contemporary, ModernMaterial: Acrylic, MDF, Metal, VeneerAssembly: Assembly RequiredExact Color: EspressoFinish: Espresso Finish, Brown FinishColor: BrownStyleContemporary, ModernMaterialAcrylic, MDF, Metal, VeneerTypeAccent Tables, Coffee TablesFinishBrown Finish, Espresso FinishShapeRectangleAssemblyAssembly RequiredColorBrownProduct FeaturesIncludes Hardware"
}