{
  "name": "Furniture_of_America_Verena_Contoured_Leveled_Display_Cabinet_Bookcase", 
  "price": "EUR 221.99", 
  "reviews": [
    "I was looking for a bookcase that would not be clunky but could be placed horizontally and hold TONS of books in an interesting way. (I'm an English professor and avid reader, but I wanted my book display to have more of an aesthetic appeal.) This piece is perfect! It's sturdy and spacious. The various sized shelf areas are perfect for housing a variety of books - from large textbooks and reference pieces to small paperback novels. The shelving pieces are interesting but have a bit of symmetry, so once filled it doesn't look cluttered and jumbled. I like this piece for its ability to easily be used vertically or horizontally depending on the room it is in. (Right now I have it on an office wall with a collection of travel art above it which looks funky and interesting.) My only complaint is that two of the stickers (a number and China's quality inspection) were difficult to take off the exterior side of one of the pieces; I was unable to remove some of the adhesive, so I placed that side of the bookcase toward the corner. I'm definitely pleased with my purchase overall, and my more traditional boyfriend was also pleasantly surprised with how well it came together.", 
    "The product is of thick wood-product. It's not particle board but it's not oak, either. It is softer than regular wood, though, so be aware. The boards are thick enough that you can have 2 rows of books on 1 shelf; if you use it as a divider, you could have one side for one row of books, and the other side for another row. It's really great that way. Also, it comes with wall anchors and acrews to put into the wall. You choose where to input the screw on the unti, though, so be aware of where you put it. I really like this product (I brought 2) and it looks amazing. Though it was tough to put together by myself (moderately strong female), I was able to do so. Have a little patience, know that it'll take about an hour by yourself, and use the wood glue! I had a little trouble, in that one of my boards was damaged, and the replacement they sent was missing an insert. After about 10days, I finally got everything I needed. Be sure to look things over carefully and call right away if there is a problem - these babies sold like Hot Cakes, and they didn't have any replacement parts for me after my initial call. (thank goodness all I needed was the insert.)", 
    "It arrived when it was expected. Everything was neatly stacked in the box. Nothing was missing. It took about an hour and 30 minutes to lay everything out and to assemble the bookcase. The stickers that labeled each piece were easily removed. It will look great in any room. Can do so many creative things with this bookcase.", 
    "was very excited when the shelf arrived fairly quickly and the box wasn't that heavy. The box was a little damaged but it didn't damage the shelf. I was able to build it in one hour I am very pleased on how nice it looks and it is a beautiful shade of wood, It's sturdy enough to hold my book collections. I love it!", 
    "I was looking for a shelf for our guest room to display collections of family heirlooms and this was the perfect choice. The arrangement of the shelves is interesting in itself and they lend themselves very well to showcase objects. I'm also very glad I found a shelf without a backing... the dark background would have \"swallowed up\" the things I wanted to display. This display cabinet works just perfectly in our guest room and I am very pleased with the quality. And the shipping price? Awesome.", 
    "This is an excellent bookcase, display case, very sturdy, nice design. Easy to assemble but does require a couple screwdrivers and some elbow grease.", 
    "Looks terrific in my living room. Easy to put together but your hand gets tired using the little allen wrench for an hour. Would have been easier with an electric screwdriver for the screws also. Although it's made out of laminated particle board which is heavy and usually unattractive, it was easy for me to move around and doesn't look cheap at all. You don't notice the thin plastic screw covering stickers either. Far more expensive looking than the price. My housekeeper said it looks like a decorator piece and that it's always been where I put it. I have it horizontally against the wall with sculptures and art books in it. I have been looking for something for a long time for that space but couldn't find anything the right height and length. It's perfect.", 
    "Incredibly complicated to assemble. I can usually assemble most items, but this one was over my head. This item looked great initially in my dark office, but some of the shelves are crooked. Also, the veneer bubbled and when i moved it to another office, it chipped so easily. It now have the chips and cracks covered with hanging plants. It looks okay from a distance, but up close, it looks like crap in my new bright office.", 
    "I ordered these bookshelves for my daughter and when they arrived I could not of been happier. I was shocked at the high quality especially for the very good price. The freight was free and the bookshelves arrived in two days. These shelves will last a long time, they look beautiful and the instructions were very easy to follow. Excellent product.", 
    "We have it laying on its side as a behind the sofa room divider. It is a little tall, but overall we are very happy with it.Relatively easy to put together, I did it by myself. I did need a second person to lift it & get it into place.The stickers to cover the screws have a nice wood grain, but they do not want to lay flat & stick to the shelf. I would recommend laying them between some heavy books to flatten them before applying them.", 
    "This bookshelf assembly was step-by-step and went smoothly in about 45 minutes. I darkened the seams with a black furniture marker because some of them were lighter than I wanted. Our base boards kept the bookshelf from sitting flush against the wall so we added feet to the bookshelf to raise it above the base boards.Now it is the perfect addition to our family room.", 
    "Great display bookshelf for any space! Very easy to assemble and works well horizontally and vertically. Highly recommend.", 
    "I am so glad that I bought this piece. It is a very nice looking shelf that offers a neat way to display my random vases, books, and other collectibles. Read through the directions carefully so that you have a good idea of how to assembly. You'll assemble two sides identically, then connect them together at the end. I was able to put it together by myself...and I HATE assembling furniture! I also was able to stand it up and move it against the wall by myself...for those of you who are single women wondering if you'll be able to assemble and move it...you should be fine!", 
    "These are very nice shelves though some of the wooden pegs were missing, you don't really need them all. I am in my late sixties and managed to assemble this on my own and it looks very nice.", 
    "Yes, these shelves are a little more complicated to put together than a standard bookshelf, but well worth the effort! All of my pieces came in UNdamaged :) and fit well together. I chose to lay the shelf on its side and use it in the horizontal position. It definitely adds some flair to the room, and some visual interest, too!", 
    "This shelf is very nice with lots of uses. It looks good both vertical and horizontal.", 
    "Was amazed at engineering, ease of assembly. Very sturdy, easy to mount onto wall using 1-1/2\" aluminum angle strips to support weight. Highly recommended accent piece to any room", 
    "I needed to fill a long, gradually sloping wall, to break up the space and have a place to put books and mementos. I had purchased other shelves that were flimsy and looked cheap. These were the exact opposite. Although the box is pretty heavy (I had the delivery guy bring it into the house for me), the boards themselves are easily portable. It is better to have two people to put together and the directions are pretty easy to follow. What you have when done is a great bookshelf, that can be stood upright or on it's side. Either way, is is really attractive, with different levels of shelves and open space. I love it so much, I am purchasing another to put in the same space. It is really sturdy and level and although made of particle board sealed with a laminate layer, it is really strong and solid. It is easy to move, so it isn't awfully heavy. Perfect solution for my space issues and I can't wait to put the other one together and start loading with books and Hawaiian mementos. Love it!", 
    "Love them! Doesn't go well on carpet standing up, so I laid it horizontally and its perfect!!! Very sturdy!", 
    "I bought two of these for my son's new condo.He had an 8ft. wall next to the sofa that needed something. He put the two of them together on the wall and filled it with books and knick-knacks. He said they were easy to put together and all the parts were there. They are very sturdy and I think the value was excellent.", 
    "I saw a lot of positive reviews for this piece I went ahead and ordered it....I was very disappointed with the quality of the piece. The quality was horrible (black painted press board) and It came in so many pieces that it extremely daunting when it came to assembly. Oh yeah - assembly....the directions stated not to be frustrated (really???) and that it would probably take about 1/2 day to do - I don't have that kind of time and don't need frustration! I gave the unit to a friend who is extremely handy and has a lot of time and patience.....he has yet to assemble it. It was not worth the money - even though the price tempted me to but...I purchased a similar unit from a furniture store that will come assembled and placed where I need it -", 
    "Really like this.....one thing I did was after \"playin\" around with it decided to put it on it's side, for a different look. Lokks like a console table with books and \"what nots\". GREAT value for the money!!", 
    "I needed something on which I could display artifacts and collectibles. This piece fits perfectly in the space, adds so much to the room and has allowed me to create an artful display. My boyfriend put it together for me so it looked fairly easy to assemble. I doubt that I could have done it alone since I did help him stand it up when he was finished. It is a great addition to my living room.", 
    "Arrived quickly and in good condition. Took about an hour to assemble by myself, most likeky quicker with two people. Looks great filled with books and tchotchkes.", 
    "LOVE this display shelf. It is a beautiful piece in my living room. The color is accurate (I got espresso) and the quality is fine. It is not 100% solid wood, but it does the trick. GORGEOUS!", 
    "This is a quality product for the money spent. Took my husband 1-2 hours to put together. It is exactly the look I wanted and I have gotten numerous compliments. I watched for about 2 months to get the price I was looking for. Always happy with Overstock.com", 
    "This bookshelf is functional and attractive. It looks great in our family room", 
    "Exceeded my expectation. Put it together fast, and never looked at the instructions!", 
    "This shelf unit is so awesome. It is a little smaller than I thought, but it looks so great against the wall filled with books. It is really good quality, very sturdy wood. I would highly recommend to anyone who is looking for a conversation piece for their home or office.", 
    "We needed a display cabinet for a blank wall in our family room - this piece did the trick. I am a female senior and put it together myself - so it is a doable task. I recommend using a drill when you can as using the supplied wrench is hard to turn and makes the job slower.", 
    "Very pleased with the finished product. My husband and I put it together easily. We bought two of the units and they they look very nice as display units for all my collectibles.", 
    "This is a great bookcase although I have placed it in my walk-in closet for other storage. Looks very modern and is very nice and sturdy! Remember it does need assembly (which hubby did for me). I love it!", 
    "I bought this shelf in white for a makeup room i have been working on and I am completely in love with it i have it sitting on its side and all my things fit nicely its pretty big i was surprised when it was delivered and it was packaged very well no missing parts everything was labeled it took me about an 1hr to an hour and a half pretty easy i did it by myself with two kids running around getting in the way as long as you follow the instructions correctly you should be ok! Deff. will be ordering another one soon for my living room in the black color! great price also $XXX.XX with the Cyber Monday deal it was a steal!", 
    "I really like the bookcase because of its unique design and have had multiple people tell me how much they like it. The wood is also high quality and seems very sturdy. In regards to assembly, it took me 1.5 - 2 hours to set it up, and the instructions were very clear. Having a drill definitely helped, so I'd encourage you to borrow one if possible.", 
    "Disappointed in this piece after it got such high ratings from other reviewers. Our expectations weren't super high, since it is highly affordable, do-it-yourself furniture, but it ended up being so unstable that we hesitate to put a pottery collection on it--which is the reason we bought the thing in the first place. It sways side to side without much pressure, and stands slightly skewed to the right. We even went out and got brackets at the hardware store and installed them on the back, to try to straighten and stabilize it, but it's still uneven. I wouldn't trust it if I had a child 6 years old or under in the house. The assembly instructions, with only pictures, lacked information that would help the consumer get the details right. The bolt things that attach all the boards together are sorta tricky. It would be easier if it were just screws and a phillips screwdriver. Even the covers for the bolt holes are cheap: in similar furniture, I've seen wood plugs provided; with this bookcase, it's paper \"stickies\" colored to look like the wood. The color and appearance--its asymmetry--are the only things we like about it. We would have returned it, except you have to get it all put together to discover its fatal flaws, and at that point it's such a hassle to dis-assemble it and ship it back that we're going to live with it until we find a sturdier piece with a similar configuration. Unless you absolutely can't afford to pay more, keep looking for something better.", 
    "Well, loved the look of this piece...allowing for different heights of books, etc. Then, I started putting it together...the inside framework went smoothly actually, it was when it came to dealing with the cam locks on the outer frame, that was the problem...the cam lock holes were drilled too deeply, so that if you seat the cam locks all the way down into the hole, it was too deep, so then you had to take the part back off, and use something like an allen wrench to stick in cam lock and push it up enought to line it up...now this does not seem difficult, but, when you have to do this for 6 cam locks per side/end, it iw quiter tedious and frustrating. I gave up. My husband took over, but ended up breaking off a 1/2 inch piece of veneer just trying to get the cam locks in proper position....so I would not rec this piece, unless you like tedious, frustrating projects and you have more patience than us, or they fix the cam lock holes and don't drill them so deep......My husband was almost ready to throw this piece out the window....it is never a good feeling when you get a brand new piece of furniture put togehter, and you have damaged it accidently while putting it together....", 
    "This is a great display case. I like the fact that it can be used as a room divider because it is finished on all sides. It can be used upright or on its side as a low bookcase or divider. Great options. It arrived in perfect condition and was not hard to assemble. It is heavy and sturdy. The configuration of the shelves makes it a great display/bookcase/room divider for a modern room.", 
    "I was worried about the quality of the unit and the hassle of putting it together, but was pleasantly surprised on both counts. My 12 year old daughter and I put it together in about 90 minutes (definitely helps to have 2 people) following the directions. The quality was better than I expected for the price. The white finish is on all sides of the boards so it looks good from any angle. It is also very sturdy. The largest shelf is perfect for my daughter's hamster cage and no worries on it not taking the weight.", 
    "Love the shelf. Very stylish and easy to put together (two people), but could have done it with just one. Hardware good quality. Lots of pegs and screws for great support. Arrived with no damage!", 
    "my husband assembled it fast and easy, it fit perfectly in the niche in our dining room , the color matched perfectly with my other furniture pieces.", 
    "I'd been looking for a book-case large enough to support at least a large majority of my books. This one works beautifully! It is pretty robust, and holds even my heavier textbooks and reference books fairly easily. (I'm going to wait and see how the shelves continue to hold their shape over time, but so far, this bookshelf seems very hardy!) I have the shelf resting on the long side (because of the way my apartment is arranged) and I love the way it looks. There are a couple of screws that took me a while to fit in - but that could be entirely my own fault.", 
    "We didn't assemble this item until 2-3 weeks after it arrived because it looked like it might be quite a challenge. However, once we started the task, it went together quite easily. The finished product is very nice. It displays both books and memorabilia of a variety of sizes in all the different compartments. It really dereese up the room.", 
    "I love these book shelves, but they were difficult to put together. The directions say to allow for 1/2 a day! Luckily, I have a wonderfully handy friend who helped me put them together, because I never could have done it myself.", 
    "I have had it over a year and still looks like new!", 
    "Put together single-handedly and it looks great, study but not so heavy I couldn't lift it by myself. Just what I was looking for. A modern, elegant but importantly inexpensive bookcase. I don't have a fireplace in my new apartment and this is great to display pretty things on. (Also my cat loved helping me build it!)", 
    "It's a beautiful bookcase, exactly what I wanted. The only thing was that the directions could be a little confusing. For any future buyers, the first step on the instructions is telling you to make two sets, that's why it calls for double the tools shown on the picture.", 
    "Easy to assemble. Stable and attractive display piece. Cons: made of pressed wood and depth of shelves only 11\". Overall good piece for a good price.", 
    "Can't beat the price or the product! Coming from someone who ALWAYS calls for help when it comes to projects...this was easy to assemble. The directions were clear and all the pieces were clearly labeled. If you've been looking for a quality tiered shelf for an affordable price...you've found it. Not to mention it arrived two days after I ordered.", 
    "Nice addition to our bonus room. Great place for photo books, media, and nick backs.", 
    "Great bookshelf. Very happy. Have purchased several.", 
    "I bought two of these in white and placed a white desk between them. I love the style and use every shelf to display my treasures and pictures. Only problem was that I had thought they measured 34\" wide, and they measure 351/2\". I couldn't put the electric fireplace between them as I initially planned. Still value them for their style and quality.", 
    "Purchased over a year ago and use as a sofa table. Was easy to assemble and looks great in my living room!", 
    "I have had this for over a year, very happy with the finish, and suitable for use in our living room.", 
    "I bought almost identical cabinet from Macy's during their thanksgiving sale for $240 (incl taxes). Tried to buy another cabinet 3 weeks after thanksgiving and they had increased the price to $360+ Found this item on overstock.com for $190 (incl taxes, with a 12% off coupon).There does not seem to be any quality difference between the Macy's cabinet and this one. (Macy's calls the cabinet by a different name - Venetian or something)", 
    "Even though the cabinet is 75 lbs, it only took me 45 mins to assemble it by myself. The instructions are pretty easy to follow. The cabinet is very sturdy and looks great", 
    "Nice piece very modern and fancy.", 
    "this is solid and presentable. At first I was concerned that it would be unstable on carpet without something to fasten it to the wall, but it is heavy enough to sit well even our plush carpeting. We use it to display family pictures and vacation memorabilia.", 
    "It is a good bookcase the only problem is I did it by myself and it look at least 3 hours to put it together because the instructions are not straight forward and it took me a second to figure out the numbers of the wooden panel pieces. I wish they just indicated the numbers were on the pieces themselves. I use the bookshelf horizontally instead of vertical. Nevertheless after I assembled it by myself I felt accomplished and happy with my purchase. fyi i read the entire instruction before putting it together and I think step 3 or 4 requires that u set it up individually then put both parts together in the up coming steps", 
    "Was easy to put together. Came with everything we need and directions were dummy proof. My only complaint is there isn't enough wood stickers to cover the screws.", 
    "Looks great online. Design leaves a lot to be desired. Not too difficult to assemble, but it looks it. I wouldn't recommend this if you're wanting something of quality......", 
    "Not very good instructions but once you get the idea of how it looks you can figure it out. A bit wobbly when done but we put heavy items near the bottom since we did not put it close to the wall, which meant we could have used the included strap to attach it to the wall so it would not tip over.", 
    "All particle board, tons of pieces, lots of fasteners to drive. Get an electric screwdriver! The assembly effort is above average, the result is a nice looking shelf. All fasteners are exposed and covered with a veneer-like patches to conceal. Still pretty visible after all is said and done.", 
    "It's very solid and heavy. Looks much nicer than the pictures as far as the \"wood\" is concerned. Looks elegant and much more expensive", 
    "Don't even get me started about the complexity of putting this together, although I was able to complete it in about 2 hours, lets focus on the end product. It is the cheapest, and most poorly designed piece of furniture I have ever purchased. Now for the price I paid, I did not expect top of the line, but you would at the very least expect that they would design this piece so the large screw holes would be out of sight or some how camouflaged as it is in the picture associated with this item, but they are not. You can see the shiny metal parts and the pressboard in about 10 places on the piece. This is a piece that you would put in your garage, but not in your living room.", 
    "This shelf structure adds such great character to our room than the standard ones. Everyone notices it in our loft area. It was shipped well packed and very easy to assemble. Would highly recommend.", 
    "This bookshelf has really complimented our living room. Great value!", 
    "We really love the style of the book case, but we were hoping the walnut would be a much lighter would. It is very dark and is what we would think the espresso would be. It would be nice if they had color samples on the website when ordering so you could truly see what to expect.", 
    "Let me start by saying that after receiving this bookcase, I bought another one. It arrived sooner than expected, assembly took about an hour and a half which I thought would take longer considering the different shelve levels. It holds a lot of books but I have even more (hence ordering the second one). What I like about it is it's not a typical bookshelf and you can break up the space with a globe, statue, vase, or basket for storing items. Definitely a good purchase, it will work vertical or horizontal.", 
    "This is a nice piece for the price. Not great quality but looks good with things on it. I used two together on a long wall and they really helped make the room cozier.", 
    "I read great reviews about this shelf so it's one of the main reasons why I decided to purchase it, I also really liked the style of it as well. Once my husband constructed it the shelves were not flush, meaning some of the shelves stuck out and some are indented in. It makes the unit look cheap and it's too late to return it since it's been constructed. I would not recommend this product.", 
    "I recently purchased a new home and needed a bookcase for a long wall. I went to several furniture stores and nothing resonated with me. Then I saw this - which was exactly the look I was searching for. So glad I did. It fits in perfectly and really set off the room. The size of the shelves is perfect for some of the things I needed to find homes for. I love this and will buy another one.", 
    "We got the white shelf. It was assembled in about an hour. Unpacking is a real hassle! It is packed very well and it is a very tall box. Assembly is really easy and the unit is wonderful. We left it on its side but can stand up as well. It is a really great product , we got it for the holiday door buster price so am very pleased with the purchase.", 
    "You can't beat the style/value proposition of these bookshelves. We installed feet on the bottom to raise the bottom up above the top of our baseboards (so the bookshelves would be flush with the wall) and they look fantastic! Good assembly instructions, although recommend using wood glue along all joints.", 
    "I bought three white ones. They are very large and sturdy. Look very stylish in my modern room. All three were delivered ahead of schedule and were very well packaged.", 
    "The style is exactly what I wanted. I would have wished it came in an espresso color rather than black however. The wood pieces are not equal and some stick out more than others; it is barely noticeable though. Stickers are given to cover up the screw holes, which I think it's where the maker dropped the ball, for they look rather obvious and ugly.", 
    "Items was delivered very quickly - we are happy with product.", 
    "As far as compressed wood products with finish are concerned, this is an excellent product...took me about 3 hours to assemble each bookcase (I bought 2)...instructions were easy to use and the actual wood pieces were well manufactured and easy to put together...it is heavy but that is a good thing...interesting bookcase and not your run of the mill bookcase...highly recommend", 
    "The Hardware is made of the cheapest pot metal you can buy. I have assembled many articles and the cams are typically subjected to the greatest stress due to the cam action. They need to be mad from a better alloy than this. Only the cheapest provider would use this junk.", 
    "It looks just like the picture! The instructions were pretty easy, but you definately need plenty of space to build. I would recommend building it in the room it's going in because once it's put together it's pretty heavy.", 
    "This product requires organization (lay out the numbered parts before beginning) and patience (read & follow the instructions!) to put together. The instructions are clear and easy to follow. First bookcase took about 2 hours to put together and second one took less than an hour. It can be put together by one person.", 
    "Pieces came defective, worse quality than IKEA and they are all cheap particle board products! Steer clear!!!", 
    "I actually bought this for my cats. I thought they'd love it but there's just one shelf they get on. So.....it is a very interesting bookcase and I get a lot of comments about it. Fits perfect for the spot I want. I wish it could be anchored against the wall better. I'm afraid to put breakables on it since I have cats.", 
    "Have received nothing but compliments on it since it was put together. Wish it didn't require assembly, but I guess you can't have everything! Quality product with artistic design for the price.....versatile as it can be used horizontally or vertically, too.", 
    "I love this bookcase, great value. I looked for a long time before buying this one.", 
    "The 2 Verena contoured cabinets look great behind my 2 queen beds. They were easily assembled. I put them on their sides behind the beds, with a coordinating material behind them to hide the bear wall.", 
    "I liked this shelf..it looks much nicer than a typical shelf and I can mix some decor with books and it looks more decorative. Very modern and not as difficult to assemble as I thought..", 
    "I ordered the black one. It was easy to assemble and it looks great.", 
    "The bookshelved are very nice. I put them together by myself and they went together very easily. I have one upright and one on its side. It looks great both ways.", 
    "This was my first time using Overstock.com and i will definately use it again. I searched several locations on line and shopping and could not find anything that matched the bookshelf I purchased in the same price range.", 
    "I love this shelving it works perfectly in my home it is sturdy and was easy to put together. the price was good for the quality of the merchandise.", 
    "Bought this to use as a divider between my bed area and living room in my studio apartment. Wanted something to separate but not close off the space, and this is perfect. Because it's all large pieces, it was not difficult to put together. The white is a very bright white, but I probably should've anticipated that (apartment is all beiges and ivories). Can flip this horizontally or vertically. Pretty straightforward piece!", 
    "This bookcase was exactly what I was looking for. We had recently closed in our garage for our three children and needed to add a little touch to the room. They arrived quickly and in perfect shape. I will admit it did take my husband about an hour to put each one of them together. We purchased two. Although a little time consuming he also thought it was well worth the time. We have had so many compliments on them. My fifteen year old actually said they looked really cool. They look so good on each side of our media center. They are of good quality and very sturdy. I am so happy with my purchase and I am glad I got this very unique looking bookcase instead of the regular bookshelf. Thanks again overstock for making shopping so much easier.", 
    "These are great looking, sturdy bookcases. They are not however, a stained or painted wood. As long as you are aware that this is a particle board with a vinyl lamilnate, you will not be disappointed. These are easy to assemble, takes some time... about 1 hour for me, alone. ( I am an experienced, do-it-yourself, 50 year old lady.) For the price, you can't beat it!", 
    "My husband cursed a lot when putting it together... stickers cover the connectors, so it looks great - but it's pretty \"cheap\" if you look closely. We love the look though and I would buy it again... I'd just require my hubby to have a beer as he puts it together next time. We got the black one.", 
    "after we opened the box and laid out all the pieces and got halfway through assembly, we discovered a crack in the veneer of one of the pieces, which was a bummer (it's particle board, not real wood). I didn't think it was worth the hassle of getting the packaging and box out of the trash/recycling, and trying to box it all up AND eating the return fee. It looks cool, so I am disappointed one of the pieces has a crack in it starting day 1. we didn't try assembling it until after it had been here for a month, so I didn't call to request a replacement part. If yours comes undamaged you will be pleased, as that is my only complaint; had it been undamaged I would have recommended it and given it 4 or 5 stars. It seemed fairly well packaged and had bubble wrap around the outside of the box, but with heavy shipments you never know who has dropped it between point A and point B. For what it's worth you can't see the cracked part unless you feel around for it, but being a perfectionist it annoys me to know it's there.", 
    "Not too difficult to setup. Adds character to my apartment! love it", 
    "Amazing quality for the price and beautifully design to make any space look amazing.", 
    "This bookcase held 5 paper cases worth of books with room to share. I love this in my bedroom study. It took my middle schooler and I, two hours to put together taking our time while watching tv. Very Pretty!", 
    "Sturdy, stylish, and fits a lot. I bought 2 and have them side by side", 
    "Great product! Perfected my living room.", 
    "This book case is versatile and i have it laying on it's side for a little different look. Lots of room for whatnot's.", 
    "This shelf was easy for me to put together by myself and looks great.", 
    "Nice design and good quality", 
    "It looks perfect in our home. We received it in 3 days and have loved it ever since.", 
    "Not very sturdy, but good for the price. Easy assembly", 
    "4.5 Stars This bookshelf fits perfectly in my space. I use it horizontally. We put it together in under an hour. My complaints would be that the joints are not perfectly plush and it uses stickers, yes stickers, to hide the bolts on the outside. On the inside i can understand, but on the outside? That being said, I don't even notice the stickers at all now that it is in use. It holds a LOT of books and games. Definitely worth the $175 (used coupon) I paid for it.", 
    "This item is really good like the picture", 
    "Love it. Easy to assemble", 
    "I like this cabinet...for what it cost. It looks very nice...better from a distance. This is built of MDF and the paint finish looks more like plastic than paint. Round paper stickers were supplied to cover the screw holes from putting it together. I think if they had a better way to hid the screw holes I would have given this cabinet a 5. Some of the stickers are not sticking all they way around. I will be getting in touch with the mfg. about sending me some more stickers.", 
    "These shelves were easy to put together and look way more expensive than they cost! This was a great investment and have remained stable evn with cats jumping onto the shelves and kids bumping into the unit. Classic addition to anyone's home.", 
    "I have to agree with one of the other reviews. I purchased the shelves in the walnut finish. It is particle board with a printed plastic finish. I was expecting something with more of a wood look. Too much trouble to return, so I'll probably use it as shelving in a closet. Somewhat disappointed.", 
    "What a unique cabinet! Once we figured out how to put it together, it went quickly! Got it in white, and it looks great!", 
    "This fits perfectly in the space that I bought it for. Very pleased with ease of assembly and quality of the piece.", 
    "Took many tools, people & patience to assemble. MANY pieces to figure out.", 
    "It took several hours to assemble because there are so many parts, but the parts go together very well and it looks great.", 
    "This is built of MDF and the paint finish looked plastic. Very light weight. Round paper stickers were supplied to cover the screw holes from putting it together. Looks nice, but just don't look close...", 
    "very good looking, took a little while to assemble", 
    "Perfect for any wall in any room.Strong ,solid wood and heavy! I have had it my contemporary living room gor 2 years now and buying a another one ! You won't be disappointed on this piece!", 
    "This item was perfect for my home decor.", 
    "A great bookcase and display piece...I use it for cookbooks and kitchen items.", 
    "I was worried about this purchase because it was inexpensive. But it was very easy to put together and its beautiful. Very happy with this purchase.", 
    "I love that this bookshelf does not have a closed off back wall. It does not have to lay against tla wall, it can actually be used as a room or space divider while offering a unique shelving pattern to decorate or store actual books. The different pockets or shelves allow for different ideas side by side", 
    "very beautiful addition to my home. I even put it together myself. its lovely", 
    "husband put it together in about 1 hour. Nice heavy duty bookcase. Shipped really fast and overall I really like the product. looks great horizontal in a narrow space.", 
    "Gave this as a gift. It is great for books and decor. It was used in a small room to separate the entry way. Sturdy furniture.", 
    "I was so happy with this productype I bought 2.", 
    "It wasn't what expected put together but it can out loosed I think the right screw were not mail with this items", 
    "Bought several. Sturdy, great for decorations or functional items. Use one for sewing machine, material & notions. A little difficult to assemble.", 
    "We decided to place this horizontally in our dining room, and it looks absolutely amazing as a sideboard! It's placed on a very long wall and the color matches our formal dining set perfectly! Would definitely recommend!", 
    "We use this shelf in different side than on this picture and love it. using it for display and pictures, very nice quality. own it for few year and still same new condition!", 
    "Looks great in my living room. I put LED lights on the top of each shelf so it makes a really nice display of photos, books, and glassware.", 
    "It is pretty book case and it is sturdy as well.", 
    "Extremely challenging to put together and terrible construction.", 
    "Great bookshelf. Would definitely buy again", 
    "The slim body of this cabinet fits well anywhere in my home. When I first received it I laid it in its side, long ways and used it as my head board. Wow what a cool look. I did some re-arranging again and now I still have it in my bedroom, I now use it for my books, vase's, statues, and other little nick naks. I have it in its true form now. BEAUTIFUL!!!!", 
    "Although I did not put this piece together I heard it was very confusing. The case is lighter than I expected but it looks how I imagined.", 
    "It took a bit of puzzle work to assemble, but it's a nice-looking and functional piece with visual variety. I have one in our home office and one in the living room. It's particle board and plastic veneer, but that's fine with me. I have a plant on one and don't have to worry about water marks.", 
    "Great quality wood. Beatiful to look at. Perfect for books and decorations. I love it.", 
    "Really can't complain. Went to local furniture store and they wanted $400 for a book shelf. Ordered these and husband took 1.5 hours to assemble each. As well made as stuff I've seen in stores. Not solid wood but works just fine. The width is actually 35.5\" which may not be critical when working with just one or two but when placing 3 or 4 together, our careful measuring meant that we had an extra shelf unit. Can be used from all sides so can be used against a wall or as a room divider. Would get them again if we needed more.", 
    "Couldn't be happier with the choice of this item", 
    "We hung this sideways on the wall, perfect!!!", 
    "We bought two. My husband who is a pro at assembly tells me that this piece was unusually difficult to put together but with patience they came together. It is chip board, I assume no one really thinks they're getting solid wood at this price, but its very solid, very heavy and sturdy. No problems holding heavy books, and while we haven't had them that long they look solid enough that they are not going to buckle. We got the walnut and the finish looks nice; you cant see the bolt hole covers once its all together. We have them either side of the TV in our family room and they look really nice. Overall a striking piece.", 
    "Assembling took 30 minutes. Once assembled the unit is sturdy and can be move easily into position. The thickness of each division give a richness effect that make it look like furniture instead of ordinary book shelves unit. The attachement to the wall is a plus. I have installed it in the kitchen and to lift it from the floor I have screw in 6 wood round flat legs (2 inches) from Lowes . Painted them satin black to a have an integrated look and ease to clean the kitchen floor without problem. Look great with my white china and white and black kitchen theme!", 
    "We bought two of these for storage of books and old collection of LP records. We have them side by side as a large wall unit and they look great. You do have to assemble as they come flat packed. However my husband and I did them together and once we got into the hang of it, actually quite enjoyed our selves. I would suggest assembling in place as they are quite large.", 
    "Not the best quality, but looks great in my home. A little confusing to assemble, but my husband knocked it out quickly. Would recommend this bookcase to anyone who is looking for modern style and function.", 
    "served my purpose perfect", 
    "Layed down & used as bookcase. Eye catching!", 
    "Love it! Easy to put together and looks great!", 
    "Looks good easy to set up", 
    "The book case is good looking and very sturdy. I'm not a builder so for me the assembly is always the difficult part, but very happy with the product.", 
    "My long term plan for an old entertainment center was to clear it,get pretty baskets, and store out of season items, sewing materials, and generally clean up a spare room. On emptying the original shelves, it almost fell over so it was disassembled and trashed. My daughter searched what she knew I was looking for and found these bookcases. The area we were covering required two so we ordered them. They arrived at our house in three days. It does take some gymnastics to handle so you should have two people to assemble, but then it is relatively easy. I only gave it 4 stars because each box weighs 88 pounds and each piece is quite heavy and I don't think I was ready for it. That said, I love the way it looks and with the baskets I have been collecting the room looks great, just as I pictured it.", 
    "great look, sturdy and good quality Take some time to put together but worth every penny", 
    "This is a very good quality and stylish piece for the price. The assembly directions were a little hairy at first, but once we got the hang of it, it went smoothly. We ordered two, so assembly of the second one went much quicker! I placed one as a tall unit, and the other on it's side as a longer unit - the meet at a corner of the room and it looks great! I would definitely order again and recommend this if you are looking for great style at an affordable price.", 
    "Very happy with this item. Color and style was to my liking. It fits nicely in the space I needed it for.", 
    "solid construction - needed to be assembled, but did not take long. Have been using them for 3 years now, and they are great. I used some horizontal and some vertical, can be used either way", 
    "I have bought these for two homes now. They are so solid and a lifesaver if you need storage room. Highly recommend.", 
    "Assembly is not difficult but does take some time. The pieces at the top can be difficult if you are shorter. I put the pieces on the side till the end and stood on a stool for finish. Afterwards the shelf looks fine in living room, but detailed look does show the \"stickers\" to cover the holes. It's ok, but not high-quality upon closer inspection.", 
    "Just the accent piece we needed for a small living room.", 
    "I use this bookcase as an entertainment center. the height is perfect. the different shelf configurations make it an interesting display case. would buy again.", 
    "Easier to put together than anticipated based on other reviews. Even with screws tightened down snugly, the shelf is fairly wobbly. Not confident it is durable. It is a unique looking bookcase.", 
    "Matched another black book shelf that I already had. Unfortunately, it has to be assembled, but OK for the money!", 
    "I looked and looked for unique shelves. I have three sets of these shelves next to each other along the end wall of my living room. The color of your walls shows through which I wanted but worried about the strength of the shelves then. But NO NEED TO WORRY, if you follow the directions and use every part included with the set, you will have a nicely strong shelving unit. I like the unique shape of the individual shelves as I have many antique and unique red glass pieces that need a taller space than just a ten or twelve inch shelf. Again, I would not trust my collection on a shelf that was not sturdy enough. I have them in white and intend to order them in another color for my Florida room.", 
    "not hard to assemble, to older women put it together.", 
    "I wish furniture manufacturers would start using real wood again (sigh). As with most furniture pieces nowadays, this bookcase is appealing... but the quality is sub standard. You will need to take care not to move it a lot (as it loosens and becomes shifty) and take extra care to prevent chipping/scratching. I purchased one on Overstock and a few months later, I bought a second one from another site. Placed side by side, it looks like one large, beautiful bookcase. It's great for displaying photos, books, statues, etc. and looks very contemporary. Again, the quality is not the best... but hey.", 
    "would recommend to anyone!!!", 
    "I had high hopes for these bookcases and they were not disappointed.I love how they look, they are sturdy and can hold a lot. A lot of people mentioned issues putting them together. My husband was able to do it in about an hour no problem, but he was familiar with the cam lock system. If you haven't put together furniture using that system I can see how it would be confusing and hard. He commented on how good the quality of the materials were considering the price. Lets be honest, these bookcases are not expensive but the quality you get for the price is great.It did include hardware to mount it to the wall as well.", 
    "Very nice looking and plenty sturdy. Exactly what we were looking for.", 
    "Love how this book case adds a dimension that is not boring. it lets me put things of different sizes on it that keeps it looking interesting.", 
    "I have bought this bookcase more than once. So worth every dollar.", 
    "The shelves were really easy to put together. The directions were easy to follow. And i love the way the look of the shelves are all different.", 
    "I love the shelf and I am very pleased with my purchase. Will definitely buy another one for our office.", 
    "Super strong, easy to put together, highly recommend it", 
    "Delivered on time. Easy assemble. Nice looking piece.", 
    "Easy to put together and really helps save space in a small apartment. I also get lots of compliments on it.", 
    "I love it. easy assembly", 
    "They came packaged very well, they were as described and they look really good. So happy with them. Kind of hard putting it together for the first time, but the second one went faster.", 
    "This is a pretty shelf, it is sturdy; but it does take a long time to put together. The instructions are clear, and it wasn't all that hard to put together - if you followed the instructions; it is just really time consuming!", 
    "Bought this for my son's room. It is a decent piece. Be warned that there is no back on it. We were using it for my son's room to put all of his special momento's. We ended up putting cork board on the back so that things would stop falling through the back. It worked perfectly. It is a solid piece and I definitely recommend bolting to the wall. If it falls on a child it could definitely hurt them badly!", 
    "Nice bookshelf and the staggered shelving sets it apart in the room", 
    "I am happy with the final product. Assembly was somewhat difficult, because once pieces were assembled, the identifying numbers were no longer visible, making for challenges along the way. One spot of connected pieces has a gap, which is pretty visible to me. While I planned to set it up vertically, it seemed surprisingly top heavy. The wall behind is plaster, which made me uneasy about the wall anchor unit supplied. Luckily I was able to use in horizontal fashion and am enjoying the look.", 
    "The unit is very sturdy. It arrived well-packaged and was very easy to assemble. Looks fabulous in my office!", 
    "Love the sculpured look! I have 2 and they look perfect in my office", 
    "Great piece of furniture that doubles as showcase & bookcase!!", 
    "Had to assemble but well worth the savings.", 
    "This is easy to put together, nice looking and solidly put together with screws, glue and Pegs. the veneer plugs (stickers) sent to put over the screw holes, (and you need to cover them) didn't match and still show.", 
    "I ordered 3 of these and turned them into an entertainment center placing one on it's side and putting it between the other two upright shelves. They were relatively easy to assemble and look great. The only issues I've discovered are the little wood grain patterned stickers that are supposed to \"hide\" the screw holes. Not only do they not blend in with the wood, they flap don't stick very well and some have already fallen off after only 3 months. Overall, I love these shelves!", 
    "I used the bookcase as a display cabinet in my foyer. When horizontal, the piece is larger than a typical entry table, which I needed due to the size of our wall space. If I tire of it in the future, I will make use of it as a typical upright bookcase. Great versatility and value. Recommend.", 
    "Awesome book case. Sits comfortable below my 60\" TV. The \"compartments\" look great and it adds lots of options to the living room", 
    "Nice classy addition to my home", 
    "The item came slightly damaged but not enough to warrant a return. Took hubby about an hour to put together. Easy to do. Looks great and very nice quality. Happy with the contemporary look it adds to my living room.", 
    "I did find it cheaper else wear but still happy with the book shelf", 
    "Reasonably solidly built, have had no problems with this purchase - very happy with how it looks", 
    "Bought the white. A breeze to put together, surprisingly. A solid, stylish, versatile bookcase, looks equally great on its side than upright. DEFINITELY recommended.", 
    "Good product for the price. Easy to assemble but time consuming.", 
    "This was a lot to put together, but the wood is thick and it looks nice sitting vertical or horizontal.", 
    "This bookshelf is awesome! I get so many compliments on the design and the open back really makes my items stand out!", 
    "Love, love, love this shelf! The quality is great- it's very sturdy and it looks beautiful.", 
    "The bookcase was easy to assemble. It looks exactly as pictured. It arrived when it was expected ,it is very sturdy and looks good. We are all around pleased with the purchase.", 
    "Perfect for Book shelf. Not complicated to put together just time consuming. I am thinking of ordering another one. Totally worth the price and the wood is sturdy. :)", 
    "I bought this bookcase in white to go with my home office. Love the style and display capabilities. I have it on it's side, but could also stand it up to use it - very versitle. Highly recommend!", 
    "I've moved these around my house in the last 4yrs and they are as sturdy as the day I put them together.... which was sooooo easy.", 
    "Looks great. Relatively easy to put together. Two people assembled in about 1 or so.", 
    "Great quality furniture, very modern and stylish", 
    "The stickers don't stay on to cover the screw holes but it's cute. We have it in white.", 
    "What an amazing addituon to my home. With its modern lines and stylish function, I'd highly recommend this to anyone needing additional storage with pizzazz. My apartment is relatively new and sports a lot of modern lines. This fits in perfectly! *Only thing that's not perfect is the assembly. Be patient and get someone to help you out you'll go crazy. It's worth the frustration, though, because it's a great showpiece for your home.", 
    "Great bookcase! Fits perfectly on the wall I wanted it for. Looks more expensive than it was. Great purchase!", 
    "like it a lot. put a square unit, by same company, next to it to fill a wall in great room. looks very neat. not bad to put together.", 
    "A bit tricky to set up, but I did it and its perfect. Be patient and read instructions carefully! Set up time about 2.5 hours- I did it alone and Im just a little ol' lady", 
    "We ordered this in white for my daughter's room. We use it horizontally, and she would be able to use it as a TV stand - if she had a TV in her room. She wishes! She can place all of her books and doodads inside, and it looks nice. Very happy with it.", 
    "I ordered 2 of these cabinets and am very pleased with them. They took some time to put together, but in the end they are gorgeous; especially once you get your precious knick knacks on the shelves. The shelves are extremely sturdy. Mine are on hardwood floors so I put the padded furniture movers (not the technical term but that's all I can think of to call them at the moment) under the four corners so they are easy to move and won't scratch my floors.", 
    "This bookshelf its sturdy, looks good, and you can use it anyway you want vertical or horizontal. we put together a whole wall to wall bookshelf using a few of these bookshelves.", 
    "Great design. I like how interesting it is.", 
    "We bought this piece to have in our home prior to our wedding and fell in love with it. The style is great and everyone we know asks us where we got it. We recently had a moving sale and had to keep telling people this piece wasn't for sale, that's how good it looks. Great piece!", 
    "Looks very nice in my dining room", 
    "Works perfect for my space", 
    "We purchased in white for sons bedroom. Have had for several years and never regretted the purchase.", 
    "It looks just like on the picture, great for a niche!", 
    "Fairly easy to put together. Looks good", 
    "A little big then I expected but thats what I get for not messuring. I have it on it side and like the look.", 
    "Good construction, solid. Nice quality bookshelf. Pretty easy to assemble, read directions.", 
    "I love that I can place it horizontal or vertical and that it is made of hefty wood. A wonderful shelf. Would purchase another one", 
    "The bookcase delivery lacked all the screws and parts needed to assemble. When I finally received the screws and assembly parts (after writing Overstock), I put the bookcase together but it looks cheap and the color is a bit more off-white than expected. Overall I think it brings my living room down and I'll have to move it/get rid of it somewhere.", 
    "Easy to assemble, solid construction, nice design.", 
    "Beautiful and sturdy. I put it together by myself with no problems.", 
    "This bookshelf is great. It does take a little bit of time to put together, but I did it with a bum shoulder and had no issue.", 
    "For the price, excellent quality. It's a layer of wood on either side with compressed wood layer in the middle. It was actually much easier to put together than the bookcase I got from Target. The screw end of the cams have predrilled plastic anchors already in the planks and everything fit the first time for us. Took maybe 45 min for 2 people. It looks great!", 
    "Modernized my living room. I put it together myself without my husband's help. Great purchase.", 
    "I love these bookcases. They allow me all kinds of spaces to hold large coffee table books and assorted sentimental items that I dare not display with a baby in the house...There is also plenty of room to hold books and papers, baskets to hold and hide office supplies. It all looks good. These went together easily and they are heavy, substantial wood bookcases. An excellent purchase! Thank you again, Overstock!", 
    "I love this book case it is just the color that I wanted,", 
    "A little smaller than expected but color true to description. Nice Piece", 
    "Sturdy and very attractive, it holds a lot of books. Very pleased.", 
    "Attractive and sturdy. Used at an angle in a corner. May need help putting it together", 
    "Get complements on this all the time. Great shelf, could be better quality, but you get what you pay for. Sturdy enough for books and display items.", 
    "I needed shelving with an open back to accommodate printers, routers, etc. This suits the bill just fine! It took about an hour to assemble.", 
    "Easy to put together, beautiful piece that looks just as expected. A great black bookcase that helps define the space. Definitely recommend!", 
    "looks good in my front room i bought 2 of them and put them on both sides of my TV turned them in different directions", 
    "Excellent etigere. Filled my needs.", 
    "I do like this but it's a little darker than I hoped and I expected something better quality to cover the screw holes than the flimsy stickers that were provided. Overall it's nice.", 
    "I was hesitant to order such a large piece of furniture through the mail without having seen it first but I was very happily surprised. The shelf went together easily and is well constructed. It came with no scratches, nicks, or dents. Very happy with this.", 
    "Its a sturdy shelf but i didnt like the way the screws were covered, they provided stickers to cover over the holes. Other than that its a good looking shelf.", 
    "This was very easy to put together and looks nice. I like that you can put it horizontal or vertical.", 
    "Was easy to put together even with my bad arm. Had so much fun putting all my pics and nacks turn sideways and get more room.", 
    "Very pretty. Solid looking. Two 13 boys put it together in an hour", 
    "beautiful in vertical way. I bought white color.very easy to assemble. did it in 30 min. by myself.", 
    "Great for organizing media and displaying decor. Easy to put together. Very happy with this look!", 
    "Great book case, well made and beautiful", 
    "Love them!They look great! Easy to assemble and the color white is bright and perfect. They really show off my chochkes.", 
    "Solid build, easy assemble, modern look.", 
    "This is an excellent product. I love love how it accents my home! Great price!", 
    "Very sturdy and easy to assemble", 
    "very good purchase, it looks nice and it is sturdy", 
    "House guests often comment that the unit is unique and attractive.", 
    "Very nice book stand. Only issue is the amount t of cheap whit stickers. Wish there had a better way of covering the holes.", 
    "I am very happy with this purchase. I wanted a horizontal bookshelf and this more than fit the fill. Pleasantly surprised by the thickness of the shelves and the ease to which it was put together. Would buy another if I needed it.", 
    "This bookshelf is great turned horizontal in the playroom. The larger opening are great for storage baskets. The smaller one have books. It's very sturdy.", 
    "Easy assembly as each part marked. Sturdy. Lots of shelves/sizes for storing or showing off items. Excellent size for small rooms/certain décor with an empty wall space.", 
    "Really do like this shelving unit. It goes great with my dining room set that I also bought on Overstock.", 
    "This was easy for my husband to put together. I love the look of the shelves. We have it sideways and it fits our room perfectly. Solid build. I would buy again.", 
    "This was a perfect, perfect buy all around!! The piece was exactly what we wanted and needed for a certain area of our living room!! It arrived in a timely manner, boxed up very well, not a scratch anywhere on it. It was easy to put together, the directions said it required two people to put it together, but to be honest we only needed one person, I was on \"standby\" but wasn't needed! The price was awesome. I enjoy sitting and looking at to the things I am now able to display in the room, where we spend most of our time. I'm hopeful that we will get many, many years of enjoyment from it!!", 
    "This is a beautiful, sturdy cabinet. It was not difficult to put together but it was a little confusing. You have to really pay attention to which way the shelves will end up or the hardware will show. I love it!", 
    "I have the bookcase lying sideways with my tv on it, it is very sturdy and easy to assemble. I'm a petite woman and had not problem. I love overstock so I will definitely be back.", 
    "Arrived on time and nicely packaged with sheets of foam between each layer of wood...no knicks or scratches. It does arrive in a huge, heavy box. Took my 20-year old son 1.5 hours to put together (....and $20....) and no issues. Beautiful, contemporary, sturdy & suits my needs perfectly. Thank you!", 
    "This bookshelf is so cool. It adds a lot of character to my room, I use it as a room divider, with light shining through my favorite glass pieces from both sides. I would love it just as much against a wall because it has such interesting dimensions and shelf placement.", 
    "I recieved my package and all pieces were included down to the last peg. We put it together in just under an hour. It was pretty easy to assemble especially since the bookcase is a set of the same pieces. It looks wonderful!", 
    "Unique modern bookcase is a nice change from the regular shelving -- but assembling it is very complicated.", 
    "Sturdy, easy to put together, looks great. Honestly, a very good product", 
    "Cabinet arrived in perfect condition ( no scratches or flaws) looks great in my studio, love it.", 
    "Loved it! But need an electric screwdriver to put it together n not just the thing they provide!!!", 
    "This cabinet is lovely to say the least! It was not hard at all to put it together. I actually did it by myself with no help from my husband except for borrowing his screwdriver! Instructions were very easy to follow and all the parts and pieces fit perfectly and were tight! This was a bargain and looks like I spent a whole lot more! Very happy with this beautiful and modern cabinet - looks great in my living room!", 
    "I love the look of this shelf. The only thing that would have made it better is having wooden plugs instead of stickers, but I still love it.", 
    "Some minor damage to one corner. I put the damaged corner against the wall so that it is hidden.", 
    "I was looking for an open bookshelf that wasn't too deep for behind a couch and based on the size of the wall, I ended up getting two that I set up next to each other and this has worked great to display books and other items in a creative way. The plastic bolt covers (from where you assemble the pieces) are ok but are largely covered by items on the bookshelf so this isn't much of an issue. Overall, was much cheaper than similar options and is a great quality!", 
    "I didn't like the way the wood looked - I thought it looked like real wood online but it looks fake. Also, I didn't like that it came with glue to assemble it. The quality just wasn't what I expected. It's a cool design, though. Overstock was great with the return.", 
    "Not too hard to put together and a really nice and interesting addition to my living room.", 
    "For the price and style, this is a great item. Wasn't too hard to assemble. Nicely displays items in my little house and I get comments from visitors on how attractive it is. Much cheaper than the hutches I was looking at.", 
    "I love this book case. It looks great in my den. My son-in-law in an engineer and he assembled it with ease. It may have taken me a bit longer but would have been worth it.", 
    "It took me about an hour to put the shelving together. The directions were some of the easiest directions I have ever read. It looks great in my house, and it is sturdy. I love it!", 
    "Very Nice , and it is different", 
    "I don\"t know why people rated so high this product ,is mdf with paper like verneer , no wood at all, in **** I will pay fracture of what I paid here, We decided to keep it do to heavy shippment ,but I'm not happy with the Quality", 
    "The only problem I had with these was that they are much darker than they appear on the picture. The walnut looks very black with brown running through it. Other than that small detail, I love them. They were very easy to put together and the instructions were very easy to follow. They are reversible, which was perfect for what I needed. I put one on either side of my fireplace, and I was able to put them so they mirrored each other. I love these bookshelves.", 
    "I enjoyed putting the bookcase together. One drawback is that the surface scratches easily. Still, I am happy wit the purchase.", 
    "Fast shipping and easy to put together! Looks great and it was cheap compared to other boom shelves I researched.", 
    "My husband was looking for something like this. I seen it here for a good price and looks great. Easy to put together", 
    "Make sure to look at the actual measurements. Although it looks really tall in the picture, it's not. Plus some of the designs in the wall unit are small as well. You'll just be able to put small accessories ion display.", 
    "I purchased this bookcase almost a month ago and any time my family an/or friends see it they always make compliments and ask where I got it! Assembly was fairly simple, but is much easier to do with two people and a power drill makes the process a lot faster. Overall, I love the color and wood-grain look. I am using is horizontally and it looks fantastic!", 
    "What I needed perfect neat look", 
    "It's a very nice beautiful shelf. Ease to assembly, hardly recommend.", 
    "Purchased for family room. No cons. Great value. Got it because it was different from the std shelving.", 
    "Great concept as a lateral bookshelf but on its side the shelf areas are taller than wider and so less useful than when standing tall. Looks nice though and is very solid.", 
    "It's everything I desired for adding storage with unusual and functional shelves. Instructions for assembly were clear and precise.", 
    "I thought they would be more sturdy but they look great", 
    "This is a great looking bookcase. It does take several hours to assemble, but the instructions are very clear. Displays items very well.", 
    "I'd rank this as high quality among 'some assembly required' furniture. (Note that by 'some assembly', I mean _all_ assembly) The boards seem to be fairly well made and I like the chunky look of the shelves. The instructions were clear and assembly was fairly easy. The only downside is that I couldn't get everything to line up perfectly flush and level - but that's about what I'd expect for this type of furniture. So long as you aren't looking really closely, it looks great. For the price, I think it's a great buy.", 
    "Huge and lots of instructions to put together but looks very stylish. I didn't like how it had a few nicks tho so check your pieces!", 
    "I ordered four units to be set in master bedroom for our books in our new house. We only needed 3 to go around wall- mounted TV. Used the extra one in entry room to hold game and puzzle collection. The bookcases turned out bigger than I expected, which was great. We used 2 as vertical sides and screwed the other horizontally in between them. It looks great, and my friends like the look it gives around the TV. Because of the shelf shape, all sized books and art pieces fit somewhere nicely. Because of the shape, all the game boxes also fit well.Only complaint is the straps included to use on the wall for stability I did not use. Bookcase would still move a bit. Instead I bought 2\" corner brackets and they were much better.Would I recommend..absolutely!", 
    "Was a bit challenging to assemble -- but after a few misalignments it went together well.", 
    "Like the bookcase...matches my entertainment... nice and contemporary... fit all my books... Thanks overstock... I do however think the price could be less given the materials.", 
    "This bookcase is practical and sturdy and looks nice. We have bought two of those for our kids. The only problem with it is the dozens of stickers that you need to stick in order to cover the screw holes. These stickers, in some case, will not stick and will \"disappear\" over time. Seems like something that can be solved in a more efficient and sustainable way. Other than that - great product!", 
    "Nice piece for the price. Looks a little cheap with the stickers that cover the screw holes. Somewhat hard to put together as you could imagine by looking at it. I have it in my dining room with different decorative kitchen items. I like it!", 
    "While I figured the product would not be very high quality as far as construction goes, I was very disappointed in even the aesthetic quality. The stickers to cover up the holes are obvious because they don't match at all.", 
    "We purchased this to store memorabilia in our spare room. One of the key pieces was missing so it isn't very sturdy. Luckily, we disn't need to store anything too heavy on it. Serves its purpose and is a nice decorative touch, just wish all the parts had been included.", 
    "HIGHLY recommend - actually anything from Furniture of America brand. Packaging is always superb; nothing damaged. Relatively easy to put together. Also great style and functional. Love love love!!!", 
    "I looked for several months before ordering these shelves. They are great & the price was great too! They don't look like cheap shelves & were easy to assemble. They fit my space perfectly & were just what I was looking for. I didn't want just plain straight shelves & there is plenty of variety for arranging things on them. I love them & would order them again if I needed more!!", 
    "I do not care to put furniture together and I did not lose my patience one time while assembling this piece - the outcome is great and I am very glad that I purchased it.", 
    "Overall this is a beautiful piece definitely more of a cooler white though almost a blue tint. Just take note if you have other white furniture nearby. My one complaint are the stickers that cover the screws they are flimsy and barely stick!", 
    "I needed bookcases for books and handicrafts we have gathered from our trips abroad and this is exactly what hows off the art work and has plenty of room for tall photo books. I bought 2 and could not be more pleased. They are lovely!", 
    "The bookshelves were easy to put together by two people. I bought two of the book displays. One stands tall and the other I put lengthwise against the wall. I love that the wall color wall shows through and that each knick-knack is perfectly displayed. There are many different sized area for tall and small items. I also have baskets and books displayed, too. The TV is placed on top of the bookshelf that is lengthwise and the wires are hidden in a basket under it. The units are narrow and take up little room. but hold and display so much! The two book displayed were purchased separately and the look great together. I love it!", 
    "As with other reviewers, I wish there had been a different solution to hiding the bolt and screw head other than the decals. That cheapens what could be a very nice piece. But that being said, the two of these flanking a TV cabinet look very good once I got my decorative items into them. I have had compliments on the way it looks like a whole entertainment center. Color is what I expected and really easy to assemble. I did it by myself in about an hour for each one. I did purchase some foot pads to put underneath these so the wood is not sitting directly on my tiled floor.", 
    "I am a professor and have lots of books of all sizes. I was sick of my university-issued surplus flimsy cabinets that looked like crappola. I had hoped this would hold ALL my books but I guess I was delusional. It did hold all of them from the biggest old crappola bookshelf though and I laid it sideways on the two 3' high better bookcases. It actually looks great that way although I'd prefer two of the same design stacked. I'm just not spending any more of my money on stuff for my office. Anyway, the little side nooks and crannies hold my smaller books well. I put all my heavier books on the bottom but the top shelf is handling the heavy books also - maybe I just have 2-4 fewer heavy books per shelf on top. Then I put stuff on the very top also. It is a solid case. I am not one into modern design but I like the design of this case. The only negative thing is the adhesive wood-grained round stickers to place over the holes left from fastening it together. They don't stay on. I had two GA's put it together for me - so don't know how difficult it was to put together. I'd buy another. I'll accept donations : )", 
    "I could not ask for a better buy, when it comes to furniture. Delivered on the date promised. Easy to put together. I recommend this product and this site to everyone.", 
    "We are very happy with our bookcase, we are ordering another! The look is modern and classic at the same time and looks great in our dining room.", 
    "I ordered two of these shelves for my office/library in my new house, and I love them! They are sturdy and stylish! The only downside was the assembly, which wasn't hard, but was a little time-consuming, but that would not stop me from buying these shelves all over again! If you're looking for a sturdy, contemporary shelf, I can't recommend these ones enough!", 
    "helpful hintsview you tube video of camlock demonstration so so helpfulglue all dowels and tap in gently with a hammer makes fitting so much easierbookcases are very nice quality and look great once you figure out directionsusing the two hints above, saved hours when putting our second one together", 
    "Delighted with the product. It was just as described. The price was good and the quality seems to be good as well. It was, however, a little time consuming putting it together.", 
    "We'd first registered for an expensive bookshelf *just like this one* at a brand-name store, but then stumbled upon this bookshelf and tried it instead... So glad we did! It looks very cool in our living room, we love the color, and it's really sturdy as well. Highly recommend it, well worth the price. Beware it does take quite a while to put together though!", 
    "I wanted something different for a display bookcase and this fit that. From far away you can't necessarily tell it's particle board material but its definitely of a cheaper quality. I bought this on sale and would not have paid the full price for it. I think it took an hour for my husband to put it together. The color is dark brown and almost looks black.", 
    "This was exactly what I wanted. For the $ the quality is great and personally I'd recommend it to my friends. I was worried initially because there is another similar book shelf that is labeled to be used also for tv stand. I thought it was probably marketing- since the other one was definitely more expensive but it looked like the shelves were thicker. This is perfect for your avg weight tv stand which is what I wanted it for- book shelf and tv stand. My husband and I didn't have need for the traditional stand and I wanted this to make it a more home feel/more us.Definitely recommend esp for the price.", 
    "This is not heirloom quality wood bookcase, but it is a sturdy good looking piece of furniture. Assembly is not simple, and was made much harder by the fact my unit was missing some cams and screws (with no info on how to contact manufacturer). Being in a hurry I cobbled it together. I wallpapered just behind the unit, and the unit does look like a higher end bookcase. Would be 5 stars if enough parts were included for assembly.", 
    "I love the look of the shelves! I also like that the can be used horizontal or vertical. There is plenty of room for both small and taller items.", 
    "I wish my product to be delivered promptly. AT least within this week.", 
    "This looks better than promised. Very straightforward to put together, just need to take your time. It helps to have two people. Everything went together easily, we had put something together like this before, so had some familiarity. Instructions very clear. Solid when finally all built. Looks great as an open display cabinet!", 
    "I purchased three of these shelving units more than a year ago, they are sturdy, easy to assemble, and look fantastic! In my last house, I used the three units vertically as a room divider, and, since they were standing on carpet, I fastened them to each other with screws. They looked very nice and even stood up to my cats jumping all over them. In my current home, I have two units vertical and the third right next to them horizontal, it looks fabulous! Again, they are on carpet, so I have them fastened to the wall for stability. I am very pleased with the way the units are holding up...they came through the move without becoming loose and starting to fall apart. I highly recommend these!", 
    "In the description it clearly states; \"Wood\" as the material this unit is made out of. So I was surprised to find that when it arrived it was actually press-board (or a press-board type material, which I guess is made from some type of wood) with a plasticy-laminate finish. Not at all what I was expecting. That said, had this particular unit been made from real planks of wood, it would have weighed a metric ton. This unit is surprisingly light for it's size which was the only bonus. Instead of using it where I'd planned (in the living room with other furniture made from real wood), I put it in the hallway. It looks good there and won't get the scrutiny it would have in the living room. The stickers (yes, stickers) that cover up the hardware don't really match the unit and can be seen clearly from a few feet away. Overall I like the unit and I found a way to use it, it just wasn't what I was expecting.", 
    "I bought this bookcase for our game room. I am using it on its side under the wall-mounted tv to hold dvds, wii games, etc. I also put baskets in a few of the cubbies to hold my children's toys. It is very stylish and just the right size. I like the fact that the height is higher than a TV stand. It is a great edition to the room. The only thing I would warn is be sure to look at the pictures in the assembly instructions. We had to take a few pieces apart because we put them on backwards but when I looked closely at the pictures I could see which direction they were to be in. But I do see how that could frustrate someone. It definitely took me and my husband to put it together. Would have taken a lot longer without the two of us. Overall, we are very pleased with it.", 
    "Very impressed with the fast shipping and how well the display was boxed. Took about an hour to put together. I have had numerous people wanting to purchase one after seeing mine. Very pleased with the purchase and product.", 
    "The Espresso color is really nice and rich looking.The option of horizontal or vertical makes it very versatile.", 
    "Nice bookcase to display some books, ceramic bowls and keepsakes. I wanted a bookcase that would not take up much room and would be more modern. It was very easy to put together. The directions and pictures helped. Mine is on carpet so I will be anchoring it to the wall so that it doesn't tip over. If you have children, I would do this right away. I received all the pieces and hardware. Nothing was damaged. Both sides are finished so you can use it as a divider(level floor) or use either side. Happy with the product for the price. Blends well with my other furniture.", 
    "These bookshelves are very nice. I bought two and they look really good side by side. They are very sturdy as well!", 
    "This is a wonderful, elegant shelf. I ordered it back in 2009 so have had it now quite a while. It is solid as a rock, and people regularly complement it. I purchased it in white. It is packed well, in a flat box. It is quite heavy though. I'm 5'6\" and 110 pounds and could not lift it. One of the guys in my building could carry it by himself, but he's 6'4\" and 320 pounds. Plan accordingly, you're going to need a dolly or an extra set of hands if you're not a body builder. Putting it together took about four hours. It's all in pieces when you get it and you have to carefully assemble it because it is a bit of a puzzle, even with directions. Once it is put together however, it's an elegant strong piece in any decor set up and I have been extremely happy with it ever since. It's also not hard to move around as an assembled piece the way it in in the box, more handholds, less solid bulk I guess.", 
    "Love this shelf fits perfect against my wall. Easy to put together.", 
    "Love it! Nothing else to say! Was fun to put together and I love all the unusual shapes!", 
    "There is so much room on this bookcase. I love the different sizes of each section. Pretty easy to put together despite the directions making it look hard!", 
    "Love, Love and love this bookcase. It's sturdy enough to hold big/heavy reference books while adding a chic style to the room. Worth every penny.", 
    "This is a good simple bookshelf. It was a little more complicated to put together than I originally thought it would be (a few pieces needed some real muscle to put into place!) But overall it is a nice addition to our front room and a good place to store my books as well as trinkets!", 
    "Loved this bookself. Was easy to put together and included all the pieces. Heavy Duty piece. Very happy with quality.", 
    "I bought 2 and they are a quality beyond my expectations! They were very well packaged (double boxed) and the use of materials between pieces protected each part to ensure no damages during shipping and handling. (I was impressed!) Assembly of the units were done in such a way as to ensure that they will remain well built and no concerns of ever requiring any adjusting or tightening. (Again - I was impressed!) I have purchased several furniture items from Overstock and these are of excellent quality, very deep shelves and such a unique design - I would have expected something like this from a quality furniture store (assembled) and easily costing double or more. Very, very NICE! I may consider other locations in the home where I could use these!", 
    "The package came very quickly and the shelving unit was fairly easy to assemble. Overall I believe the product is OK for the value. Not sure if I would go through the hassle of putting this together for the price paid.", 
    "Love this bookcase. Waited until the price was right, and made off with it. Gets lots of compliments, looks great. The material is not solid hardwood, so it would not support heavy books long-term, but for smaller items to show off, it serves its purpose very well. Looks great standing upright or lying on its side, and functions well against a wall or as a room divider. Very versatile, great buy.", 
    "Very good use of space. The laminate looks like plastic, not wood, but it is priced very inexpensive and real wood would be much higher. I wish the walnut color was true walnut/medium brown. It's actually very dark brown, close to black. Took me about 2.5 hours to put together alone. Easy to put together. I bought two. They were a bit heavy (very solid). A couple of guys offered to help but I didn't need them", 
    "I loved the first one I ordered so much that I ordered another one. They really add a lot more style to a room than an ordinary book case.", 
    "This is a great piece. I'm using it in my combo Office/guestroom to divide the room and to maintain office clutter. I bought a bunch of rattan baskets from Pier 1 of varying sizes and they all fit perfectly. It looks really good in the room and keeps the room feeling light and airy.", 
    "I ordered the leveled bookcase to fill empty space in my loft. Originally, I had planned to have it stand tall against the wall, but in the end have it laying on it's side, which I actually like more. It fills the space along the wall nicely. One of the reasons that I didn't leave it standing was that the piece to attach it to the wall was missing and I didn't feel like wasting time to get it sent out. Secondly, on one of the sides the board is a bit warped or something that is causing the attached part not to lay flush against it. It took me about 2 hours to assemble on my own, not too bad, you at least get to use regular tools rather than the hex wrenches that you sometimes get. The quality is pretty good and it looks great in the room. I love all of the different shelves to stack things on. Overall, pleased with the shelf and recommend it!", 
    "This was one of the easiest do it yourself installs of the many products I have put together. Add to that the thickness of the MDF panels and it is a quite sturdy and attractive piece. Take your time and follow the directions and you will be happy with the results!", 
    "I am very happy with this bookshelf. Looks great in my lounge.", 
    "I really love the design of this bookcase. I put two in my living room together and they look great.", 
    "Love this book shelf, looks beautiful in my den, easy to put together, very sturdy and well built. Thank you Overstock !", 
    "I love the style of the bookcase. My freight d liked it so much that she wants to by one!", 
    "Others have written volumes on this item. I will just say its great, sturdy and value priced. Assembly takes time but doesn't everything. If you like the picture you will LOVE it in your house it's just cool. Regards, M", 
    "The photo of this product is beautiful, but you never know until you receive a product what the actual quality is. I knew the moment I opened the box that this is FIRST RATE. Excellent quality wood with fully drilled holes for easy assembly. Instructions were clear. And it looks sensational.", 
    "I liked this bookshelf so much I bought another for a different room!", 
    "Love this piece! Solid wood, modern, holds accent pieces nicely and a breeze to assemble", 
    "We purchased this bookshelf as a Christmas gift for our daughter and it looks awesome in her room!", 
    "I realize the price is great but I read the previous reviews and thought this must be a great deal. Several commented that it was solid wood. I knew it wasn't going to be solid walnut, but I thought it would be more substantial than really poor particle board with plastic woodgrain laminate over the top. Seriously, this isn't even close to wood. Nothing about this product is except the wooden dowels. I probably will keep them and use them in a different room but they aren't the quality of piece I want in my living room. Oh, did I mention the plastic hold covers....yeah, those are exceptionally bad. I will say this, it is NOT hard to put together. Seriously, the pictures are easy to follow and it took all of 45 minutes each.", 
    "We were looking for something that could hold a few books and some sports memorabilia under our wall mounted flat screen in our bonus room. It needed to look nice and not cost a fortune. This fit the bill perfectly! It's very solid and sturdy, not difficult to put together (although it takes some time), and more interesting to display things on than a regular bookcase. We are using it sideways rather than upright. We are very pleased and highly recommend.", 
    "These are nice and solid and easy to put together. We are using them horizontally and they look great. Finished on all sides. Well packed. Good instructions. Very happy with these book cases.", 
    "You can assembly it allone . Its a study book case with a dark finish. Its a nice addition to add to your living room.", 
    "it took several hours to put this product together but once it was complete it looked awesome! it's a great piece to showcase trinkets and books. I'm very happy with this product. i would recommend using more advanced wood glue rather then the little tube they give you with product.", 
    "Covers a large space on the wall. Modern look...love it!", 
    "I love these shelves! Just what I was looking for to display some of my favorite things, and the varying levels really add character. Only complaint is some of the parts weren't labeled so it was a little bit of a challenge to put together. Once assembled, it's awesome!", 
    "Bookshelf is great for a living room but assembly was hard with just one person.", 
    "Very well made, nice and solid hold art work perfectly.", 
    "&#9632;Materials: Condensed wood I was foolish enough to think that this was a wood product. IT is compressed wood with a plastic wood veneer. I sealed the box back up and gave it to my gardner. My error!", 
    "Needed to get a bookcase for my little girl room. Since she is only 2, I wanted something that would work both horizontal and vertical. I needed something sturdy and an artistic design. This fit the bill and the price was great. It only took my husband and I about 45 minutes to put it together. Extremely pleased with the product and functional design. It fit her room perfectly.", 
    "Fairly easy to assemble except some screws required a power drill which I had to borrow.", 
    "I'm using this cabinet to display my sons many athletic trophies. It excellent for that. The quality was very good for the price. There were 2 parts missing. I contacted Overstock on line and the replacement part arrived in less then a week!", 
    "Sturdy, stylish and versatile. Very easy assembly - just over an hour from start to finish. Very pleased with the quality and the differences in sizing of the shelves allow us to display and store various sized items. Definitely pleased with purchase!", 
    "We received our shelving unit and began putting it together right away. Definitely needed two people and it actually took a couple hours but it went smoothly. The directions were very clear and we really had no problems at all. It slid into the spot we had for it, shined it up, put a few books and pictures on it and we love it! It really was exactly what we were looking for and the whole experience lived up to my expectations and even exceeded them a bit.", 
    "It was well packed for shipping. No damage to the pieces which is always a challenge when ordering on line. Assembly was very easy. And great design.", 
    "I bought this to use as an alternative display case - it is on its side in a specific room and it worked out perfectly. I'm very happy with the quality and the finish, it is very sturdy.", 
    "I debated for several months on what I wanted to do on this wall in my living room where I had already had a nice looking but dinky and out dated collapsable shelf bookcase. I had recently started to livin up my living room area with new tables, lamps, and other things and replacing that bookcase was just the next obvious thing to update. I wanted something different, modern, and not boring. And something to display things on nicely. I visioned what I wanted but I hadn't quite seen it on the many other websites and stores that I had visited searching for this thing in my head. Anyway, I finally saw this display cabinet/bookcase on OS.com and just knew that was what I wanted. I immediately placed it in my shopping cart that day but waited for about a month before finally purchasing it. Just to be sure I wouldn't come across something else. When I finally did order it I was happy to see that the price had dropped by *** on what I had already thought was a decent price. I received it in less than a week on a Thursday , saved it for the next night to put together. If you like putting things together it's a breeze. It took me about 1.5 - 2 hours to put it all together myself. The instructions were very simple and clear and I had fun putting it together. I am very pleased with this purchase. It sits centered on a wall in my living room area with everything on it displayed nicely, you just can't miss it as it draws your attention to it immediately upon entering the room. Great value, stunning looks, good quality!!", 
    "Very stylish and sturdy bookshelf. Was fairly easy to assemble, but as with all furniture it did take some time. Quality was better than expected, especially since it was ordered online. Would recommend this to anyone considering a bookshelf.", 
    "For its price point, this is a very nice display case and excellent value for the money. Putting it together takes a bit of time and patience but it is not difficult at all. I had no problem putting it together by myself in about 2 hours. After assembled it is very sturdy even without using the included glue on the dowels. I didn't use the glue because I wanted to have the option of disassembling it in the future. I ordered it in white so as to best show off the items I am displaying. I've got it standing perpendicular to the wall, using it as a divider between my living and dining areas. It adds a nice modern touch. I didn't want to secure it to the wall, so I used some felt pads to level it on my uneven wood floor, and put some heavier items on the lower shelves. This makes it stable enough for adults but it wouldn't be stable enough if there were kids and/or pets here. I am very happy with this purchase!", 
    "Lovely display area and functional bookcase as well. Displays lovely decorator pieces in a unique shapes love it", 
    "I love these bookcases, they are a bit complicated to put together (don't forget the wood glue) but by no means are they difficult and they are really stylish. Highly recommend!", 
    "Looks beautiful, it was easy to assemble, and it is solid. My husband is a professor and likes to have bookcases in our living room. This was a perfect compromise between functionality and decor. Looks great in our living room, we are ordering another one to fill the wall. I highly recommend it.", 
    "For the price these shelves are nice. Not for those not willing to put in the time/effort it took to put it together. I've had a lot of compliments and they filled a need for storage.", 
    "Great, sturdy product. I used the item horizontally instead of vertically and it works really well in my daughter's room for books and displaying objects. The unit is very heavy and solid, looks like it will last for quite some time.", 
    "This bookcase is so reasonably priced... it looks like it should be *** instead of its price!!! The assembly was okay. but when I had my parents purchase the same bookcase, I had a \"handy man\" go to their house and put it together. Everyone who has come to my home has exclaimed over it, and believe it or not...it holds a \"ton\" of books, pictures, vases, etc.", 
    "You're not going to mistake this for a fine piece of furniture, but they are sturdy and really unique.", 
    "Very sturdy. Very expensive looking. Very attractive. Great purchase. Takes a while to assemble but that is what makes it so sturdy.", 
    "I have four of these items. The first one was difficult for me to assemble. I had to get help from a handyman. It was too heavy for me to handle alone. It took patience and time. But, the final result caused me to buy more of these items. The second one was much easier for me to assemble, after learning what to do from my man. I was looking for an item that would disguise the furnace controller on the wall and this bookcase did that. It's heavy enough to hold quite a bit. I recommend securing it to the wall if you live where there are earthquakes.", 
    "Great shelf. Putting it together takes a carpenter or genius, not for the regular gal trying to put together, but once it was assembled, the unit is fantastic.", 
    "I purchased two of the Verena bookcases and one Mandy bookcase to display artwork. The three look great together. I think the Verena's cubicles are a little more usable for art display than the Mandy. The instructions that came with the bookcases were excellent. I had no trouble putting them together by myself. Once put together, I did not like the way the wall showed through the back of the bookcases, so I lined the back with some pretty off-white rice paper. It actually made the bookcases more elegant and enhanced the art display.", 
    "This is particle board. Don't be fooled by the pictures. The value is good and delivery to your door is good and the style with non-symmetrical shelves is interesting, but this is not a quality piece that is intended to be kept for a long time. The screws and other connectors require a sticker to be placed over the holes in order to appear as a seamless piece of wood. Not true. This isn't wood and the finish isn't finish. The finish appears to be some sort of thin laminate, thinner than wallpaper. I placed some self-stick felt on this in order to slide the shelf on my tile floors and I pulled the felt off to reposition and the laminate covering pulled off also. This covering was reaaaaaaalllly thin. I put this together by myself in a few hours, but I've put together many overstock pieces in the past, including some very heavy rubberwood dressers. This is the first overstock piece I've ever purchased that I was not completely satisfied with. Certainly not the normal quality of products I've purchased from Overstock.", 
    "The package is triple boxed and was well protected even after the UPS left it in the rain outside. The boards are MLF's and can be easily chipped/damaged. So make sure to assembled the pieced on the carpet or on a blanket. The boards are thick and heavy. So if you are looking for the elegant/classic style, this is not it. The bottom line is that you get what you paid for, and that's all that one can ask for.", 
    "I have this turned on its side in a hallway with a number of pictures and other decor. Lots of comments from friends about my display. Everyone loves it including myself.", 
    "We got 2 of these in the white to brighten up our rather brown living room. They were fairly easy to put together. They are solid feeling not like cheap plywood. If you have kids I strongly suggest you take the time to install the anti-tip strap to the wall since these shelves are slightly unsteady on their own and you don't want them being pulled over onto your baby. I really like the look of these. Definitely different than most bookshelves. And they hold a lot of books and DVD's. More than I thought it would. We have gotten several compliments on them. We are happy with them.", 
    "We put this next to our tv that hangs in the living room. It's really a nice piece for the money. It even came with an attachment to secure it to the wall so it wont tip over. The wood is a nice deep dark walnut color--almost espresso. My very handy husband had it assembled in about 30 minutes. Not sure how long it would take the average person. All boards were labeled 1,2,3,4 etc and great instructions. It looks great!", 
    "Not too difficult to assemble. Finish is a nice quality. The only drawback is the screw hole covers. They are round stickers. My concern is how long they will last before they start to peel away thus revealing the natural color of the product which is under the black finish which is a start contrast. Overall nice piece for the price.", 
    "I will probably order another one. This is very well made, very easy to assemble. It is a great way to store books, collectables, anything else you need to store. Quite attractive with the different shaped spaces available. This is the first product I've written a review for-take my word, you'll love this product.", 
    "I loved how this bookcase was not our average \"cookie cutter\" bookcase. Great for displaying books and other items.", 
    "I put this together by myself and as a 63 yr old woman, it was not an easy task. ONe has to be extremely careful to follow the pictures in the description exactly. The hardware is very different and took a bit of getting use to but although I was sore and somewhat bruised afterward, I did get it together by myself and it looks good. It is good to anchor it to a wall since it seemed to tip easily. It would not be good for small children as there would be a real attraction for them to climb on it.", 
    "The shelves are very pretty. The instructions are easy to follow. But the materials used for construction are fairly flimsy. I inspected the materials when they arrived, then later found a quarter sized hole in one side panel as I was almost through putting them together. I assume I did it, but have no idea how. Nothing was dropped on the panel. Even worse, 8 of the pre-drilled holes for the part that locks the screws holding the shelves in place were drilled too deep and it was extremely difficult to line them up. If not lined up properly the long side panels can not fit flush with the shelves. I like the style. They look good. I would not purchase them again.", 
    "With an electric screwdriver and partner; this was easy to assemble. Perfect for displaying and using as a bookshelf that can be vertical or horizontal! Love this especially for the price. We purchased two! One for the home office, one for the business office!", 
    "I really like this piece. It was all I'd hoped for. Everyone who has seen it has liked it as well.", 
    "The first thing that should be in the instructions is : THE PIECES HAVE NUMBERS ON THE BOTTOM ! Had we known this , it would have saved a lot of time... You have to look carefully , as the numbers are printed on the '' raw '' edges of each piece , and might just appear as smudges unless you were specifically looking for numbers . Even not knowing that , this pair of over 70+ year-olds took about 45 minutes to assemble this bookcase , and we are very pleased with the result . It is sturdy and a bit out-of-the-ordinary , just like us ! We will order another one !", 
    "this piece is a nice addition to our living room. We ate using it as a TV stand.", 
    "This display unit is very solid and of excellent quality. Assembly looked daunting when the box was opened, but turned out to be surprisingly quick and easy. Because of the high quality, all holes matched up perfectly and total assembly was a little over an hour.", 
    "I ordered white color and it match my white bedroom furniture perfect. The assembly looked hard at first but if you put all the peaces in order how it describes in the instruction after the first unit it will be easy. But you need two people if you are not professional.", 
    "Product was promptly shipped and received. The packaging was better than previously purchased \"ready to assemble\" furniture products. Each shelf was well protected and packaged, no damage or scratches from shipping. Because of the contoured nature of the shelves this bookcase has alot of parts but each part was clearly marked so assembly was straightforward, but time consuming. All parts fit together well so there were no issues in putting it together. Once completed the shelf looks just like the picture on the site. We like the contoured nature of the shelves which makes this bookcase good for displaying objects, pictures, etc. Color also matches our other furniture well. All in all we are very pleased with this purchase.", 
    "I loved this bookcase. It was easy to put together & being able to lay it horizontal (my choice) or vertical is great! Very nice for the money & I'm considering a second one.", 
    "We purchased this shelf for our son's room because he has so many big books. It can hold an impressive amount of different items with no question about whether the shelves are sturdy enough. Nice product!", 
    "The shelf does definitively not look as good in real life than on picture. I was first disappointed by the color, the white looked dull, almost dirty white and not the shiny lacquered white I had imagine. But the worst is after it mounted, they give white paper stickers to cover the wholes where the screws are. It's horrible, I have never seen that before, even in ikea stuff. Overall disappointing but not worth returning so we kept them.", 
    "This is a great bookcase. It is sturdy and solid but has an open feel. It was easy to assemble. The shelves lock together nicely and the entire piece does not shift or lean. The finish is very nice.", 
    "I looked at this bookshelf for nearly a year before purchasing it. I wanted a shelf I could use vertically, this one looks fantastic! I'm extremely pleased with the quality and look of this piece. It adds dimension and an air of creativity to my living space. It took two people about an hour to put together. The directions, although merely pictures, were very easy to follow. All of my friends LOVE it. Order quickly before they buy them out of stock!", 
    "This shelf is just beatiful. I like it more than I did in the picture. I have a small living room and was replacing a sofa table. I had family over the same day we put it together and they looked around and told me somehow the room was looking bigger. I have it on its side and it does give the room a more streamlined clean look and the it is definitely a conversation piece.", 
    "I purchased two of these bookcases in white. The directions are all in picture format so it was difficult for me to put together. Luckily I have more spatially inclined friends. We put two of them together in about 2.5 hours, the second one definitely went faster. I love the look of these as they look more expensive than they really cost. I'd definitely purchase again!", 
    "I am thrilled with the look of this shelf. It looks great with all our gaming systems and baskets for our games, movies, etc. The box did not include directions for assembly however customer service emailed them to me right away.", 
    "The different sized boxes really add some flair to the traditional book case. I really enjoy this piece.", 
    "I was happy to find this bookcase at a reasonable price after searching for many months for an affordable, interesting-looking bookcase. The bookcase does look as good as it does in the pictures in the website -- at least from afar. Up close, you can see the stickers used to cover the screws, the marks that the bookcase got just from assembly, and other minor imperfections. Perhaps assembling the bookcase on a blanket would have helped prevent these, although I have two shelves (one on each side of course) where the alignment is just enough off despite fairly meticulous assembly that you can see an unpainted portion of the shelf. Assembly was easy enough (90 mins to 2 hrs, as the other reviews stated), and the result looks good, although I am nervous to put anything heavy on the top shelves when the bookcase is oriented vertically. I feel that I need to weight down the bottom shelves or the bookcase could easily topple (not that it would, but you get the impression that it is flimsy). Overall, this is a versatile piece of furniture that looks great if you can mask the imperfections.", 
    "This is an amazing unit it is easy to assemble and when it is finished it looks like a million bucks you must attach it to the wall if on a carpet or place it horizontal if on wood floor it does not need to be attached it sits flat.", 
    "I hate to say anything negative because we've had good luck with Overstock, but these are super-compressed-laminate looking and I don't recommend them. We will keep them because we are too crazed to try to send them back, organizing the packaging etc., but definitely a case of \"You get what you pay for.\" Blick.", 
    "I love this shelf! I was worried it would be more for decorative purposes and not suitable for holding heavy volumes of books. I couldn't have been more pleased to see that it is extremely solid and can handle whatever I want to put on it! One person put it together with no issues at all.", 
    "Shelves are heavy and sturdy when assembled. Assembly benefits from preparation and patience. Read all directions first and inspect the picture illustrations. Note where pre-drilled holes appear in the illustrations to place shelf pieces correctly (if using vertically you may want most screw and lock positions on the underside of shelves). Assembly is easier when you have a clear mental picture before starting. Lay out all pieces (note stickers marked on sides for identification), then proceed one step at a time. Easy. Assembled shelf units are large enough to hold books and objects of differing sizes and sturdy enough not to topple. I do wish the screws could become invisible (instead of being covered with stickers) but for the price these units provide an inexpensive and nice looking solution for storage and display.", 
    "we used 2 of these to simulate build-ins for the living room, along with a white TV stand in between. Very cool and inexpensive was to make a substantial impact.", 
    "i put this together in 3 hours..i.m a 77 yr old widow and had no problems, other than stiff joints from bending....i tried it vertically but turned it horizontally before putting objects on it.....either way would have worked okay.", 
    "I loved the first one so much that I purchased another three. Everyone compliments me on them.", 
    "perfect modern versatile bookcase. i wanted something modern yet wooden and not traditional looking that had simple shelves for books. I am using 2 in an L shape and using vases interspersed with books for a clean yet modern functional look.", 
    "The bookcase was exactly as described and looked very good both horizontally and vertically. (We ended up with it vertically.) I wanted something that went well with my oriental bedroom and it is perfect. It was easy to put together and very solid. I feel very comfortable putting anything on the shelves and really like the different heights and lengths of the shelves - it really adds a nice touch.", 
    "Assembly directions were not very clear; but after we laid all the pieces out, it was fairly easy to put together (have drill charged). This turned out to be a beautiful piece of furniture!!!!! Using if horizontally in our entryway. Works wonderfullu!!!!!", 
    "This shelf is great! I wanted something a little different and this is it. Functional & it looks great. It adds some pizazz to any room. Great value for what you get & what you're paying for.", 
    "It did take me awhile to put this together, but it was pretty easy; I just wanted to take my time. My only complaint are the camlocks. Just like the previous customer stated, the holes were drilled too deep. I probably didn't lock some of them because I just couldn't get it to line up and my fingers were already sore from the allen wrench. Liked the end result. I'm afraid if I were to move this furniture, I would have to be careful as I can see it fall apart if not handled properly.", 
    "We purchased this bookshelf to add some pizazz to our den and also to have a space to house our many books. This was by fay the best bookshelf I found for an affordable price. I like that you have the freedom to stand it vertically or horizontally. It is sturdy enough to hold textbooks and decorative items. It has become a focal point in our den and brought together all of the decor. Better yet I bought this at the sale price. You will not be disappointed.", 
    "This shelf is pretty sturdy, but no matter how much you tighten the screws you can see cracks between the pieces. I bought a similar product in expresso color from a local store for $20 less and it looks so much better....not sure if it's just the white color or what. I'm dissapointed in the look, but it's too costly to return. I would not reccomend.", 
    "Easy to put together, and came VERY quickly, I am going to order another one", 
    "Really like the shelf! Color is true to picture! Directions kind of hard to follow! Shelf is sturdy when constructed! Would recommend! There are a lot of shelf space to put stuff on! Doesn't look cluttered either!", 
    "Composite Shelf Unit with offset spacing. If you have assembled one of these before you know that they are easily assembled with the unique turn and lock assembly fasteners. Shelving is heavier than most, 11/4 inch in thickness. The dark color matched the computer desk purchased previously. The offset spacing gives more support, style and should decrease or eliminate any sagging or warping. I already have it stocked with various office materials and it is holding them very well.", 
    "For the money this piece worked out perfectly. It is sturdy and looks nice. The shelving pattern is more interesting than most other shelving units in the same price range. I would buy this again and recommend it.", 
    "Bought three of these units to make a large display area in my living room for arts and crafts and some books. Used one vertically, and two horizontally (one on top of the other) to give a variety of display space options. The units display my items beautifully and I was able to place taller items along the tops of the units, too.", 
    "This is really a nice piece. It took me awhile to put it together because that is just not my thing. It wobbles a little (only if you push on it like an obnoxious friend did) but I think that's because of my putting it together. It's cute and I love how it's not your average bookcase. I use it to cover an ugly a/c grate that takes up about 1/3 of the wall. I feel that the openings do not obstruct it but makes it less noticeable. It's really a great looking bookcase.", 
    "I love this shelf. I couldn't decide if I wanted to use it as a bookshelf or tv stand. So I am going to order another one so I can have both n dot have to choose! I love it. It's worth the buy.", 
    "cute for books and other objects....good for a small space", 
    "It's a nice looking piece once you go through the agravation of assembling it. It looks nice standing up or on it side. I wouldnt put a huge weight on it but items like those pictured it's fine. The Bad part is assembling. For the most part the instructions are fairly clear. I've had personal experience putting together plenty of desks, bookcases, etc using screw locks and dowels. Most furniture of this type gives you an extra few screws etc. This set was short a dowel and had the exact number of other parts to put it together. The dowel holes were not all the same depth and I almost damage a shelf trying to put it together. Also the tubes of glue that came with it were paste. Recomend having your on bottle of elmers glue. Less mess and headaches. I would also dry fit all the dowels just incase you need to trim the dowel or clean the hole. Seemed the dowels were almost too big for the holes. The shelves can be put together by one person but you need two inorder to get all the sides on. The sides are not solid. They are hollow with bracing where the screws and dowels go. The unit overall is rather light and fairly strong. With our wall space we had originally planned use it like it's pictured but with the shelf design we flipped it on the side and works just as well. Over all I like the product. Assembly was an evening of my life I'll never get back.", 
    "We were very pleased with this purchase. It comes in pieces and it took us about 40 min. to put together. Just follow the instructions. We have had many compliments", 
    "good quality for price, gives the living room an added dimension, would recommend to a friend", 
    "Happy with look, size, function. Easily assembled by handy husband. Only drawback is matching wood-colored adhesive seals that cover multiple screw holes: cheapens look of unit (not noticed from distance). Also, no extra seals provided.", 
    "This shelf is very nice and will compliment any room. My husband put the shelf together and didn't have any issues or problems. Directions were clear and easy to read. The wood could be of better quality, feels/sounds more like plywood then actual real wood. But, so far I really like this shelf/bookcase, it's very unique and stylish. We've only had it put together for 2 days and so far so good!!", 
    "This book case is great. I love the art deco feel of it. Looks great in my Living room. It has been assembled, and assembly wasn't difficult with the directions. IF I had the room I would purchase another.", 
    "I had my eye on this bookcase for quite some time now. To my surprise, it went on sale with free shipping! I ordered it in white right away. It came within 2 days. I was a bit overwhelmed when I saw all the pieces I needed to put together. The instructions were great and easy to follow. There was a checklist of everything needed before I started. Everything was there. Within 1 1/2 hours I had my beautiful display bookcase. I love it and it fits perfect on the wall space. Great packaging as well! I highly recommend this.. you won't be disappointed.", 
    "Overall, we are very happy with this purchase. It's large scale had us a bit worried it would be too bulky but it actually brings your eye up and makes the room look larger while the open shelving keeps it from being too closed in and hefty (which we were scared of). The odd shaped shelves bring interest to the room and we now have an eye catching piece for our living room that we needed! I have recommended the product to a few friends who are looking for something similar.", 
    "My husband and I did take a little over an hour to put this together. We thought that the directions were a little hard to understand (just pictures, no written details) but it went fine, just took a little longer. You only need an electric drill and a phillips screwdriver. We liked that they included wood glue to put on the dowel pieces as we assembled! Our entry affords a space for this to be horizontal and we love the assorted shelf styles and sizes. It adds a lot to our room with various hand blown glass sculptures etc.", 
    "I bought two bookcases and have installed them vertically side-by-side. They match up well and they do come with anchors and straps to prevent them from falling over (definitely a risk if you are putting them on carpet and do not have all the heaviest items at the bottom). The bookcase came with NO EXTRA hardware. A couple extra screws would have been nice because I ended up stripping the head of one of them.", 
    "We bought 2 of this bookcase in black color. It's very sturdy and nice wood quality. It's easy to setup also.", 
    "Each piece of the bookshelf was cut to just the right length. No exposed screws show when looking from above. There are sticker covers for the showing screws which all lie on the bottom sides of the wood, so you cant see them anyways. Some pieces stuck out about a millimeter more than others, but it is only noticeable to the person building. Overall a very sturdy and good looking bookshelf.", 
    "Really like the product. But you really have to read n follow the assembly instructions...compare the picture while assembling it. All in all I am really happy with my purchase!!!;)", 
    "I love my new black bookcase and would recommend it to anyone. It took me about a half hour to assemble and instructions were very clear and easy to follow. I love how it looks and love that you can position it vertically or organizationally or horizontally..", 
    "The product looks good but to the touch it is a plastic feeling composite material that looks like wood. I am using it horizontal under a wall mounted TV to hide wiring. It looks great but not sure how long it will last due to the material. My husband and I put it together very easily in about 30 minutes.", 
    "I have never purchased a piece of furniture to asemble from overstock before and I was a little leary. I was pleasantly surprised by the ease of assembly, the clarity of instructions and the security of the tools and connectors. I have put together many a piece but this was a joy. I did this for someone else and I wish I had done it for me. This will not be my last from you....", 
    "I like the product for what you can do with it in displaying your items, but I'm disappointed that it didn't match another walnut-colored item I ordered from OS.com. I couldn't assemble it myself with my screwdriver. Had to get someone with a power screwdriver and more patience than I have!", 
    "This shelf had a nice wood grain finish that just happened to match the black file cabinet I purchased elsewhere. My husband had no problem assembling it and all hardware was included. A few inconsistencies here and there but nothing really noticeable unless you look real hard. Very impressive looking piece.", 
    "Bought two of these units and have them together on the wall in my library/spare room. They each weigh @75 lbs in their packing material. Double boxed and foam separated pieces. Arrived unscathed. Took me about 3 hours I'd guess to assemble the first one. Second unit took 1/3 of the time due to learning curve and because I used a longer hex wrench than the one provided. Assembly is NOT difficult if you follow the picture directions. Adhesive dots over the screw holes look fine. Remember, these aren't $1500 solid walnut units! But they look very good and are very sturdy. Thing I like most vs. standard bookcases is the staggered shelving adds a real design quality to the room--an Asian one at that. And it's beautiful to see my teal walls behind the units because they don't have back panels. This makes them integrate into the room very nicely. I highly recommend!", 
    "I really love this shelf. I assembled it myself and use it horizontally in my daughter's playroom. It fits perfectly and there's no danger of it tipping because it is long and sturdy. The only downfall is that it came with small white stickers to cover the ends of the screws. I found this a bit cheap for a very well made product.", 
    "This is a great bookcase. It goes together easy and is very sturdy. The design is great allowing you to not only put books on the shelves. I put a small lamp on one shef , books and nick knacks on the other shelves. We also positioned it in a corner. I love this bookcase!", 
    "We had been looking for a shelf for a while. I was a little worried that this shelf might not be sturdy enough to hold books and various things, but it is very sturdy. A nice peice of furniture for the price! It take about an hour to put together if you have 2 people. It isn't difficult to put together.", 
    "i like my shelf, it toke the guy over a hour to build it but the outcoming was good...", 
    "i love love love this book case!!! i think this is in the top 5 of my favorite overstock purchase!!!", 
    "I have purchased five of these to line the wall in two houses. They are sturdy and easy to assemble. I purchased the white cabinets. They can be used either vertical or horizontal and accommodate both books, files, plants and artistic display items. The surfaces are easy to clean.", 
    "Bought two to put side by side. Looks wonderful. Assemble was easy.", 
    "Excellent product. Very easy to assemble. Can be use as book case or decoration show case.", 
    "i love it! great price pain in the ***** to put together but looks great.", 
    "I really love this bookshelf. I've used it horizontally as a room separator and it works great. It's a very sturdy piece of furniture. The only downside is putting it together. The directions were not the easiest to understand, but all together I built it in about 3 hours. So not so bad. Overall a great buy!", 
    "I had searched for several hours for book shelves and stumbled upon this one. I wanted to have some built, but it was way out of my price range. I looked at some from big-box stores, and they carried the same boxy, cheap shelves. I loved the fact that the shelves were staggered. Which is nice for my collection of books. On the more expensive bookcases, the bottom shelves were recommended to only hold up to 20 lbs. and the other shelves only 10 lbs!! I have a lot of books, so that wasn't going to work. Another selling feature was that the shelves were open, so it kept my living room open. I don't have dark masses against my walls. They also look great against my cherry wood floor. The walnut finish is a rich, dark brown. What you see in the picture is exactly the way it comes. The only problem I had putting it together, was the middle cam locks would never connect right. I just left those out, and only used them for the ends. Just make sure you push the locks all the way in. Those locked perfectly. Very odd. The \"cover-up\" stickers were okay. They look tacky up close, but it's better than gaping holes. With my two kids trying to \"help\" and trying to figure out the cam locks, it took about a good hour. I also used my own 8/32 allen bit and a power drill. There is an allen wrench supplied, but it was harder to turn the screws. At the end, I'm very pleased with my purchase and plan to order more in black for the kids' rooms and white ones for the den!!", 
    "Love this bookcase. It assembled easily and looks great. Having the option of using it vertical or horizontal just makes it that much better.", 
    "the book case has a nice style and really fits my room it took me about two hours to build it i am happy with it", 
    "These bookcases are very sturdy and attractive. They come with good instructions and take maybe an hour to put together (it helps to have an extra pair of hands). They look great and are very versatile since they can be placed vertically or horizontally. I would have preferred solid wood, but these are less expensive and work well for me. The only other thing I would change is that all the holes (necessary for assembling) need to be covered up with a wood toned sticker that you place over the holes. It blends in fairly well, but I think they could have come up with something better.", 
    "I really like this bookshelf. It arrived only a few days after ordering it. No scratches or anything. Took an hour to two to assemble, not too long. I really like how it's different but not too crazy.", 
    "I got 2, they were a lot easier to put together than stated. It took us an hour-we are familiar with this type of shelving, HOWEVER some of the edges are not tight-we caulked a little to close the gaps. The product that they include to attach to the wall is a joke-DON'T Use It. We screwed it to a lower cabinet and then attached it with crown moulding for a finished built-in type of look. The little dots that they include to cover the screw holes are crap-they remind me of paper price stickers-They could have come up with something better than this at this price point. Most of the holes are covered by my books so it's not such a big deal. I love how they look though.", 
    "The website states this bookcase was made of pressed wood, but I was still expecting more. I have a couple things that are pressed wood but very hard to distinguish from real wood. The quality of this pressed wood seems Walmart grade. I was expecting more. I bought it on sale for about $XXX (which I still feel is too much) but this product is totally NOT worth the $XXX+ regular price.", 
    "It is not easy to put together, the directions are a little confusing. It should take a couple of hours to finish putting it all together the first time - looks great and holds a lot of stuff.", 
    "Took just under an hour for two to construct. Easy to put together, all required tools are provided. We have ours vertical and it looks beautiful.", 
    "Despite the weight, my daughter and I put together the bookcase in about an hour. Easy to follow instructions, but you need 2 people. It looks great, is sturdy and adds that bit of pop to the room. I ordered 2 and since my daughter liked them so well, I sent one home with her.", 
    "There were some minor problems with the finish, but overall, well made for the price and looks good in my living rooom.", 
    "This is a versatile bookcase - love that you can use it horizontal or vertical - we bought it for my sons room to hold stuffed animals, toys, etc. I would use it my livng room too.", 
    "I bought 2 of these. I've had them placed side by side and separate. Either way they look so modern. I wouldn't place them on top of each other. I ordered the walnut finish.", 
    "I love the units. They are good quality and look impressive.", 
    "Very cool look time consuming to assemble but not hard to assemble. Pass through design opens the space it occupies.", 
    "I like the bookcase. I especially like the varied sizes of areas so that I can place objects of different sizes as well as books.", 
    "very nice product, no problems at all. very sturdy and easy to assemble.", 
    "This product came on the date that overstock predicted. The quality is very nice/sturdy and visually appealing when put together. My husband was able to assemble in less than an hour. My only wish for this shelf would be if there were more compartments for displaying trinkets, frames, etc. otherwise, we are very happy with this product.", 
    "I received this as a gift for my new apartment and I absolutely love it! This holds so much stuff and it looks great. The set up didn't take long but I recommend having two people.", 
    "Such an awesome bookcase. White looks great and I was able to put together myself with little frustration. Instructions are a little hard to understand but not horrible. Just take your time. I have the bookcase on it's side and height is awesome. I have under a wall mounted TV and it look fantastic. Nice modern piece!", 
    "I've been looking at this bookcase for a while. It was just the right size when placed horizontally and at the black Friday sale price it was a bargain. The assembly went well, though it took me a little longer than some have stated (I'm a 56 yr old, 5' female). It came even quicker than originally quoted and I am very happy with this purchase.", 
    "I was apprehensive when I received it that I would be able to put it together myself. It did take me all night when I started but I was really careful. It was very easy, the instructions and pictures were awesome. I love this bookcase. I have thought about getting another one, it would probably take half the time to do it again.", 
    "I put this together in a couple of hours. No complaints but one suggestion. They should design the hex tool for screws to be a little larger. You fingers get very cramped after a while. Overall I am happy with the quality for the price I paid.", 
    "ordering another one. people love the moder design.", 
    "I like these cabinet very much, it wasn't that difficult to assemble. I ordered one first and realized it was a very good choice for displaying some of my favourite handcraft pieces, so I ordered two more and they look great together and fit a very important wall in my living room. The cabinets are of a strong wood material and very stable, just what I needed.", 
    "Cheaply made not all the joints line up. Laminated particle board. Easy to assemble.", 
    "Pros: Design aesthetic, sturdy, presentable on both sides, works vertical and horizontal, shallow depth (i needed that for small apt) Cons: stickers to cover screws, mdf, not a perfect fit (joints not flush, made i harder to put together, but i haven't noticed the problem since) this is one of those purchases that you don't spend a lot on so it's hard to be disappointed. i think the interesting geometry makes up for the lower-budget materials. at least the shelves are thick enough (i hate super skinny shelves) and the versatility is great. in my next apt/house i will probably use it vertical. I saw other \"mixed shapes\" shelves and thought this one had the best lines. it's about i k e a quality, but i've never seen them sell the intricate of a shelf. measurements: 71 x 36 x 11.5", 
    "I had been looking for a bookcase for months. Most of the bookcases that I found just looked cheap. I wanted a bookcase in wenge color to coordinate with my home office. This bookcase is solid and sturdy. I have hardcover books and glass trinkets stored in this bookcase. It looks like an expensive piece of furniture. My mom saw it and oogled over how nice it is. You do have to put it together but it's a cinch. It took me 30 mins to assemble and place the bookcase.", 
    "This is a very nice looking shelf that has interesting shaped areas to store books or other various items. I am very experienced at putting together pieces of furniture and such, but this shelf was a challenge. All of the center shelves of the unit went together perfectly, without any hassles. The side pieces and top and bottom pieces, however, were a different story. Those are attached with cam locks and metal posts, which should have been resulted in easy assembly. None of the camlocks and posts lined up. None of them. I had to force and fight with each one to get them to line up. The directions were not hard for me to follow, but someone who did not have experience putting together these type of items would probably find the directions difficult to follow. Overall, I really like how the shelf looks, but it was very challenging to get to the end result.", 
    "This was just as advertised and relatively easy to assemble.", 
    "This product is a great buy. It was worth the money we paid. I only wish that it had a back. No worries. I just painted the wall behind it a different color than my wall color and people think it has a back. I love the detail and fact that it is different from normal shelving units. I would have liked it to be a little larger because my last one was 8 feet tall. This unit doesn't overpower the wall like some of the larger units. My family loves it and they can't believe how little we paid for it.", 
    "as stated in my title, good product for the money. easy to put together too. pretty idiot proof.", 
    "My 13 year old put 3 of these together! Seriously......its not difficult. They look fantastic!", 
    "We have this in white, but you still see the wood grain which was a pleasant surprise. I love the arrangement if the shelves..made for interesting display of items we've collected from travels. Exactly what I needed to complete the room and give me the display space I needed. Very pleased!", 
    "When the bookcase arrived it is in pieces. I carefully sorted and inventoriedeverything. There are numbers on the unfinshed edge of each board.Once you organize it and follow the instructions and pictures the process will go very smoothly. It looks great in the family room.. I store books and games on it. It gives a touch of class to the display of books and games. Add a few knick knacks and it looks fabulous. Everytime I walk by I am impressed with the quality and that \"I\" put it together! One nice surpise. They add a security hook to help hold it against the wall so it does not topple over on a child. Just a little added protection. Nice touch! Thank you", 
    "Managed very nicely to assemble all of the pieces. Instructions accurate. Color accurate. For the excellent price, the quality was also most acceptable. Shows well in my home.", 
    "I purchased 3 of these for office space. Overall they look great. The quality is good enough - comparable to any ikea furniture that needs self assembly. I dislike the plastic stickers that are provided to hide the holes for the screws, but besides that I'm very pleased with these bookcases.", 
    "The shelf is exactly what I wanted but was not very fun to put together. The directions are the problem...the type of fasteners are not fun to use and actually did leave a gap or two at the corners where shelves meet (thankfully, not very noticeable ones unless you point them out). All in all, I love the shelf but wish it was simply screwed together (half of it is) to make it more easy to put together!", 
    "The piece was in good shape when we received it. There were no damages to the piece during shipping. It was a little difficult to put together by oneself, but not impossible. We are using it sideways and we have really liked the look and feel it has given to our living room.", 
    "I used two of these bookcases end to end as a partial wall along a staircase. They were bolted down and painted to match the room, but are very usable as they come. Especially once painted with high quality paint they look like a very expensive custom unit.", 
    "Very nice bookshelf and the assembling this product was very simple and could be done in 30-45 mins. Looks beautiful in any room you put in. Great product and will recommend more people to buy this.", 
    "We purchased the bookcase for our den/home office. I have a nice collection of books which I wanted to display. This bookcase did the trick. Not only did it fill in the wall space we had, but my books and other items look great in it. We put iit on its side which worked well. It took us about an bout to put together, but at the end, lovely bookcase.", 
    "We are satisfied with the bookshelf. It is what we anticipated after reading the description on the site.", 
    "The instructions were complete and easy to follow. The product was exactly what we were looking for.", 
    "The shelves and sides are thick - about 1 1/4\" and the wood has a raised grain finish. The quality and style is great, but the instructions are sub-par as they are in somewhat 'broken english'. It's heavy and very sturdy and it looks lovely in a sideways position. I just wish dowels were provided to cover the holes, but stickers seem to be the standard now. . .they're thick plastic black stickers though, so no complaints for the do-it yourselfer. Definitely worth the price I paid.", 
    "worth the price, and very eye catching. not bad to put together. I'm using it as a room divider,between my living room and dining room, so I bought two and put them together, it works great and looks wonderful.", 
    "This bookcase is very nice. I love it. It does take time to put together, but worth it to me.", 
    "The bookcases went together easily only because we have done a similar project before. Otherwise it would have been a lengthy project. They add a bit of flair to the room but would not suggest loading them up with lots of books. Curios are better suited for these.", 
    "Shipping was quick. Packaging was beyond superb to protect finish. Assembly went well, so long as you keep the assembly on the floor consistent with the picture in your hand - or vice versa. Principal single difficulty was obtaining alignment of shafts of camlock studs with receiving slots in camlocks themselves. In installing side supports on to interior shelf assembly, was forced to rework alignments many times to achieve a fit. The trick is to insert a dowel or screwdriver shaft of appropriate diameter to force camlock slots into alignment before attempting to insert studs. Unit is gorgeous and a very attractive display piece which encourages USING the books on display!", 
    "This bookcase hold more books than it appears. It is easy to put together because each piece is numbered. Just take your time and follow the instructions", 
    "Had one in bedroom vertically, horizontally n on top of a bureau for a wall unit look..i then bought 2 more n stacked them horizontally in my salon to hold all our retail product as well as a room divider..looks great n very sturdy", 
    "very cool shelves. get lots of compliments on them. not so easy to put together like anything else with a jillion parts but other than that, had a lot of fun arranging books and knick knacks on this thing.", 
    "This arrived very quickly and is a pretty heavy unit when assembled. It is a great room divider or for use as an entertainment unit. I bought two and I'm still playing with their placement in the house. Once again, a good deal for a unique piece of furniture.", 
    "good product easy to put together and the quality was very good", 
    "I was looking for shelving/bookcase to organize some of our books and figurines for our living room and I wanted something that would look real nice and not just a plain bookcase. I'm so glad that i decided to buy this cabinet/bookcase. It looks so pretty once I displayed some of my collection of figurines and books. I can't wait to showoff this beautiful addition to my living room.", 
    "I bought a walnut colored bookcase and the I received was an expresso, brown/black color which did not match my living room furniture so I returned the item. The walnut color shown online was much lighter and closer to a medium brown.", 
    "This is a great shelf if you want an optional layout ( vertical or horizontal) with a variation on straight shelves. Adds a unique element of design to your house. Quality is excellent, wellmade and sturdy. My only complaint is that mine came with no directions. Took a bit of time, but I figured it out. Definately worth the effort!!", 
    "we got two of these shelving units. the first one was quite a bit slower to put together than the second, which i think is probably to be expected. that being said, it was very *simple*, just a bit time consuming. it probably took us an hour to put both units together. we have one on it's side & one upright -- it works perfectly in either orientation. they look sharp, they are sturdy & they weren't too expensive! what more can you ask for? :)", 
    "I have two sets of these shelves. One positioned vertically and the other; horizontally. It works equally well both ways. The shelves were very easy to assemble and are very stable. Just what I needed!", 
    "I would have been happier if it would have been made of a heavier material and didn't require attaching it to the wall. It is attractive in design and I am happy with that aspect of it; but the quality for the price doesn't hold up. instead of wood plus to cover the screw holes, you get little sticky plastic dots to cover them, they work, but once again it is a cheap way to do the job.", 
    "Took hardly any time to put together amazingly. I thought this was gonna be a chore. Nope! Pretty easy and fast! Quality is good And sturdy. I have my black one laid on its side and will be using this as a display case table for behind my couch.", 
    "I love the bookcase/room divider. I'm 72 yrs old and was able to assemble with my daughter's help, it was so easy, and only took about 3 hrs . It looks beautiful and was such a bargain. Would recommend this to anyone. The quality was excellent", 
    "This bookcase is AWESOME!!! My husband and I ordered 2 and they look fantastic in our living room! They were a task to build but it was worth it once we saw the final product. I would recommend this to anyone who is looking for a funky way to spice up their decor. They're beautiful to look at and even more fun to fill the slots!", 
    "I think I read every review here before I bought this. I loved the look but i'm always cautious about furniture you have to out together yourself. Turns out I made a good decision. This is not a high quality display shelf -- it's made of MDF and you have to put little sticky white dots over the hardware holes to conceal them. Having said that, it looks really good and was pretty simple to assemble. I did it myself in a couple of hours, although I recommend you use a power screwdriver if you have one - there are lots of screws. Construction is solid and it fits together well, unlike some assemble-it-yourself furniture. This one is going in the bedroom and I'm actually thinking of buying another!", 
    "Bought these shelves for my game room, and they are great. They were a little hard to put together, but very happy with the end result.", 
    "Over all the book case arrived in good condition, all parts were complete and there was no damage to any of the parts,however... when it came to assembly it seemed that some of the pre-drilled holes were to big and so the parts did not tighten together. Also there was not enough wood glue to go into all holes before assembly", 
    "I absolutely love this piece of furniture. I have chosen to use this as a display cabinet, laying the item on its side. The cutout sections are perfect for displaying various types of artwork, pottery, glassware. Have gotten many compliments on this piece. Was fairly easy to put together and suits my needs perfectly. A great buy for the money and can be used against the wall, as a room divider, or a bookcase. Many options and many ways to display all kinds of things.", 
    "My grown daughter put it together with minimum assistance from me. It took us two hours, but it was not difficult. The directions were clear and the assembly kit exactly so. The result is a most attractive wall unit. I am very happy with it and proud to show it off. serafina", 
    "We use this book case horizontally - it is one of the highlights of our room - displaying books, plants and nic-nacks.", 
    "I'm a little old lady and I put it together in less than an hour, so you know it was easy! I love modern decor and it's perfect for that, but I can easily see this in any traditional or Asian decor, also. It turned out to be beautiful in my space. Being able to turn it either vertically or horizontally makes it even more versatile.", 
    "My living room looks great since I put it up and displayed all my statues and ceramics on it. Very eye catching.", 
    "It seems to be built well and will last a long time, but as I said earlier if you are not careful with putting it together, you can damage it and the design will not stand the test of time.", 
    "I purchased 2 of these bookcases. One went under our TV the long way and one on the opposite wall ... they are very different than what you find in the store. Easy to assemble and very sturdy.", 
    "Ive alway loved this shape book shelf, and at this price it's a no brainier.", 
    "This is particle board with veneer and I would not buy again. Directions were great, easy to assemble, everything lined up, correct counts and no damage. Finished shelf looks nice but is very heavy. hole covers are adhesive dots.", 
    "The bookcase looks attractive and modern. It holds a lot of pictures and my collection of Willow Tree Angels. It was exactly what we were looking for. We received a lot of compliments on the appearance. It was a little difficult putting together.", 
    "I purchased the set for my music room and it was just as described. Great quality for the price. It was well packed and arrived quickly. It was easy to put together and I highly recommend the set to others.", 
    "Out of the ordinary yet quite attractive unit holds books, vases, photos and other display items.", 
    "I am still waiting for someone to help me put this together as I am 65 yrs. old and am unable to do it mysel.", 
    "Love the shelves!!!! A bit tricky to put together but once you get the right tools and more muscle behind them you're fine! Directions were very straight forward except the fine print for the glue - didn't realize I should have used it with the pegs until the project was complete... is sturdy as ever!", 
    "The bookcase was just what I needed! After reading the reviews I felt like this was a excellent purchase especially with Free shipping.Very sturdy and looks great!", 
    "It took me approximately an hour and a half to assemble - I'm 5' 4', female and challenged when it comes to putting things together...it was fairly easy...just make sure you FOLLOW the directions! :-)", 
    "Bookcase came within 4 days and was packaged well so no damage to the product. It was easy to put together once we had figured out which side of each shelf the directions were indicating. My 14 yr old daughter and i had it together in 45 minutes, neither of us is very good with tools, but it only required a screw driver. Once together it was very stable and looks great. We did bolt it to the wall but that is because we have cats if you don't have animals it is stable enough without bolts.", 
    "This bookcase is beautiful, modern and very impressive. Been getting great compliments. Don't listen to the negative reviews. In comparison to other bookcases you have to build yourself, this is superior by a long shot (particularly compared to Ikea products.) All of the materials are thick and strong...none of that cardboard-y stuff you find at Ikea or Target or wherever. Those black stickers which cover the screw holes are barely visible. A visitor would have to stare at the bookcase very intently to notice, which no one would do. Plus, most will be covered by the things you put into the bookcase. That being said, this is not a luxurious, Ethan Allen type bookcase that comes already built in one piece. If you are looking for that (and willing to spend an inordinate amount of money on that), then this is not for you. This is the very best of the type of bookcases you have to build yourself. I, a female with moderate prior building experience, built this with no help in less than 2 hours...and this includes setting everything out and counting everything in my type A way. I do have a power drill/screwdriver, which was key. I did need help moving it into the destination room, though, so you may just want to build it in the room wherever it will be.", 
    "I loved this piece when I saw it online and I love it even more in my home. I am using it horizontally to display my collection of souvenir glasses. It was easy to put together. It took me about 2 1/2 hours altogether (I did it over two evenings). I love how it is a unique piece that you don't see in another store.", 
    "A beautiful piece that is eye-catching and modern. It has more room than I thought for books. I've gotten nothing but compliments!", 
    "You never know when you buy something online what it will look like when it arrives. This bookcase is far superior to anything I imagined. Very well crafted and I put it together in less than an hour. There even was glue in the box. All the holes and pegs matched, and everything was there that was supposed to be there. A great buy for a modern room.", 
    "I love my bookcase! It is beautiful, sturdy and looks great! It took me a while to put it together, but then I was doing it myself. You do have to read the instructions carefully, but it was well worth the time spend assembling it! I use it horizontally and it is just perfect for my room and adds a lot to the decor!", 
    "I really like these bookcases,they look like something from the more \"hip\" retail-/catalog stores. I initially purchased one and came back for another to flank a sliding door in my home. They are fairly easily assembled,but an electric screwdriver is recommended,just do not tighten anything to tight,it is better to go back and tighten more than to risk cracks and damage to the - perfectly aligned,I may add... - pre-drilled holes. I get lots of compliments on these and would certainly recommend them.", 
    "I have a really big wall where i have my TV at and needed some type of bookcase to fill up the wall so I got 2 of these bookcases and it looks awesome!!!! My husband at first didn't think it was gonna be sturdy enough because you had to put it together but at the end he was very amazed by how sturdy it was. It took us an hour to put both of the bookcase together.... We would so recommend this product to our friends", 
    "A beautiful addition to my living room. I bought two, had my carpenter put them side by side then put them on top of two white cabinets from Home depot to make them higher and have a more custom look. I have pictures of how beautiful they are. I wish there was a place that I could upload them.", 
    "Love this bookcase! Easy to put together also. i'm thinking of ordering another one!", 
    "Ordered two of these bookcases for my modern decor One sits normal and the other sits vertical holding my TV. Love it and very goo quality. Thanks.", 
    "This unit is absolutely beautiful. I put it together, bought the white one, painted my room blue, laid the unit on it's side and it looks timeless. I highly recommend this!", 
    "This is an okay piece for maybe a bedroom.. Unfortunately I purchased for my living room and just looks cheap. I'm going to relocate to a spare bedroom where I think it will fit in better. I wasn't expecting the grainy texture as well as the pieces not being flush with each other when assembled. The assembly wasn't hard at all.. Just a little time consuming. Over all this would be a nice piece for a kids room or spare bedroom, just not for my living room. And one other thing, you can get this exact piece from Value City Furniture for around $100... Wish I would have checked there first!!", 
    "The bookcase is an excellent addition to our den. It is surprisingly sturdy. It is a little difficult to put together and it takes some time. However it is beautiful once you get it put together!", 
    "Very pleased with this product and would absolutely recommend for others to purchase.", 
    "I absolutely love this bookcase! I turned mine horizontally and used it as a room divider to display art on. I get compliments on it from everyone who visits. It was super easy to put together (and that's coming from someone who is pretty good at messing these types of things up!). I would recommend this product to everyone!", 
    "We were pleasantly surprised by this bookcase -- a better price than we'd seen elsewhere and very solidly built for that price. Husband put it together easily and alone -- no swearing, which is a good test!", 
    "Great design and easy to build. I bought 2 and the 1st one took me 2 1/2 hrs but the 2nd one only took 45-1hr. Love the design,I used it for books mixed in with decorated statues and family picture frames. I also love the size of the shelf as I was able to put everything I intended to put on the shelfs.Good packing to avoid damage to product.", 
    "The bookcase is very sturdy, looks great and has plenty of space to hold everything I need!", 
    "I bought these because I moved from a large house into a small condo. I have a daughter who will stay with me at times and I wanted to provide a semi private space for her. Sort of works but definitely not what I had hoped. It's exactly as pictured but doesnt provide privacy. Still look good in my living room regardless.", 
    "It's a good shelf, best for displaying items. I mostly wanted to use it for storage, which some shelves are good for, but some of the shelves are definitely best for displaying vases, statues, etc. The only issue I have with it is that its a cool, cold white and the rest of my items in my room are an off cream white. Something to take into consideration if you're concerned with tone.", 
    "Shipping cost was very low ($$$) so I couldn't resist ordering this bookcase. It was very easy to assemble and was very sturdy when I finished assembling it. Looks great in my living room, overall a GREAT first experience purchasing from Overstock.", 
    "The item was delivered within four business days. I cant wait to put it together.", 
    "I really liked the unique design of this bookcase. Something a little different is always appreciated. It allows for all sizes and shapes to be displayed or stored with a little fun. Make sure you have someone who enjoys the puzzle of putting the bookcase together. It may take a couple of hours, but it is worth it.", 
    "I really like this bookcase and use it as a display for art in my home, for which it is perfect. It was easy to put together and the instructions are clear.", 
    "Beautiful, modern, but lots of assembly involved. More than I expected. Give yourself a few good hours.", 
    "Ok it took about 2 hours of putting it together. It's not complicated just a long process. It looks great in my living room and goes with my decor. My neighbors were impress. Be sure to lay the parts down on a soft quilt. I did to avoid scratches from my tile. It's working great as an organizational tool. My kids Xbox is in side and so are all of their accessories. You won't be disappointed.", 
    "I can't say enough about these shelves! I put 3 together in my dining room to display pieces without having to buy a heavy, expensive hutch.... wow!! I LOVE them!! very quality product with very reasonable assembly... highly recommended!!", 
    "I love this shelf. Took me almost an hour to put together, and half way done I ran out of glue. But I found out that using Elmers glue works just as well, and easier to apply because the Elmers bottle has the tip. This shelf is gorgeous. The number spacing on the shelf is unique, spacious. Definitely a good furniture piece to have.", 
    "Love the look of the bookshelf on the wall of my dining room. It became a focal point for the remainder of my decor. It held all of my elephants that I display and gave them a striking presentation.", 
    "I love these! I'm redoing my home office and these give me storage for books, etc and also a display area for items I have picked up in my travels. The contoured design makes for an interesting piece of furniture in comparison with a standard bookcase. I had my handyman put them together and it did take him a while, but he said they went together well. Very glad I bought them!", 
    "A sturdy inexpensive display cabinet that doesn't take up much horizontal space.", 
    "Good for the price, thick, feels rugged enough. We need something this size to go in a specific area and it fit the bill. They were fairly easy to pu together, took us about 30 minutes. They are a little more contemporary than I wanted, but really look ok with almost any casual decor. We are happy with our purchase, I feel we received what was described and it was a good value for the price.", 
    "These book cases were beautiful and easy to put together.", 
    "It was alittle bigger than expected and time consuming to assemble, but it adds a lot to my apartment!", 
    "Purchased this to be used in a basement office for various decorate items and books. Couldn't be happier with this item. Very sturdy construction and looks great.", 
    "Love the bookcase! I got it in the white and it's really sturdy and made well! Easy to put together! I'm very happy with this purchase, especially with such reasonable shipping and handling cost.", 
    "Once I got this assembled I loved it! Very heavy piece great contemporary look. I ordered the walnut color and I'm very happy with it. It took me a couple of hours to assemble but the directions are easy to follow just time consuming... and worth it!", 
    "The display cabinet is just as advertised. I now has a speaker hanging from the front, and a a large heavy curio in the top corner. It went together easily, although the instructions were a bit lacking in that they did not tell you when you needed to construct two identical pieces. I'm fairly experienced putting together flatpacks so this did not present too much of a problem.", 
    "I bought two of these, one to stand vertical and one to lay horizontal. It's perfect! I have my TV on the horizontal side and it looks great. I wanted something that was different that wasn't too expensive but looked nice, these definitely look high quality and I didn't have any issues with dings or dents like some reviewers have (I was very concerned and checked each piece when it arrived). I highly recommend this bookcase.", 
    "I purchased two of these bookcases. I like the modern look and versatility of the shelves - you can place them either vertically or horizontally. I thought they were also a great value and with the low shipping cost, you really can't go wrong. I was able to assemble each in about 2 1/2 hours with no mistakes. Directions were easy to follow and there are not a lot of pieces to put together. Once they were assembled, I didn't find moving them too hard, they are not extremely heavy but once they are in place, they are sturdy and do not wobble. With the open back you are able to place lighting on the shelves which really looks great. Haven't found anything negative about the product.", 
    "Great quality bookshelf for the price. Very easy to put together. Only took my husband & I one hour with an electric screwdriver. Would definitely recommend this product.", 
    "Product arrived quickly. The instructions were a little over whelming at first but once you took a few minuets to review it was quite simple. Only took my wife and I about 1 hr to assemble. Highly recommend this shelf", 
    "Amazing. Believe all the good reviews. It really is that awesome. Wood looks very substantial. It looks like it cost twice as much.", 
    "These are really great shelves for the price. Easy enough to put together, though a little time consuming. They look great and go well with the white theme (partial) in my apartment.", 
    "Let see it arrived on my door step when I got home which is about 3 days after I bought it online, impressive. It arrived in layers of wrapping which in result a very good condition bookcase. It took a good hour to assemble with no difficulties, and I'm very impress with the detailed shape of each panel, and how good the quality used for this masterpiece. My husband and I love it because we collect books with different shape and sizes and this bookcase if perfect for book lover like ourselves. We are very satisfied, and now we know where to shop for great prices with great quality stuff.", 
    "The shelves are NOT a nice as they may seem in pictures and seem like a cheaper IKEA version when assembled. Nothing attractive but worse yet, very poor quality of the finish (discolored and chipped away while moving). We finally found a place for it in our bedroom closet. When covered with clothes behind a closed door, it looks great... DO NOT BUY THIS!", 
    "I love the way these bookshelves look - and how they display my collectibles, books and photographs. The almost look like modern art against the wall.", 
    "great product, great price, fast delivery! I love the color, the modern look, the assembly was relatively easy and quick. love the free shipping, can't beat that. can't beat overstock!!", 
    "I placed this in my spare bedroom. It takes up a small space but I am able to display quite a few treasures.", 
    "We have this on its side and it's perfect for our needs. Lots of room for books, knick-knacks and media storage. Our cats even jump on it and it never wobbles. It was easy to put together and the directions were pretty easily followable.", 
    "Love this bookcase! So do my pug puppies! I found one of them sleeping in one of the bottom sections! If I put something in that particular section, it is promptly removed! How can you NOT love something man's best friend also loves???", 
    "I would give it 5 stars if not the color that was quite a disappointment.I had ordered it in walnut and it turned out to be almost black, VERY dark, nothing like the picture shows. I had to put it in my son's room,since it didn't match my family room at all!! But as I said, it still IS a nice piece of furniture - looks solid and pretty. My husband put it together in less than 2 hours without a single complaint.All in all money well spent!", 
    "Nice, love the modern asymetrical look, holds a lot", 
    "This cabinet is really nice looking, solidly built, and easy to put together. I had it built and in place with accessories arranged in 2 hours. I can easily find several places in my house where this would look awesome, I'm very happy with this purchase.", 
    "I got the product the package was a little damaged but the inside package and the product was in perfect condition. It takes at least 1 hour and a half to put it together, but is pretty easy even when the instruction book says that is complicated and suggest not to give up.... (pretty silly advice). you get a really good value for the money you will pay :), sturdy and durable. thank you overstock:)", 
    "This took a while and a lot of elbow grease to put together. As a fairly handly single female, I was able to do it myself, but it comes completely disassembled (not surprising) and all goes together with a tiny allen wrench. My hands were KILLING me when I was through. Blood vessels were broken, but it was worth it, the piece is lovely and is a great addition. I love that I can turn it on end if I ever move or want to use it differently. My one complaint aside from the assembly - it comes with little 'wood' colored stickers to cover up the hardware - a bit cheesy but after that was all complete I can't really tell from afar. Overall I am very pleased with the purchase.", 
    "This is a great bookcase. We are currently using it horizontally and it looks great. It is very sturdy great quality for the price.", 
    "Great shelf. White has a wood grain to it. Shelves are thick - about 1\" - so looks much nicer than the white shelves you can buy at home goods stores. Width is actually 35-3/4\", not 35\". So if trying to fit exactly, beware. We have ours set horizontally in a nursery, under a window. Great for displaying books, toys and stuffed animals and I've put baskets in some of the cubby holes. The stickers to cover the hardware are a little cheesy but you don't really notice them (at least on the white shelf) once in place and filled up. Assembly not bad if you're used to the 90-degree cam style hardware. Directions weren't great, though.", 
    "Was surprisingly simple to put together. Although you might want to purchase a better alan key to put it together. It would save you some time. I would recommend this product.", 
    "Went together smoothly albeit a little time-consuming. Parts were well labeled and together with a good fit. Everyone that comes to our home admires it.", 
    "Takes time to put together but looks nice. Was a bit disappointed that the covers for the bolts were basically paper stickers.. don't think they would survive long.", 
    "Love these bookcase/display units! Bought two of these units, one black, one white for bedrooms. Easy to assemble following directions but did take some time. All predrilled holes matched up perfectly. They make a really great focal point in the room and hold alot of books, picture frames, and anything you want to be displayed. Lots of areas to put your stuff!", 
    "This display case was shipped right away and came so well packaged that it did not have any damages from shipping. I was very pleased with this order.", 
    "I love this shelf and I get compliments on it all the time! It is great quality.", 
    "Modern design bookshelf, easy to assemble. This piece would work well in an office space in the home. Currently we have placed it in the living room and it is showcasing photos of our family. Multi-purpose.", 
    "nice modern bookcase for a good price. love that there is no back to it so objects on display stand out and can be seen. put it together by myself inbabout 2 hours and i have a bad back. looks great; very happy with purchase", 
    "I'm using these shelves on their side, 2 of them end to end on a long half wall. They look great and hold books as well as other display items. Happy with them.", 
    "I am a salon owner and purchased these shelves for the retail display in my salon. They are perfect! I would definitely buy again.", 
    "These are unique in shape for bookcases, and will get you a lot of compliments. they add nicely to any decor. However, be aware that a local furniture company in my area sells the exact same bookcases for about $$$. It may be worth your time to shop around.", 
    "Took a while to unpack because of the multitude of smaller pieces, but when together well. Directions were fairly easy to follow but you need to have decent perceptual skills to visualize the correct directional placement of all those pieces. The piece was originally bought to place vertically like a bookshelf, but I made a 'rookie' mistake by not allowing a proportionate amount of space around it, and wound up moving it to an adjacent wall to place horizontally. Looks wonderful; unique and classy. However, the circular plastic tabs that cover the bolts don't stick well and collect dust around the circles; I have to be vigilant and delicate with cleaning. Other than this, the piece appears well-built and adds a contemporary feel to the room. Fabulous for the price!", 
    "it was easy to put together. no flaws and every piece accounted for putting it together. I had to read the directions but it took me about 2 hours. solid. I just bought my second one 2 weeks ago.", 
    "someone wrote that they were hard to put together, I had no problem just needed time and follow the directions. they are so nice", 
    "I'd been hunting for white bookcases with an Asian influence, at a reasonable price--and had been hunting for months. I bought two, to go under a long window. These are heavy (90 pounds) and so, durable. I was able to assemble them alone. Directions are crystal clear and all you really need is a Philips-head screwdriver. The angles are precise and I envision these lasting for years. The look is not run-of-the-mill, and loads and loads of space for books and displays. And of course arrived in perfect condition and earlier than expected.", 
    "I am very petite and had no trouble at all putting this together all by myself in about 2.5 hours. It's very heavy when delivered in one huge box, but once you separate the pieces it's not hard to handle. After the second hour, my hand did get tired so I pulled out the cordless drill with the screwdriver bit on it. The directions were very easy to follow and even came with some words of encouragement! The sunken screws do get covered by white stickers, but they aren't noticeable at all because they don't show on the outside. There are a few little joints that don't fit together totally tight, but I can live with that. It's a great price for a really good looking, fresh, modern bookcase or room divider.", 
    "great piece. it looks fantastic and expensive. have received many compliments on it.", 
    "Sleek and great for marketing products in an office setting. Would also be great for the home. The only complaint that I have is putting it together as it took quite a long time by my staff, but was well worth it. Great Buy!", 
    "Just received my new bookcase. I think its great. Love the design and was not hard to put together at all. Couldnt figure out where i wanted it so i moved it around a bit. Im thinking I might wanna buy another one to put next to it. Great shipment and everything was in order when I got the product. Would recommend to anyone who wants to add some style to their room.", 
    "Was very excited for the arrival of this bookcase. Be warned - the package is about 100lbs, which I am so happy knowing I only paid $1 for shipping! When I opened I found two panels that had paint already scratched up. I was disappointed and contacted customer service immediatley (via their chat) and they shipped out the new two panels immediately. I recieved the new panels within three days and got right to work! I had a friend help me out and it took us about an hour and 15 minutes to put together. Please note though - they do include little white stickerts to cover the screws, and it does look a little cheaper, but i have this displayed horizontally, so these are displayed in an obvious way. I think if you flip it up so it stands vertically you won't be able to notice them. Overall very happy and excited to start filling it up with little trinkets. Thanks O.co!!", 
    "Love this bookcase! I bought 2 of them to place side by side. One of the boxes was pretty damaged but luckily the bookcase was in good shape. I would definitely recommend this!", 
    "It is a very good looking unit and I set it horizontally in my living room and put my tv on top of it. Definitely recommend for a more visually pleasing/interesting alternative to Ikea pieces. I got mine shipped for $1! Thanks overstock! Be prepared - the piece is extremely long and heavy and you will need a friend to help you get it into your house or apartment. It takes a while to put together - READ THE INSTRUCTIONS because the parts are NOT symmetrical and have to be glued together, meaning a mistake is going to be difficult to yank out and correct. Assemble it on the spot you want it to be!", 
    "I absolutely love this bookcase! I was looking for a contemporary bookcase that still had a classic feel and this bookcase fit my needs perfectly. The symmetry brings a sense of balance to the furniture but it definitely is still a very contemporary piece. The finished product looks amazing and I am so happy with my purchase. My only complaint is that the instructions took a little time to figure out, but overall they were very clear and easy to follow. I am a very satisfied customer and would absolutely recommend it to a friend looking for a bookcase with a contemporary style.", 
    "This bookcase was easy to assemble and looks great turned horizontally. My 17 year old daughter has her TV on the top shelf and it looks great in her room, it doesnt take up a lot of space but holds a lot of stuff.", 
    "I bought two of these and thus it has taken quite a long time to put them both together, but they look great beside my TV. The color was darker than I thought it would be, but it still looks okay. Lastly, one thing I don't like is that they are so many screws and other hardware that you have to use a lot of those \"wood colored\" stickers which don't look very nice. However, for the price it was a great buy and would recommend it!", 
    "The wood is fine quality and it's not hard to put together but in the one I received some of the holes did not line up. I would put 2 planks together and the edges would be off by a half inch causing the piece to look like it wasn't put together well when it wasn't even close to my fault. I was sorely disappointed in this and do not recommend taking the risk in buying it. I wish I had just spent the extra $200 to get a nice one from West Elm or something.", 
    "Very nice looking piece, although a bit of a pain to put together. My only real complaint is instead of providing snap on covers for the assembly/screw holes, you receive round stick on \"contact paper-type\" covers. Other than that - a nice piece", 
    "Love these bookcases. Would recommend to a friend.", 
    "I purchased 3 of these to go in our lower level because I wanted a wall of shelves that were a little different so I could display collectibles as well as books. These fit the bill. Once assembled ( I did it by myself - each one took slightly over an hour), they are quite sturdy and will be a good addition to the area. We will need to bolt them together for a better look, but that is no problem. Thanks Overstock, for a good looking wall of shelves at a reasonable price.", 
    "This is a great bookcase with many options for placement/orientation depending on your intent. Both laying flat and standing upright this is an eye catching piece with many spots to put various items on, the actual construction of it is quite easy and if done right leaves you with a very sturdy, good looking piece. Provided with the hardware to put the cabinet together are black stickers to be placed over the various screw holes throughout the case itself, once placed they are only noticeable up close and actually look like the tops of a sort of black connector. All in all this leaves this piece as a fantastic addition to any room it's in with the possibilities as to it's perfection left a custom work of your own creative placement of items.", 
    "I love the product. Putting it together was fairly easy. It created the look I was hoping to get for my home office.", 
    "Awesome piece for the price - I am not dissapointed.", 
    "Easy to put together Arrived quickly with all parts included Easy to clean Not your ordinary bookshelf! Adds great structure to the room", 
    "This bookcase is better than I thought it would be!! It is beautifully constructed with quality, solid wood. I use it as a room divder in my studio and it 'makes' the apartment!! I highlly recommend this piece. Also, I've looked in a ton of stores for a bookcase like this one, they run anywhere from $500- $2000, so this is an amazing buy and the quality matches or surpasses those expensive ones. Definitely worth the purchase.", 
    "Though it took a little effort to build (you have to use a little tool they provide for the majority of the bookcase), it was totally worth it. The bookcase is gorgeous and fits really nicely with the rest of my apartment. I couldn't be happier with this purchase.", 
    "A bit of a bear to assemble but worth the effort; all the pieces were in the box. We are using this in our family room to display framed photos. Put a few doilies under some of the photos to lighten the look and BINGO perfect. Highly recommend this item.", 
    "First I want to say, the directions are not spectacular. Second, the image they provide with all the numbered pieces and parts should be studied before screwing together any parts to insure you have the correct #3 with the appropriate amount of holes. But ignoring all of that, it is a beautiful product, takes a bit of time to put together, but the end result looks wonderful. This is a very sturdy showcase and well packaged so that nothing can get marred.", 
    "Not too hard to assemble. A very good looking, verstile piece that appears to be well built. Shipped fast and a great deal for such a heavy package.", 
    "I have bought many of these to go in different areas of the house. They are easy to put together and easy to clean.", 
    "Perfect for displaying photos!! Love the different levels and sizes of shelves. Quick delivery from Overstock. Simple to put together -- I did it myself in about an hour!", 
    "I got these shelves in white for my daughter's nursery and they look awesome. It took me (7 months pregnant) and a friend an hour to put them together. We have put all of her books and stuffed animals on them, and they look great. I absolutely love these shelves!", 
    "PAID PRETTY GOOD MONEY FOR ITEM, COULDN'T SELL IT AT A YARD SALE FOR 35 BUCKS. i WAS HOPING TO MATCH THE LEANING BOOKCASES I HAVE,...ERRR,....NO! THE SHELFS ARE OVER AN INCH THICK,..LOOKS BULKY AGAINST THE WALL. REMEMBER, IF YOU BUY THIS YOU ARE ALMOST STUCK WITH IT. AFTER UN -WRAPPING AND TAKING OUT THE THE BOX {SHIPPED VERY WELL PROCTECTED,.. BTW} IT WOULD BE VERY DIFFICULT TO RETURN. WEIGHS IN AT OVER 70LBS. GLAD OVERSTOCK GIVES AN OPPORTUNITY FOR REVIEWS THO.", 
    "The bookshelves together were the perfect height and width for creating a partition between our kitchen and living room. It took a little time to assemble, but not bad considering the size of them. I think the stickers that you put over the screw holes look a little cheap but are better looking than seeing the screws. Overall i'm satisfied with my purchase, u get what you pay for... painted pressboard funriture that has to be assembled. They look good and i like the design, they make displaying your photos and books more interesting.", 
    "Easy to put together and holds tons of books plus. Used in my daughter's room and she loves the eclectic way her books are displayed.", 
    "I really like the shelf. Took a little time to put it together, but there were no problems (especially considering I did it alone without my husband's help). I wish it was a little bigger, but it looks wonderful in our place. I would recommend this shelf to others.", 
    "I saw a similar shelf on another site but the cost was at least double what was listed on Overstock! Of course I bought it from here and it came shipped on time and wrapped so well, it was bubble wrapped outside the actual box. It was great and the assembly seemed easy enough for my friend to do as I can't assemble anything but all the parts were there and now that it's been put together and up for a while, I'm really glad I went with this bookcase and displace cabinet, it is perfect. I'd recommend! It's solid and looks great.", 
    "Incredible bookcase with nice style and good quality. Easy to put together and I can fit so much stuff and the bookcase is very sturdy. A lot of my guest tent to glance at it all the time and they can't believe that this is a bookcase, it's very nice. They love the style like I do. Hey good price, sleek style, and fast delivery service provided.", 
    "This cabient is nice in style and it's very sturdy. I've put so much stuff in each panel that it's still standing tall and strong. Is what I needed but the style was more and the price is what caught my attention when I was looking for a bookcase. It was easy to set all the pieces together and the shipping was less than a week.", 
    "Very sturdy cabinet for a lot of my decoration and it holds a lot of it too. Price and shipping combined was a bargain, and the quality and color of the display bookcase is incredible it makes everything look nice.", 
    "I like how it's made and how great the quality is. The cabinet is tall and it fits a lot of my things and it's quite sturdy. The the different shape shelves are a nice touch to this cabinet display and not only that UPS shipped it to me in less than a week and I even had my boyfriend put it together and it didn't take him very long. great bookcase for less price and provide great quality service.", 
    "The unit arrived in a short amount of time. I had been looking for a bookcase of good quality that was not the traditional cookie cutter bookcase for a long time. This was it. It is sturdy and was not that difficult to put together, but it does take a little time and patience. It is helpful to read through the directions and lay everything out before starting. It is helpful to already be familiar with the pieces. The only reason I did not rate 5 stars is due to some chipping on a few of the edges. I was able to hide them. I wouldn't think twice about buying another one.", 
    "The style of the bookcase looks even better when you see it in person. You'll even see the great quality and all the room that it gives you, you can fit so much stuff. The assembly wasn't too bad, I took my time on it but the directions was pretty easy to follow so no frustration occured at all. I'm very happy with this bookcase.", 
    "Fast shipping, fast assembly, sturdy and it has all the room the I was looking for. just perfect perfect perfect!", 
    "We purchased two of these for our youth group room at church and they are wonderful. Cool and stylish and they just look great. Very pleased with the product overall.", 
    "I am very please with the quality and ease of putting together... I did not want a normal looking bookshelf, as I use if for books and Knick Knacks.... I am quite happy with it.", 
    "We ordered two units for our Daughter's home and mounted them horizontally on the wall for display cabinets over a bar area and kitchen nook server. These units were wrapped from the factory with outside bubble wrap to protect the internal cardboard box carton. On the first one we opened, the numbers weren't real clear, but laid everything out with proper connecting points prior to assembly with the dowels, cam locks, and screws... The second unit was visibly numbered and got it completed in less than 30 minutes...We were proud of our time on the second unit. All material was in excellent shape with no cracks or scratches. My husband and I both felt they were study and well engineered for \"us\" do it yourselfer's... They look incredible!!! Really glad we got the unit with the \"bolstered\" internal grid as same dimension as perimeter frame and looks very classy...Daughter is thrilled with the results.... We are going to use \"wood button\" over the cam lock holes in lieu of the vinyl circles that were supplied. Great units and great buy!!! Thank you Overstock.com!!!!!", 
    "Great price - fast shipping - easy to assemble and it LOOKS GREAT!", 
    "I was very pleasantly surprised by this cabinet. It was easily assembled and is really a good value. It has a nice wood look and feel, not that wallpaper feeling that alot of affordable furniture has.", 
    "We purchased this shelf for our daughter's bedroom. We wanted shelves for storage, but something more interesting than a traditional bookshelf. This unit is great!! It has lots of room, but remains open and fun. The quality is high, and the entire unit is very sturdy. I would highly recommend this product.", 
    "This bookcase looks great in my bedroom. I love the unique design of the shelves. It adds so much class to my whole room. I was thinking of buying another one to put in my living room but it was out of stock for like one week but now that its back on Im getting another one. Assembly might take around an hour but its well worth it. Beautiful looking bookshelf that is well worth the money!", 
    "I am really glad I purchased this bookcase. Great styles and add so much to my living room. I like that the fact that it can be transformed into any taste of styles you want. Assembly was quite easy but might be a little time consuming. It took me 40 mints but the end result was well worth it. All my guest loves it and I am proud to call it my own now.", 
    "Love this bookcase. Bought one a few months ago and ordered an additional one to go next to it. Great look for a great price. It shipped quickly and was pretty easy to put together. I have no complaints about the product or service.", 
    "I had already bought this unit for myself and was very pleased with it. Just the right size for any size room with plenty of shelf space. My daughter has just moved house and I bought her one, her room is smaller and it is still perfect. What a wonderful piece of furniture!", 
    "I found this item not too difficult to build, just very needs to repeat steps and follow directions closely. At these price anyone starting out on their own place and on a budgetallows them to have furniture that looks good.", 
    "I had to pay someone to assemble this as it is an engineering nightmare. Now that it's been put together it's fantastic.", 
    "I wanted something with different sizes. This fit the bill and I love it. Looks good, not that difficult to put together ...the only thing I added was legs. I didn't like that it sat flat on the ground...I purchased legs and it made it look taller and more like a bookcase.", 
    "The bookcase is beautiful.It's very sturdy and easy to put together. I'm very satisfied with it and would recommend it to anyone that is looking for a good deal and great product.", 
    "good design and easy construction - very happy with the purchase - just don't expect an expensive piece of furniture", 
    "This is a wonderful bookshelf! It came packaged nicely and was in great condition. It looks fantastic in my office and holds a lot of stuff, but in a funky way. I would highly recommend it.", 
    "Very nice, sturdy and roomy bookshelves. Not too bad to put together either.", 
    "Liked this shelf so much, I bought another one. Fits together well, visually interesting", 
    "The design instantly pops, the construction is strong, and I love the the different shapes and sizes compartment for storage. They really catch the eye!", 
    "It's still in parts as the assembly directions weren't included. Overstock is sending them, however. The pieces look very good. The assembly looks complicated w/ several different types of screws that I don't recognize. I'll have to borrow a power tool at the minimum. On the other hand, I'm certain it will be extremely sturdy in the end.", 
    "I got the shelf in white and it is fabulous! I am going to use it probably for decorative purposes only, but it makes the room look so elegant and interesting. Assembly was not too bad, although it took a while. Highly recomment it!", 
    "This bookcase is as beautiful in person as it is in the picture. It is open, modern, and fits our decor to a \"T\".", 
    "My brother and I put this together pretty quickly. It's sturdy and looks great. I have it laying on its side; looks great that way.", 
    "I used this book shelf as a divider in my studio and I love it! It lets in the light and breaks up my decorations in an artistic fashion. I get tons of compliments and could not imagine anything else more perfect for our space.", 
    "Love the \"open air\" feel and the unique cubbies opening. The unit was also very easy for me to move by myself to another room after assembly, although I do recommend having another person to help you. It definitely looks and feels very sturdy and I feel I will get many years of use from it.", 
    "OK for a built it yourself furniture. Looks pretty & solid when finished. Had it for a year and love it still!", 
    "I love this cabinet / bookcase. I choose to use it as a cabinet. It was pretty easy to put together and didn't take long at all. I love it so much that I will probably order a second one. It looks great!", 
    "Came very well packaged - no chance of damage. Was concerned about putting it together after reading other reviews but we did it in 90 minutes with no problems.", 
    "Super product. We loved it. Easy to put together, very sturdy. We actually bought to of them, to go on each side of tv", 
    "I absolutely love my new Verena Contoured Bookshelves (I ordered 2). They look great with my contemporary decor and is very stable. I use them to display books, family pictures, and knick knacks here and there. Definitely not disappointed one bit in this purchase!", 
    "Assembly is easy enough if you just read the directions. One of the sides was cracked but I planned on putting the bookshelf on it's side so the damanged part is facing the wall and not visible. I have a large wall that I needed a significantly large piece of furniture for and this fit perfectly.", 
    "this was actually really straightforward to put together, the pieces are numbered on the side but it is easy to miss and therefore could have been really difficult. it looks very nice and is sturdy. the only thing is that i wish they had included more of the wood stickers to cover up screw holes. none are visible at the moment, but if I ever moved it to a different location, i would like them to all be covered.", 
    "This looks great in my livingroom and was easy to assemble", 
    "Bookcase turned out beautiful. Super easy to put together. Honestly, it took me longer to get the box out of the bubble wrap & outer packaging than to actually build it. They really pack it well for shipping. So far no complaints, it looks great and the different size spaces hold my larger books- exactly what I was looking for. Would definitely recommend.", 
    "This bookshelf was easy to assemble and looks great in my living room. I love that it can be used vertically and horizontally. It's very versatile and a great buy for the price. I'm considering buying a second one for my bedroom!", 
    "This product arrived after a week and putting it together was a challenged. I had to use an electric drill to screw it together and it came one less screw than needed. It looks really nice. It would've been better if they have in their stock the white color but was also happy getting the black color. Highly recommend it but just be very patient putting it together.", 
    "We absolutely love this bookcase. My husband and I easily put it together and the instructions were easy to follow. It is very sturdy and well worth the price. It looks great in our living room. You will not go wrong with this purchase.", 
    "Difficult to put together but overall very pleased with my purchase. It is sturdy and looks fantastic! Definitely recommend if you don't mind the assembly!", 
    "Love this bookcase - it looks great in my bedroom! It was definitely difficult to put together and very time consuming, but well woth it!!", 
    "This is a pretty nice knick-knack shelf. The material is solid and it looks nice. For some reason, it looks taller and narrower in the pictures - be sure to measure the space where you want it. Fortunately, I did and it fit, but you can't go by appearance alone. The only complaint is the instructions. The components aren't labeled out of the box, but they're labeled in the instructions. Makes for a couple of times of trial and error; but it all worked out.", 
    "Product is just as pictured, perfect for displaying my favorite pictures, vases, etc. The color is a vivid white, not an off-white. Very sturdy. Just what I was looking for!", 
    "I have tried to buy furniture from overstock.com, but this bookcase was my first actual success. The box itself came wrapped in bubble wrap...not the inside, but the outside of the box! This was great and prevented any damage that may have occurred in shipping. The bookcase itself was easy to assemble. I was able to do it myself in about 30 minutes( I am a woman). It is extremely sturdy and looks nicer than the picture. I would not hesitate to recommend this to a friend; in fact I plan on buying a second one for my daughter’s apartment.", 
    "I am the least mechanically inclined of anyone I know, children included, and with a little help, I was able to put this book case together. It is very clean and sturdy looking. I am very proud of my decision to purchase this unique shaped display case and I would recommend it to anyone. The price is great too. Good luck finding anything better and for the same price range. I purchased two and am considering a third.", 
    "Just received the white bookshelf and we love it!! Easy to put together, sturdy and it looks great!", 
    "This set of shelves arrived quickly, was in good shape when they arrived, and where very easy to put together. The shelves look really nice. We are using them lying down (Horizontal) rather than standing up tall. Unlike a previous review the little tabs that cover the screw-it together holes are nearly invisible. I have to search to find them now that it is all put together. The shelves are sturdy and look MUCH nicer than pressed wood versions. They have a nice interesting, but not overwhelming grain to the finish. Great buy, very pleased. Good price for the value.", 
    "We are very pleased with the bookcases (got 2). They are on each side of the fireplace and look great!The description on the website was very accurate. Shipment was on time and the boxes were ultra protected with thick bubble wrap. Not a scratch inside either. The instructions are simple to follow. It only took a couple hours to assemble both.The little container of wood glue provided was not sufficient, so make sure to have some. Not too keen on the plastic cover for the hardware, even though they are made to look like wood - so make sure you put them with the grain and not against.... Will recommend this item with no problem.", 
    "Great product all around . Bought 2 and used for a room divider and attached together worked out great!!!", 
    "Love the finished product, but it was semi-confusing and a bit time consuming to put together!", 
    "Exactly what I want for a unique bookshelf. I love the contoured shape. Excellent wood color and thank GOD the color exactly like described. A lot of the time, furniture said it's white but then when you see the actual product it's either beige or yellowish white. Not this one, white it is and it fits so nicely and perfectly to my contemporary living room decoration. Sleek and sturdy. Could not be any more happy with the quality. Will recommend for sure.", 
    "Shipping was fast, product is good. I was a little disappointed by how cheap it looks in person (the thin wood), but what did I expect for this great price? Overall I'm happy with my purchase.", 
    "I placed the bookshelf horizantal instead of vertical and it's perfect! It was easy, but time consuming to assemble. Shelving is nice and sturdy.", 
    "I have had a few bookcases in the past. This one hands down beats any other one I have had. Quality is exceptional for the price and assembly wasn't too difficult. The shelves are generous with the spacing. This piece of furniture was a nice addition to our family room and allowed us plenty of space to display our many photos.", 
    "I ordered and received this beautiful bookshelf in a timely manner and I was able to assemble it with ease. The only thing I would add would be a couple of brackets to hold it securely to the wall. We have a carpet and it wasn't sturdy. With kids this would be a hazard so we made sure it was bolted to the wall.", 
    "I am very pleased with this unique display case. It was not to difficult to put together and appears to be good quality.", 
    "Products look very nice set up. Packaging was good. No problem with delivery.", 
    "I bought this bookcase for my home office; I wanted a modern look and I got it! I was skeptical about getting something made of mdf, but it looks really nice and like it costs more than it did. It's pretty sturdy for not being solid wood. The woodgrain texture is a nice touch, and the directions weren't hard to follow. There is a lot of assembly but it only took me 1 hour with an electric screwdriver. For the price, the assembly was worth it. I would buy this bookcase again.", 
    "The Display Cabinet turned out to be a great product, it is strong and sturdy. It took me more than an hour to assemble it but I did it without assistance. It turned out so classy looking and I use it to display all of my wine glasses, water gobblets and a large glass pitcher. I've received so many compliments from friends and family.", 
    "This display cabinet is great. It dressed up a plain wall between two windows. Whatever I put there did nothing to accent the wall. My son put this together for me in a short time. I will be ordering another one to put alongside the one I have. It will really make this area eyecatching. The item is very sturdy and looks like it would cost more.", 
    "I looked for a stylish and affordable shelf like this for over a year before coming across this one. It is exactly what I was hoping for. My husband had no problems assembling the unit and it looks fabulous in our living room. I highly recommend this for anyone wanting a trendy bookshelf at a reasonable price.", 
    "I'm SO pleased with this purchase... very solid/nice looking bookcase. I get compliments all the time. It did take me quite some time to assemble it by myself but just because it takes forever to screw in all of the pieces. The shelves/sides were all very clearly marked and the instructions are easy to follow. It IS a heavy bookcase! I'm dreading having to move it down three flights of stairs next month. Definitely buy this if you're considering it. :)", 
    "Received promptly. Assembly instructions were good and the units went together fairly quickly. Good value for the money.", 
    "Purchased two of these, pushed them together as one giant wall unit. They're one of the most unique modern bookcases I've seen. Perfect to display knickknacks and books together. I was a bit hesitant about ordering because I read some of the reviews about it being difficult to put together but if you follow the directions (written and photos) I found it quite simple as everything is numbered. Highly recommend this item!", 
    "awesome, sturdy, looks unique and classy, good price, fits a lot of books!", 
    "I purchased two of these display units to create one large wall unit. It looks great and I've received many compliments. They're not wood, but they look good when assembled. It was a hassle to assemble them, but my daughter and I worked together and got it done in a couple of hours. We worked carefully because we didn't want to damage the cheaper material they're made of. Each screw cover must be glued in place and I think they should be made to fight tightly without glue. I think they're a good enough value for the money and I would probably be willing to go through the assembly process again because they're just what I was looking for. I'm very pleased with the way they turned out and, once they were assembled, I was glad I bought them.", 
    "Got this to hold DVD's and also various knick knack type things. Definitely stands out more than just regular shelves. Looks pretty quality. Putting together took quite a while but was worth it in the end.", 
    "Great for showcasing all your decor. I just love the styles of the diferrent shelves. I have been looking for something like the for a long time and so happy to have found it. Color is really nice and very easily to match with any other furniture. Elegance and value. Great purchase.", 
    "I really like this unqiue wooden bookcase. I love it! It matches all of my decor. The different intersecting angles of the bookcase gives it that unique and stylish appeal. Adds a lot of style to any room. I got two to put together. It looks great. My boyfriend loves it saying that the style is \"unisex\". Good for both male and female which I definitely agree.", 
    "I was looking for a room divider and after looking at a lot of folding screens I found this open shelf. It is perfect for what I needed; it divides the room and provides display space. It was very easy to assemble only problem is that some of the edges were chipped. Not worth the hassle of sending it back but if it matters to you be warned. The plastic covers that hide the hardware are ugly, I'd prefer not to see them.", 
    "i ordered 2 of these bookcases. They take a very long time to assemble, but once finished I was very happy overall. Bookcases are sturdy, pretty and unique.", 
    "DQDHJQJEWDPODKJPOKJQEDPOKJQEWDPOKQEDOKJQED", 
    "I had ordered this in error and they were great taking it back at there own expense. I was very impressed with their costumer service.", 
    "This product arrived at my door step within 5 days of ordering. All pieces were present and intact. Instructions were clear enough and I was able to put it together in about an hour. I would suggest using your own Allen wrench as the one provided is of poor quality. I wish I could recommend the product, however, after about a half an hour of putting it together my eyes started itching like I was having an allergic reaction. A half hour later I took a look in the mirror and saw that I was having moderate facial swelling. My physician informed me that he's seen people have reactions to the glue used to adhere the \"wood\" panelling to the particle board. Since Overstock provided so little in the way of product specifications (\"compressed wood\") I have no idea what this thing is actually made of. If you choose to get the product and you have allergies I would suggest using a basic mask while assembling.", 
    "I love this bookcase. Even though this bookcase was packed really well it still arrived with a few very minor chips. I have never assembled anything before and I put this together in about an hour. It is very sturdy and looks like an expensive piece of furniture.", 
    "Shelves did take some TIME to assemble but overall simple just tedious and time consuming. I appreciated wood glued was included. I was somewhat disappointed in the finish. I ordered black and it appears more like a dark brown or mocha. I'm also bothered that the silver cam locks appear to me to stick-out like a sore thumb. I'm considering painting over either locks or possible paint the whole unit the black I expected. But for the price (and I used a discount coupon) I guess a good deal. (Kinda wished I would have spent the few extra $$$ for other / silimiar shelving units on Overstock.) Would recommend with above concerns being acceptable to interested parties.", 
    "Good product - I was considering building one from scratch - but to get the same look would have cost 2X or more... Assembly was pretty easy - just have to be in the zone of looking at the pictures to get the right piece at the right view... Definitely an excellent value - and looks really nice...", 
    "Box arrived well-wrapped to avoid damage in shipment.. Assembly was fairly simple. Bookcase is quite sturdy. Looks like I would have spent at least double! Great value.", 
    "The pre-drilled holes to don't always give flush corners, edges and seams. We had to caulk the seams to hide the gaps. I need to sand down the edges so the corners match and repaint. But the design is nice and it sturdy.", 
    "Yes, it's made of particle board. Yes, it's made in China. No, it doesn't sway and flex side to side or bend under a load once it's assembled. Follow the directions and look for the numbers marked on the side of the pieces. You can assemble it in about half an hour. The weird shape of the shelves reinforces the outer edges. Each piece is surprisingly thick. The shelves are deep enough to fit whatever you need to store, and the entire thing is of a pretty good size. The finish looks like it could be easily damaged, but for the price, it's a good sturdy product and looks beautiful and unique. Key words here: sturdy, unique, spacious. I definitely would buy another.", 
    "The bookshelf is a nice piece of 'cheap' furniture. It isn't comparable to higher end furniture, especially as you have to put it together and seems aren't perfect and the nail covers are stickers (why this can't be upgraded to plastic nubs, I don't know- I already had a couple fall off), but for the price its a great piece. I use it on its side, but it holds slightly less books than my old traditional shelved bookshelf of the same size.", 
    "Love the design and the size. Like the dark brown/black color. Things that would make it better: 1. to cover the metal hardware, they include some stick on circles that are woodgrain'ish. Problem is they circles are light brown and very noticable. 2. One piece was slighted warped and it was the last one we installed (top shorter piece). By the time we realized it was not going to be a good fit, we had already glued and screwed every other piece and it was too late to back up and look for options. It's now an ok piece instead of the fabulous piece we expected.", 
    "I can't say the quality is bad... Because I really don't know. I got as far as starting to assemble the pieces I bought- and realized the directions are not only confusing, but wrong. I double and triple checked every detail before starting, only to find that the diagrams contradict each other from Step 1 to Step 2! Even in the same diagram, as I began to assemble this- it became evident that where they tell you to put a dowel is actually where a screw is supposed to go. And of course, I can't get the dowel out!! SO FRUSTRATED! And worse, I don't have packaging and no idea if or how to return these 2 God-forsaken shelves! By the way- I never ever write reviews- but I would hate to see anyone waste any money on these products, as I have.", 
    "This is a fairly stable bookcase that was not difficult to put together but it did take one person about 4 hours to complete it as I had to un-do several sections along the way as I realized I had installed them wrong. When done, it looks fine.", 
    "", 
    "", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Verena-Contoured-Leveled-Display-Cabinet-Bookcase/4105090/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4105090/Furniture-of-America-Verena-Contoured-Leveled-Display-Cabinet-Bookcase-2235feef-07a1-4011-b605-db4a2051efc3_600.jpg"
  ], 
  "description": "Organize and display your things in the room of your choice with\nthis modern wood cabinet by Furniture of America. The contoured\nlevels of the black display cabinet shelves are not only unique and\nstylish, but also make it convenient to store items of different\nshapes and sizes. This sturdy and versatile display cabinet can be\nplaced vertically or horizontally to meet the needs of your\nparticular space. Verena contoured leveled display cabinet/bookcaseOrganize your essentials with this uniquely stylish display\n  cabinet/bookcaseFurniture features a unique different leveled contour\n  shelvesCan be positioned upright or verticalBuilt with a hard sturdy internal frameFinish options: Black, light oak, walnut, whiteMaterials: MDF, veneerDimensions: 71 inches high x 35 inches wide x 12 inches\n  deepStyleModernMaterialWoodFinishBlack Finish, Oak Finish, Walnut Finish, White Finish, Wood FinishShelf TypeDisplay, Media CabinetsAssemblyAssembly RequiredColorBlack, Brown, WhiteFurniture Frame MaterialWoodNumber of Shelf7"
}