{
  "name": "Furniture_of_America_Danbury_Modern_2-drawer_TV_Console", 
  "price": "EUR 228.13", 
  "reviews": [
    "We had a lot of problems with this order. After receiving it and putting half of it together we noticed a small gouge on one of the pieces. It faced the front so we needed to replace it. Overstock offered to ship an entirely new unit but I asked them to send just the damaged piece. Since it was for a gift they shipped it overnight, which was very nice. But unfortunately they sent the wrong piece. It seems the part # on the instructions do not match the parts # on the actual pieces. So this time they sent another whole unit. The box came with two holes in it. As we were finishing putting it together we found another damage on the top piece. We switched it with the part from the 2nd unit so we do have a finished console. But now we have a huge box sitting in our house and Overstock can't pick it up until after the holidays. The quality is what you would expect for a non-wood unit. It looks nice but it won't likely last long. Make sure you check all the pieces for damage before you start assembling it!", 
    "While it may be nicely designed, the materials are light weight and cheap looking.", 
    "I have a ridiculously large TV - trying to find a console large enough that wouldn't completely overwhelm the space was a challenge and this one fit the bill perfectly. It's beautiful and looks great in my living room.", 
    "Good value. Mostly compressed woods. Hopefully won't sag. Not too difficult to assemble.", 
    "My sister and I put this together in about 3 hrs and we love it.", 
    "sturdy and good quality. worth the price", 
    "This console arrived in excellent condition. Was a little difficult to assemble, but was well worth the effort. Nice quality and perfect size.", 
    "Great look, shelves are perfect for audio components and my teenager assembled it!Easy Button!!Thanks Overstock", 
    "I received it in just 2 days after that I ordered! so fast! it was the first item amazed me about it.modern and perfect design and strong quality furniture, I really like it, I'll recommend it to anyone is looking for modern and strong furniture! It was exactly like photo and description.", 
    "I have received nothing but compliments! Perfect casual furniture for the Family room! Looks a lot more expensive that it is! I was pleasantly surprised!", 
    "Love it... Goes while in my living room", 
    "We received the package quickly and found the instructions easy to follow. My husband had it assembled in about 90 minutes. The console is surprisingly light weight for it's size, and we are impressed with how good quality it looks. The only downside: we have a very large flat screen TV that is almost as wide as the cabinet. The weight pushes down in the center of the cabinet, making the top drawer stick slightly when opening and closing. The bottom drawer is fine. This detail is not important enough for me to rate the value and quality less than 5 stars - I just thought it was worth noting.", 
    "Really Beautiful Stand looks more expensive than the price and came in great condition! simple assembly! Have got so many compliments on this stand from others!", 
    "great console looks great in my livingroom", 
    "excellent color (espresso) and looks quite high end.", 
    "Overall, the piece is perfect. It looks good, my cable box/DVD player fit nicely on the shelves and my TV looks great on top!Assembly was easy but it took a little while.", 
    "i get so many compliments. this is a great buy.", 
    "It's sturdy and a beautiful piece of furniture. Looks great in any color scheme.", 
    "Makes my living room more complete. Just not as great as I'd expect it to be.", 
    "Looks great and is nice and sturdy. Would suggest to anyone looking for a mid-level tv shelf. Took me about 45 mins to put together.", 
    "Very nice tv stand for the price easy to put together", 
    "It takes a bit of time to set up at first but it is a great looking TV stand and really stands out in the room. I have received tons of compliments on the stand and people can't believe the price of it when I tell them,,,great purchase!", 
    "I have a 55\" tv sitting on this with surround sound, PS4 and a Denon receiver. The drawers are nice to store remotes, controllers, etc and are very sturdy. I am very happy with this purchase.", 
    "Very timely delivery. It makes a nice addition to my living room. I have received many compliments. Definitely worth the price. I love it!!", 
    "I am a female and put this together by myself with the help of a tool kit. The instructions were easy to follow, and once complete it look exactly like the picture. The only thing I will mention is that the spaces that have the shelves don't have a back panel to them. So you will see the wall through the back of those 4 spaces.", 
    "This was easy to assemble and it looks great! My 65 inch tv is resting easy and in style on this console. Would highly recommend.", 
    "So I've had this a couple of months one of the drawers had lose screws and completely fell apart ...", 
    "the design is unique, it' perfect for my living room. and we was able to put the music system.", 
    "It's inexpensive. Fake looking veneer. The biggest issue is we have a 60 inch new flat screen on there. Not very heavy compared to old TV's. My husband has warned me not to touch it or it will break. Not sturdy enough for a tv that size. And we only have a DVD player and small Direct TV box on the shelves.", 
    "This is a wonderful unit, had some trouble putting it together because the instructions aren't the best but it perfect addition to our home.", 
    "Took me a couple of hours to put this together. At first it's a little confusing..just make sure you read the instructions thoroughly before you start building & make sure you fully understand them. After I got the hang of it, it was a breeze to build. I put it together on my own.Looks beautiful in my living room..I love it.", 
    "exceptional for the price", 
    "Looks much more expensive than it is. Took two guys about an hour to assemble. Not \"fine furniture\", but it does the job.", 
    "It's beautiful and we are happy we purchased it!", 
    "Low and long, just what we needed. it was an easy assembly and quality parts. I would buy again.", 
    "Well built and designed and was easy to assemble. The console is substantial. Would buy again if needed.", 
    "Great for the price.........lots of parts to assemble but turned out perfect for our large living room wall.", 
    "outstanding and easy to put together.", 
    "This console was very well packaged! The instructions are simple to follow. I am very pleased with this purchase. No regrets.", 
    "Great piece of furniture. Purchased it to hold my 55\" TV and it looks amazing. It is a very sturdy piece of furniture. I have purchase a coffee table from this same company to match and it also was a great choice.", 
    "Beautiful tv stand. I love it. It makes living room looks nice.", 
    "Very easy instructions, fits perfect and looks way more expensive then what I paid for it", 
    "Nice looking unit that met my expectations and was fairly easy to assemble with a power screwdriver", 
    "It is a classy looking piece to add to any room. Well built.", 
    "I was worried bout the shipping but it was packed box within a box with alot of padding. It was beyond our expectations of it and looks amazing. I would recommend this for everyone.", 
    "This looks great for the price but it was a pain to assemble. I now realize I hate plywood.", 
    "love it. Fits my 52\" tv perfect", 
    "this looks really nice online. the only BEAR! is putting it together. looks great tho. remember putting it together is a BEAR!!!!", 
    "I haven't put it together yet, I'm waiting on the move on the 26th!", 
    "Looks great too. assembling was not difficult either.", 
    "Solud wood, modern but fits transitional decor nicely. Moderate to easy to assemble. Great vallue/look.", 
    "Beautiful and Sleek looking", 
    "I am always extremely hesitant to purchase anything like this online. I loved the look so much, I took the chance. My husband had absolutely no problem with assembly. It took around a couple hours by himself. It is beautiful. Exactly how it looks in the picture. It looks like it should cost far more than it did.", 
    "I love this TV stand, true to its photo. Great color and easy to assemble.", 
    "This entertainment stand was exactly as I expected as far as color & quality. I love it!", 
    "nice shape but cheap material", 
    "The screw and lock system given in the kit seems a lot better then just the wood screw into the press wood piece. It should be noted that the pieces are pre-drilled which made putting the parts a lot easier . I didn't noticed it when I had problems and was trying to drill a hole into the side .", 
    "I got this item for $$$ or something...its worth for this price..I am happy with quality.", 
    "Makes our entertainment area a complete success", 
    "Everything I expected. Packed very well. It does take two to assemble and a bit of time, but well worth the efforts. Strong and sturdy and fits perfectly in tune space I have. Measurements were very accurate.", 
    "I ordered it one morning, got it the next....very fast shipping. It looks nice under our 60 inch tv. We're very pleased with it but it was a little hard to put together. Would order it over again.", 
    "perfect size, easy to put together, and it looks a lot more expansive than it is.", 
    "A little complicated to assemble since there is no instructions just pictures. Otherwise love the product.", 
    "this items looks very nice but the quality is really not good, it needs to be treated very carefully otherwise it won't last long, Im almost afraid to move it in fear it will fall apart.", 
    "I originally had a couple of parts that were missing but the company shipped them out and they arrived quickly. The stand is built well and looks great in my family room.", 
    "First of all, I want to thank Overstock. To begin with, we actually ordered a different TV stand. But at the last minute, decided on this one. I called Overstock to see if I could cancel the order, but instead of getting the usual, \"Sorry it's too late,\" and having to wait until the order arrived, call back, getting a return label, or getting charged for restocking the item, I actually had a concerned, polite, and understanding human being, who helped me. Even after UPS notified me that I had something coming, Overstock stopped it, and had it returned. That's when I ordered this item and I received it a day later. Perfect Overstock, Thanks again. Now for the stand. I could not believe how well packed it was. I was expecting a box about 6 ft long to come, and this box was a lot longer than that. Once I opened it, I could see why. Everything was individually packed. I think there was more packing then parts. So it was in perfect condition when I received it. I don't know exactly how long it took to assemble, but it was several hours and I did it myself. Not hard if you pay attention to the instructions. The hardware (screws, nails, etc.), were individually packed, which helped a lot, instead of having everything thrown together like most products you buy. I am really impressed with the quality of the product, and equally impressed with Furniture of America, for taking the time and effort, to package their product. It was so hassle free. If I should need anything again, they will be the first to know.", 
    "I opted for the 72\" console and its a good thing I did. It is actually smaller than I imagined it to be. Assembly was very easy - I suggest two people. Took about 2 hours - yes, us girls put it together. Not brain surgery - just follow the directions.", 
    "This piece looks good on the website and I was pleased when I received it. It was pretty easy to assemble and it fit in the space perfectly. However, I've only had this piece for a few months and its already sagging in the middle. So I'm a little disappointed especially since I had hope to use this piece in my entertaining area. I will probably invest in a better made piece.", 
    "It is really nice but a lot of pieces", 
    "You get what you pay for most of the time but, this seems to be high quality for the price. Assembly is a little time consuming but, not that difficult. I am enjoying it.", 
    "I recently purchased a larger tv for my family room and needed a new stand. I was a little concerned about the reviews but thought I'd give it a try. It took about 2 hours to assemble by myself but I did and moved it into place. It looks amazing and I get lots of compliments on it. I would definitely repurchase this again if needed", 
    "Great, sturdy, stand for a great price. Wish it was a few inches taller and had a back on it so it didn't have to see all cords behind the stand. Other than that, very happy with the piece.", 
    "Perfect addition to our living room! Shipped promptly and easy to put together!", 
    "Solid construction, goes with our decor beautifully.", 
    "I chose this piece for the lines and the storage capabilities. My dresser has the same sleek, curved lines and this console will compliment it very well.", 
    "This took some time to put together but it looks very nice in our living room and we have gotten a lot of compliments on it. I would definitely recommend it!", 
    "This piece looks wonderful in my living room! My husband and I wanted something modern and yet different. It had to be high enough to cover the cables from our television and wide enough so it didn't look awkward against the wall under our 65 inch television. This was perfect! We get tons of compliments.This piece was fairly easy to put together. My husband and brother took about 1.5-2 hrs to put it together but that's due to the TV breaks they took in between.2 CONS: 1. The glue they gave was pretty pointless.2. Picks up smudges/finger prints soooo easily.As you can see the cons are not that serious. I would definitely recommend this product!", 
    "Seems a bit better than the sofa/entry table bought to match and went together better. Again beginner furniture, but not bad!", 
    "I love this! It is so beautiful!", 
    "I am very happy with this TV stand. A great value and looks great.", 
    "Happy with it, fits 70\" tv well, lots of storsge", 
    "Very sturdy, but be careful of the handles which are very sharp. My son and I have both been cut. Overall it's beautiful and gets the job done.", 
    "Bought in a pair for in front of an executive desk in our office. Am amazed at the quality for the price!", 
    "Pretty easy to put together. Looks beautiful. Great quality for the price!", 
    "The quality n color is very good. Worth buying", 
    "Great cabinet and fits our needs perfectly and great price.", 
    "Love this stand for our 75\" TV. It was perfect for a modern, sleek look. LOVE IT! Have received many compliments already!", 
    "I am not really talented in assembly of furniture but I took my time and followed the directions and I amazed myself how everything fit together so well. The look is good and I would recommend this furniture.", 
    "love this , a little smaller then i thought but looks great", 
    "Love this product from the minute I first seen it. Ordered it and when it came home, hubby put it together in under 1hr. Everyone who comes for a visit loves it. Thank you Overstock!!", 
    "The TV stand looks just like the picture on the site. It took two of us a little over an hour to put together, and we had no problem. Everything fit easily together and the drawers slide nicely. Highly recommend.", 
    "Fiberboard back which is not even painted makes the whole item look cheap. Great buy if you're putting against a wall.", 
    "Fairly easy to put together. Took me about 45 mins and I am not very handy. Very sturdy and holds my 55 inch TV nicely. Highly recommend this product.", 
    "Its not as easy to assemble as I thought it would be. Few pictures in the assembly instructions were confusing and did not tell which side was right.", 
    "We purchased the larger unit and it looks amazing. I love the curves on the side and the drawers are stealthy. It was fairly easy to set up, however, I would recommend having a helping hand as I had to balance it on the side to create the drawer space.", 
    "Looks great! Would buy again.", 
    "The entertainment center looked nice and sturdy from the picture. When I got it home and put it together, it is not as sturdy as I thought it would be. I like the drawers because it holds all of the devices for the entertainment components.", 
    "The quality of product is better than good but does not quite rate an excellence. The assembly was simple for me. Once I get some use out of product we'll know the overall quality.", 
    "Looks Great, Easy to put together!", 
    "Looks good and is sturdy. Easy to put together. No wood at all, but fastening system pretty good and does the job as a TV stand. Love the modern lines.", 
    "The majority of my home has been furnished by O. Some of my items are very nice (i.e. bed, mattress, lamps) but this piece is total garbage! I wasted not only my money, but my O rewards on it and an entire Saturday afternoon!First, it is 100% particle board. The end fell while trying to screw it into the larger board, ripping the hole for a wooden bit even larger. Now that side is very unstable.The directions, to the most complicated item I've ever received are all pictures, no words. We (you must have two people working on this) had so many pieces of hardware left over, we have no idea what they are or where they go. I'd say buy this at your own risk. It is definitely throw away furniture.", 
    "I love this piece.Easy to put together one of my favorite items,would highly recommend it.", 
    "Not an heirloom piece, but very utilitarian, Went together easily. Only needed one person. Looks good at a distance.", 
    "I have assembled similar furniture before, so this one took me only about 2 hours start to finish. I had no help in assembling it and I am 80 years old! It is sturdy, looks great (just as shown in the listing) and blends in well with my other furniture.", 
    "So disappointed. I will never order furniture from this site again. Order arrived incomplete, with some parts missing (drawer bottoms, among other parts). Now the fairly large and half assempled piece of furniture is sitting in my living room, waiting for weeks for the missing parts to finally arrive (supposedly they are in the mail, but it has literally been weeks, so happy holidays to us with the bottomless drawers piled in a corner). Live an learn where to shop.If I ever get the thing assembled, I'll update my review. Until then.", 
    "This was a beautiful item with a great price. We had just bought a 65\", 4K TV and needed a stand that would accommodate that. This size was and unit was perfect for it. One would need a bigger stand if the TV size is any bigger than 65\". One thing to keep in mind, this item does come in many pieces, so one has to be handy enough to put it together.", 
    "Very sturdy just what I wanted ! Not cheap looking at all", 
    "It looks great and easy to assemble", 
    "I'm very satisfied with my overall purchase of this tv stand. It has a great design, love the color. Pretty straight forward directions. Wife is happy and so am I.", 
    "Love this TV stand. Fits all our dvd's wother room to spare. Perfect for our apartment and what we were looking for.", 
    "In general, it looks good. It took me about two hours to put it together. The instruction is not detail enough. And finally, I found the one of the drawers doesn't fit well.", 
    "Just like the photo. Very happy with this piece of furniture.", 
    "Smaller than i thought but very nice", 
    "It took us a good 2-3 hours to set up, but now that it's done, we appreciate the functionality and good looks of this piece of furniture.", 
    "This was delivered on time and was easy to put together...I was able to put together myself. Looks great and exactly what I was looking for.", 
    "I was looking for a TV stand for my loft area that wasn't too expensive....so I purchased this unit thinking it looked really nice online. Well, as the saying goes....you get what you pay for. Cheap and looks cheap. Pretty sturdy though and serves it's purpose. I will keep it but I am a little disappointed with the quality.", 
    "It came very quick. I like the furniture itself.", 
    "Very nice. nicely packed to avoid damage.", 
    "Easy to put together. Very rich looking - you won't be disappointed.", 
    "Did not send me this one, but it is very nice and fit the space. It works.", 
    "It was a very lightweight box, so it was easy to get up to my apartment and it was easy to put together. It took em about an hour. All of the pieces were present and there was no damage to any of the pieces.", 
    "Looks great! Great price!!", 
    "Took my husband about 2 hours to build, we didn't mind he loves to build things. It turned out much more wonderful looking then I expected. Very sturdy! Great piece of furniture", 
    "Wobbly, cheap, looking for a replacement as I'm scared it will break. Looks nice but is pure crap.", 
    "Nice and stylish tv stand, I definitely would recommend. Just the right demensions for our 55 inch tv.", 
    "I think this is a nice TV table and have gotten many compliments on it. Very sturdy and great instructions to put together. I did have a few issues with some of the hardware so some extras would have been nice.", 
    "very smooth and slick design. Took longer to pull parts out of box than it did to actually build it.", 
    "I love the entertainment center, it fit perfectly In the family room with our new smart tv. It was easy to assemble. The color a little darker then what I seen on the website. It still went well with my colors In the family room. My friends love the unit and I recommended overstock as a good site to shop on.", 
    "My 10 year old help me to put it together, it was easy and sturdy, it supports a 65 inTV", 
    "It did take my husband and me together to assemble in about 1-1/2 hours as we took it slowly and did it right the first time. It looks great with our new TV, and actually makes our living room look larger now that the old entertainment center and old 150 lb. TV are gone. It came packed in an incredible amount of packaging, foam, etc. No damage at all.", 
    "My TV now looks like its brand new with this new open stand! I LOVE it! Lots of compliments!", 
    "I love that it goes well in my livingroom.", 
    "Very nice piece of furniture especially for the price. Arrived safe and sound, no problems. I can definitely recommend this item.", 
    "Love it, it was a process however not difficult to put together. I put this together by myself and it wasn't as bad as I feared. It was awkward because of the long pieces...but if you follow the directions with no short cuts...it was great", 
    "Set up time took less then 2 hours with two people. Looks great. Seems sturdy. No scratches, or dings. Very happy with this console.", 
    "This console is really stunning. I'm amazed at how beautiful it is, knowing how reasonable the price. The drawers are perfect and function smoothly. Don't wait...it's a good buy.", 
    "Great piece of furniture for price", 
    "Vey attractive, appears to be sturdy", 
    "JUs t received my TV Console and had it assembeled.. Georgeous, sleek, looks great .. very sturdy.. and elegant", 
    "really happy with this purchase, great price and good quality", 
    "Great piece of furniture. I would definitely recommend this product to anyone. Not difficult to assemble either.", 
    "Stand is really, really beautiful and modern but not really durable. I wouldn't recommend if you have younger children that would play on this. We have our tv mounted on the wall and the stand decorated below. We don't touch or move the stand so it should last awhile. Opening on the 60\" was big enough for our receiver while drawers are large enough to hide all the junk.", 
    "We ordered the 60\" unit in Espresso, as shown. 4 PROS: 1. The assembly was better than expected--less than 1.5 hours for 2 people. Look carefully at the unfinished edges of the pieces; some of them have a red stamp indicating the part number that corresponds to the instructions. 2. The piece is pretty sturdy and it certainly looks just as advertised. 3. The faux wood grain finish is not overwhelming. No, it doesn't look just like real wood but it doesn't look half bad, either, and the lines and design are reasonably elegant and pleasing for this price point. 4. Pretty solid and spacious for the price.5 CONS: 1. The front-facing edge of the top piece came with an 8\" mark/discoloration on the left side. We didn't notice it until we'd finished assembling and moved it into position in a better lit area. 2. The wood-print stickers supplied to cover up some visible bolt holes are pretty cheapo and after 10 days, one of ours is already peeling off. 3. The back of the unit is open, as you can see in the picture, but care has been taken in those photos to minimize the appearance of back-of-equipment wires. In reality, the wires/plugs behind the open shelves look pretty darned bad. We are going to try to have some inexpensive backing cut to size at a home supply store and just close it up ourselves. 4. The adjustable shelves ought to be about 1/4\" wider so that they would sit flush against both their outer and inner side walls. It's a very odd little flaw. You set the shelf onto the little supports as on most adjustable shelving, and you find it's sort of loose. Because of the curved design of the outer sides of the unit, you can conceal the looseness by setting the shelves flush against the inner wall and ignoring the gap at the outer wall. But inevitably, the unit is touched and used and the shelf shifts, leaving a small, visible gap that just looks kind of cheap when you're sitting on the sofa looking across at it. For what it's worth, if the back of the unit were not open, as mentioned above, that gap would be indiscernible. It's noticeable because one sees the light between the shelf and the side, due to the open back design. 5. This is the worst con in our opinion. The guide \"rails\" for the drawers came pre-installed but the upper right rail on the fixed pice that the drawer ought to slide into--it was installed about 1/3\" too high so it was not possible to close the upper drawer either horizontally level or all the way in (it would just bang into the top of the unit). Of course, inserting the drawers into the unit is basically the last step in the process, so you'd have to take the entire thing apart to fix this properly, and that assumes you hadn't used the wood glue as instructed to secure the wooden dowels in a previous step. Ouch! In our case, we removed the entire rail--tricky at that point getting back into that small space with grown-up hands--and we moved the rail down a smidge, then re-drilled using other random screw holes that were on the rail (because with the small but necessary adjustment, using the same rail holes would have caused us just to uselessly enlarge the existing, bad, pre-drilled holes). Unfortunately, our ad hoc adjustment worked to a point since we couldn't actually see in there to measure and mark before drilling--we were off by about 1/32\" so we can now close both drawers and they look fine when closed, but we must slightly lift and guide every single time we close them or they bump into each other just a little--but enough to prevent proper closure. We may give it another go but this flaw is pretty annoying and as we're expecting a baby any day, and really...re-assembling furniture is the last thing I need to be doing right now.", 
    "Absolutely love this TV console. High quality and heavy. Not cheaply made. Only took a couple of hours to put together. Would have rated it excellent if not for the unattractive handle pulls, easy fix though, simply bought shiny new replacements. Happy I decided to make this purchase.", 
    "Exactly what I was looking for. The color matches my decor perfectly. The instructions to put it up were easy to follow too.", 
    "Looks great. Takes a long time to put together ( I hired a handyman and it took 3 hours)", 
    "Pain in the rear to put together but non the less a beautiful piece of furniture for the price, very happy with it", 
    "Easy to put together and very nice looking in person.", 
    "I gave it 1 star only because it looks great on the picture. This TV stand has the worst quality ever!. Any item from Ikea is 1000 times better quality. The assembly instruction is horrible and complicated. Better save your money and DON'T BUY THIS PEACE OF SH*T!!! I never write reviews but today is the day! I received this TV stand couple hours ago, wasted 2 hours to assemble it and then...threw it away to recycling room! It was so unstable and low quality I couldn't afford to put my TV on it cause it felt like it would not hold it! believe it on not!", 
    "This product was great. It was a hassle setting it up but I just sat on the couch and watched so for me it was fine. It's very sturdy and chic looking. Love the product.", 
    "While made of medium density fiberboard, it is made and packaged very well, and it looks beautiful in our living room. Will look for some coordinating items from this manufacturer.", 
    "The instructions were difficult to follow and somewhat incomplete. Some of the pieces were shoddy and broke during installation. The final product looks good, but it was difficult to get to the final product.", 
    "This is a very pretty piece of furniture, looks really good set up but have you heard the term \"Pretty Penny\"? Thats it! If you are single and are gentle with your stuff this stand will be perfect for you but if your heavy handed or you have small children who like to bang toys on stuff, don't purchase this! The shelves aren't the most sturdy, they are held in with pins and the outer finish chips away easily! It was fairly easy to put together the only thing I didn't like is they put stamped letters on the end of each piece to identify them and its very hard to read! I gave this 4 stars because its very pretty, easy to put together, sturdy enough for a large tv, has 2 nice drawers and 4 shelves! It just lost a star for the easily chipping finish, luckily mine chipped away where no one can see!", 
    "It was easy to put together", 
    "It looks beautiful. For the money it far surpassed my expectations. It was easy to put together. The only negative is when moved it is a bit wobbly however it won't be moved again unless I paint. Great buy I am really happy.", 
    "Purchased for my daughter. It arrived in good condition on the day it was expected. She put it together that evening and says she loves it.", 
    "Shipping was quick. I could not put the console together by myself and had to get help. The console is made of presswood--not a quality piece. However, it looks nice from a distance and is a good size for my 60\" TV.", 
    "This tv console matches my living room furniture perfectly and is a high quality piece of furniture!", 
    "great item for what i paid for , just the drawers cant take heavy stuff .", 
    "Big, very nice. Great purchase for the price.", 
    "Very pleased with this piece of furniture. 55\" TV looks great on it.", 
    "Just what I was expecting. Perfect.", 
    "I assembled the piece myself and it wasn't difficult. The directions have pictures of the pieces you are supposed to use without having the actual pieces labeled. Everything went together well and I ended up with a sturdy, attractive console. It is REALLY low so make sure you pay attention to the height. We have low profile furniture and it is really low.", 
    "It took two people two hours to assemble but the end result was worth it. I got was I expected for the price.", 
    "My husband assembled this unit last night and it looks great. When we initially received it the assembly instructions were not contained within the box but working with customer service solved that immediately", 
    "Arrived on time, all parts and pieces present and accounted for. Easy to assemble. Easy on the eye received plenty of compliments already.", 
    "Great product, I love the color and it looks as it is in picture.", 
    "great ent. center, very modern love it", 
    "The product was really easy to build, easy to follow instructions and good solid quality.", 
    "Easy assembly and it looks absolutely awesome in my living room. Highly recommend getting this!", 
    "Just what we were looking for but would have liked it a little taller. There were others taller but we liked this design. Well built and fairly easy to put together.", 
    "This TV stand is very similar to another one I saw elsewhere for over $2,000. For one less zero. This one the quality is not bad at all.", 
    "I love this tv stand. It fits in with the decor in my family room.", 
    "It is coming apart because of the particle board.", 
    "Assembly was decent. Would have been nice if the parts were labeled though, but it looks great once it is assembled.", 
    "It took my husband 1.5 hrs to put this together but its worth it. Heavy, good quality for the price", 
    "Beautiful quality and looks amazing in it new living room", 
    "My expectations were met with this product. It looks great and my husband put it together in no time. I will say that fingerprints are a bit of an issue but I've accepted that having a toddler means this is true with most items.", 
    "This console is very sturdy. It looks great with our furniture. Easy to clean. Easy and quick to assemble. I am eight months pregnant and was able to put this together by myself within an hour and a half. All the pieces individually are light enough weighted that it's possible to do alone, though of course that isn't recommended. Overall I would highly recommend this console to anyone.", 
    "This is a nice piece. I was a little disappointed at the height of it,I thought it would be taller but that's my fault for not reviewing the specs. I still like it and it fits all our TV supplies and video gaming supplies. Took my son and son in law about an hour to put together", 
    "Nice stand but the drawers were very hard to put together and stripped off and broke in the back during the process. We would have sent back but the cost to return something like this is way too high especially for the reason we wanted to return it.", 
    "this piece is a beauty! great price! highly recommend!", 
    "Exactly as described, a very nice piece of furniture! Supports my 60 inch TV and the color is very very dark...love it!", 
    "I give this a 4 star only because of the time it took to put together. It looks great and I am happy I got it. It does take some time to put it together though so if you have a couple of hours to spend it is worth it.", 
    "Found it to be an excellent stand for my newly purchased 60\" T.V.", 
    "tamano,precio perfectos.me encanto", 
    "I AM REALLY PLEASED WITH THE SELECTION OF THIS TV CONSOLE. I LOVE IT.", 
    "Good quality lokks great in gameroon easty to assemble", 
    "A beautiful piece of furniture with a modern look for the price. It arrived packaged well. The assembly process was not difficult at all. Love the addition to my living room.", 
    "Bought this for my son and his family. He told me, thatI looks \"pretty nice\", but he is not sure it is sturdy enough to hold his tv. That was the purpose of purchasing this piece. Also, top looks warped. Disappointed.", 
    "This console is much cheaper then I expected. I would compare to Ikea or below quality.", 
    "This is a beautiful piece of furniture", 
    "Love this TV stand! Drawers have more room than we expected. The only reason we did not give it 5 stars is that the back side is not finished and we have it about 6 inches from the wall.", 
    "Decided to try this piece out despite people saying it was difficult to put together and some pieces arrived damaged. The package arrived smushed at the ends and looking like it was a return item sent to me. But when taking it apart, each piece was so protected that there was no damage at all. All the pieces were packed in order of use and I can follow graphic directions so it 2 of us less than 1 hour to put together. And it is as handsome as the picture on this site.", 
    "The hassle of a long assembly process not worth the flimsily quality. Bought 2 of them and one still sitting in its box.", 
    "Very nice piece of furniture for the price I paid. My bf and I put it together and it was very easy to assemble.", 
    "this is good value for the price and easy to assemble", 
    "Very good material for what you pay. The product looked better then I expected. I get many compliments on this stand when I have guest over. I would highly recommend.", 
    "Bought this for my college son and his roommates. Really a nice looking piece but it took them hours to figure out how to assemble it. They almost gave up!", 
    "Really like this console but should have thought more about the height for our 65 in. The TV fits fine but I messed up by not thinking through the height of the console and where our TV would sit on the wall. This was easily assembled, great price for the product.", 
    "I am very happy with this product. It is sturdy and looks great. Does not look cheap.", 
    "Ordered this for our new living room. It was easy to put together with 1 other person and it looks great! We hung our TV on the wall above the stand, it is a 40in and it looks great. Look is clean and modern--just what we were going for.", 
    "This TV console is a quality product that looks great in my home. The black color goes well with any TV. I am a 64 year old woman and was able to assemble this unit in an hour and a half. Instructions were clear and everything was labeled. It was packaged insanely well, so there was no damage in shipping. I'd buy one of their products again. Very happy!", 
    "Packed very good. Relatively easy to put together. I did by myself and I'm 71 female. Love the design..looks high end", 
    "Beautiful! It's a bit tideous to put together but a very nice piece for the cost.", 
    "It ends up looking very nice, but would have been too difficult to put together alone. I also resented all of the fibers everything was coated in as they are certain to be inhaled being so small. Manufacturers should be a little more concerned about safety. Top scratches easily.", 
    "Looks as good in my home as it does in the pictures. My husband and I put it together in a couple of hours without any trouble. So happy with it!", 
    "Very light. I won't put anything too heavy on the shelves but it is very attractive and easy to put together.", 
    "Glad I purchased this tv console. Very sturdy and affordable.", 
    "Amazing! It really was easy to assemble, all parts fit perfectly, and we've already had favorable comments from friends that said it completed the look for the new TV. Highly satisfied and plan to do moire shopping with Overstock as needs arise.", 
    "Expected more but not that great", 
    "Great product -- easy to assemble......", 
    "This product is great and has a great value in addition to looking like an expensive piece.", 
    "This is a nice media stand for the price.", 
    "It's always risky when you see a product that looks great but has a low price. Sometimes you are surprised by the quality sometimes not. This time, not so much. The top has a visible warp and the fasteners are not very secure.", 
    "I'm an older female, although it took me five hours to assemble alone, I took my time, I wanted it to be sturdy and done well... it came out beautiful! I bought the 72\" console for my 55\" TV... its perfect and match my other dark wood furniture.", 
    "I love this product, it looks so expensive and modern.", 
    "Easy assembly! Looks really nice! Very modern lines!", 
    "This console looks great and goes very well with my bedroom furniture. It was also very easy to assemble.", 
    "Goes great with my decor. Easy to put together. Very nice looking piece.", 
    "Easy to put together. Well packaged, nothing was damaged. Seems like good quality so I would say it's worth the money.", 
    "Looks just like pictured. Very simple to assemble.", 
    "I love this Tv stand. I spent a lot of time looking for the perfect one and this was it. I knew the moment I saw it. It was pretty easy to assemble. And it's super sturdy. The drawers open and close nice and easy, that's always a concern I have. Overall just beautiful!", 
    "Love this and the directions were easy", 
    "It's not as solid as I would like it to be.", 
    "The TV stand is strong, nicely designed and quick to assemble. End result looks much like their photos on their website. Perfectly priced and amazing rewards scheme.", 
    "This piece is stylish, modern, pretty easy to put together and looks great.", 
    "Too much assembly required", 
    "Turned out excellent! Great Price and easy assembly.", 
    "Assembly was moderate & it has sleek moderate lines. Good value for the money.", 
    "This was easy to assemble, but did miss up on the placement of a couple of the pieces (using pictures isn't always clear on up vs down). Didn't take much to resolve. Put together with my son in about an hour. Looks really nice and is sturdy.", 
    "The style is what we like, but the assemble instruction is really hard to follow, not like IKEA's.", 
    "This stand was easy to put together and stares free. I would recommend it.", 
    "I was encouraged to purchase this item by a girlfriend who bought for her mother-in-law. Let's say I don't regret it. This is a beautiful piece and goes well with my other furniture.", 
    "Nice design. However, the quality is non existent", 
    "We needed a console to hold our new TV. This piece arrived packaged with all instructions intact. Beautiful finish and easy to assemble. However, the doors don't open as the should and stick. I called customer service and they were very helpful and correct the problem quickly.", 
    "After reviewing several websites and actual stores like Best Buy, Walmart, Target I decided to purchase this tv stand. It arrived within the time stated via UPS, FREE SHIPPING BTW~! It's a long box so they might need help getting indoors. once inside I pulled out the instructions and reviewed them first, no \"written instructions but it's easy enough to follow. It took me a couple of hours at a slow pace to put it all together. It goes well with my leather furniture and looks sharp. I've had some good comments on it. For the money I would say it's worth it. I mean its not a $700 dollar unit but really what are you going to use it for? It's awesome for someone getting their first apartment. Or in the spare game room for the kids. I would recommend it and would buy it again.", 
    "I love the design of this table. Easy enough to assemble, but the drawers rub .", 
    "We like the console, good styling. It's very heavy at about 100 pounds. The assembly wasn't easy, good to have a husband's strength. Lots of parts and screws. But finished console is very nice. I like the visible raised wood grain on the black surface.", 
    "It took a couple of hours to put together myself and instructions were pretty good. Decent looking piece of furniture for a great price.", 
    "I liked this product due to its modern look and I'm very happy with the product. Bought it to fit a 55\" tv and its exactly the right size for both the tv and my living area in my apartment. Took my husband and I over 2 hours to fit up partly because we're novices at putting together furniture. The instructions were adequate but could have been better. The tv stand feels quite sturdy and although it isn't real wood, it looks just as good as something that was store bought. Overall, very pleased with this product and would recommend it to others.", 
    "I bought for a 65\" TV and it looks great with the TV and home theater system. It fits well in my large living room and is fits well. The price was reasonable given the size. It took around 45 mins to 1 hr to get the whole thing assembled though. Cons: The 4 corners are very sharp and I worry when the kids play around the table. The manufacturer should round out the corners for safety considerations.", 
    "Purchased this console for our workout room so we were not looking for something expensive. We were pleasantly surprised with this put-together furniture. The sturdiness of this unit complemented the contemporary good looks. Assembly was extremely easy taking about 30 minutes with the help of my wife.", 
    "Heavy duty construction. Great color. Darker than it looks in the picture.", 
    "It took us less then 15 min to put it together. The stand arrived in perfect condition. This is very solid it holds a 70inch tv no problems. We where concerned over the weight it could hold but once it was on there was no issue at all.", 
    "Great piece, easy to assemble! Love it!", 
    "Love this stand. It really compliments my living room with a uniqueness. Sturdy and easy to assemble... I know it will last a long time.", 
    "The price is right and the quality isn't bad at all. Isn't difficult to put together but the side supports are not as firmly secure as I would like. Still, no quality issues yet so I cannot complain.", 
    "just bought a vary large TV an needed something large enough to fit with a little space on both sides it did just that. I was able to it at a great price", 
    "Great deal for the price. I would set aside an hour to put it together. Color is nice and the drawers slide nicely. It's not super high grade quality compared to solid wood, but it looks great and serves its purpose.", 
    "At first i thought it would be small and was debating if i should purchase the bigger console, but its just the right size! It has a very nice finish, big drawers, and im very happy about the purchase.", 
    "This is really nice! Used it under our 72 inch walL mount flat screen to hold our components! It's great!", 
    "Easy to assemble, only took about 30 minutes by myself. Looks great and does exactly what I needed it to. Which is, sit below my tv and hold stereo components. I have a feeling that if it gets moved around a lot or has to survive an actual move, as in to a new home, there would need to be caution so it doesn't become damaged or fall apart, but for the price point, it makes a wonderful addition to my living room and is and does everything I expected.", 
    "Great price, great item! So happy with this console!", 
    "Assembly seemed to be straight forward, but had to tweet because on a missing piece. I'm sure Overstock would have fixed but we made it work", 
    "Very nice. Put it together without any problems. Doesn't take long. Great diagram instructions", 
    "Perfect for my space. Easy to assemble", 
    "The console is easy to assemble and looks like a beautiful piece of furniture (not something that looks like you assemble it!)", 
    "Just got this put together and in use. I like it, but wish it was a little taller.", 
    "I got this TV stand at an incredible price. It is a nice, solid looking piece of furniture, unlike the TV stands sold at stores in the same price range. I was able to put it together by myself with a little bit of effort. I am really glad I bought it.", 
    "Just the perfect size to hold my 45 inch TV.The 2 storage shelves hold my DVDs and CDs.I liked the awesome sales discount.", 
    "This piece was fairly easy to put together; though the drawers took a little extra time to make sure they were perfectly aligned. The overall console looks more expensive than it actually is. I would purchase this again.", 
    "I looked at a lot of tv consoles before choosing this one. I wanted something not to expensive but looked nice because i have small children and animals. This looks great with my tv. Note my tv is mounted on the wall and I use the console for my electronic devices and decorations.", 
    "A great buy! Looks exactly like how it appears in the picture. I personally added board to the open areas in the back because I don't like the opening so much.", 
    "Perfect for my living room and easy to assemble. Received item from Overstock on time. I am a happy customer.", 
    "I really love the look of the stand. It's exactly what I expected. Color is dark and great! It's not the sturdiest piece but it was an excellent price! I would recommend!", 
    "Missing screws and veneer started coming off.", 
    "This table looks exactly as pictured. It is very beautiful and was not very hard to assemble. We love it.", 
    "Not too bad to assemble, tooo about 1 hour. Nice piece and I love the dark espresso color.", 
    "I ordered this console almost one year ago. It was fairly easy to put together, it's good to have some help as it gets heavy towards the end of the assembly. It's the perfect size with plenty of storage space. I would definitely recommend it.", 
    "I love this tv stand. My only complaint is that some of the shelves aren't spaced in a way to accommodate my FIOS internet/cable box. I have to lay it on it's side to fit...", 
    "sturdy, well designed, a bit of a dust magnet.", 
    "great product would buy again", 
    "This is a very good and simple TV stand. Easy to install. Not many complicated pieces to confuse. Be ware this is not a solid wood. But, it gives a rich look. I would recommend to any one, who is looking for simple, elegant and nice looking TV stand.", 
    "Got this pretty quickly as far as shipping. It holds our 52\" TV with plenty of room to spare and is really cute. Not that difficult to put together..only took an hour or so.", 
    "Good quality and value overall but assembly is a bit of pain. You may need another guy to help.", 
    "The title pretty much sums it up.", 
    "I didn't want to spend a lot of money on a solid wood piece because I have 2 little kids and I wanted a TV console that we wouldn't have to worry over. This is QUALITY. I am very impressed with the finish of the Furniture of America brand. I even dropped my tape measure on the top and not even a scratch. It's textured which give it a nice look. Only downside is it shows oil from hands which is easily resolved with a furniture cleaner and cloth. Drawers work great. Easy to assemble. Love the style. Just a note. I didn't realize the back was open on the sides until I received it but it is in the picture. Not a problem though. No hardware is visible which is another indication of the quality. Very solid with style.", 
    "I really like this console. It is being used for my 60\" plasma TV. Looks good, finish is very good. Arrived with zero defects. Assembly was not that difficult (by myself) but the instructions are very basic and can be confusing to a novice. A very good basic unit.", 
    "I wanted to give 4.5 stars for this item. The assembly instructions were plain and straight forward. The material is sturdy, thick and heavy but the wood is engineered wood. Fits my 55'' TV perfectly and has lot of place for my accessories. The reason why I could not give the rating 5 because of the price. I bought it for $*** which I feel is a bit high considering the material. The overall look is good and modern. I would definitely recommend if the price is lower.", 
    "Arrived in a well packaged (heavy) box. There was a ton of styrofoam inside which got all over the place. All parts were undamaged and clearly marked. Instructions were just fine, took about two hours to put together including the time it took for me to remove everything from the box. Having help might make it easier but all in all I was able to put it together alone. Would recommend to anyone. Good price and the quality is great.", 
    "I am a senior citizen and I put this together with 1 1/2 hours while watching TV.. Easy instructions.. My first time to assemble any piece of Furniture.. Finish is very good. This is the price I wanted to pay.. Good to go.", 
    "This TV console is well made and easy to put together. Love it!", 
    "So far this is has been an excellent piece. It looks exactly like it does it the picture. The materials are of much better quality than I had expected. Took about an hour for my roommate and me to put together. Would recommend for the price.", 
    "I am sooo upset that I didn't measure correctly. I absolutely love this TV Console but it's just not tall enough. I am hoping that I can find a similar piece just as beautiful as this one. I highly recommend this TV console.", 
    "Great looking tv console. Will go with many living rooms, contemporary, modern, etc etc. Comes in a big, heavy box and will require two people to initially move the box around but once opened and you remove the pieces, it's very easy to put together. Instructions were clear ad parts were labeled precisely. Product looks sturdy. Color is great as well, just as described. I have it sitting under a 60\" tv that is mounted on a wall and that's about the biggest size that looks good as far as the tv goes. Anything bigger, you should opt for a little bigger tv console. Overall, nice product and very good value. Looks great. I would recommend this.", 
    "This TV onsole looks beautiful and was perfect for my new flatscreen TV. I had help putting it together as I could not have done it on my own. It's definitely a two-person job and takes awhile, but it is definitely worth the effort.", 
    "GREAT TICKETED ITEM. I WILL DEFINETELY RECOMMEND THIS PRODUCT.", 
    "Beautiful and well made. Looks great in my family room.", 
    "I just amazed myself that with my trusty power screwdriver and the directions, I put together this beautiful, useful, strong piece of furniture that looks great in my livingroom. It is perfect for my flat-screen, ipod, dvds, books and was very inexpensive! ThanksOverstock.com!", 
    "This stand is extremely Sturdy. We have a 60 inch LED TV on it and it works well. Love all the shelves and drawers for organizing and storage space. Very happy with this purchase. Have received many comment about the modern style of the legs", 
    "This is a great table for use as a TV entertainment stand. As far as flat furniture is concerned, this one was particularly easy to put together if you have put together flat furniture before. Even for the novice, this would probably be a breeze as long as you read the directions. My 55\" Flat Screen fits well and I am very pleased with this product.", 
    "I had been looking for a while to change out my oversized entertainment center with a smaller console that would blend with my somewhat oriental styled living room furniture.Finally this one popped up. I read other reviews and decided this was the one for me. I could not be happier!", 
    "It looks good in my living room. The shelves make things look pretty organized and I love the fact that it comes with drawers so that I can put things that I don't want people to see. The color is great. A classic!", 
    "Love this console. It is a great looking piece for the price. We were able to put it together in about an hour.", 
    "I love this console, especially for the modest price I paid. Sturdy, modern, color is a great espresso brown. The drawers work smoothly and the shelves are secure. I would buy it again and I definitely recommend this to anyone who is looking for attractive and reliable furniture at a young adult's budget!", 
    "I ordered this for my granddaughter and she loves it! It wenttogether well and is a solid piece of furniture for the price.I would recommend this !", 
    "A few things convinced me to buy this. It was the widest (front to back) of the options in that price range, which made me more comfortable with putting my new plasma TV on it. It was cheaper than other options. The \"wood\" had a darket finish which suits a black tv, black sound system, and black wii U. The lack of back cable panels make it perfect for someone with only a few devices. By putting them on the bootom shelves the cables hide themselves. People complain about difficulty of assembling, but that's a load of crap. The instructions are simple and obvious. All pieces are marked and all fasteners come packaged in a strip of compartmentalized plastic that is in the order that they appear in the instructions. 5 year old me could assemble it. The only complaint would be that it takes 2 people with lining up for one step, which is perfectly manageable without. If you're single and without friends then surely you can afford a real piece of furniture anyway.The finished product looks professional and that's all that matters for the price.", 
    "Beauitful Very Rich Looking in my family room. Easy to put together, Shippment very fast.Happy with this purchase! Everyone who see's it in my family room comments how Lovely it IS!", 
    "Very beautiful and sturdy item. Was as described in the description. has a lot of parts to assemble but very worth the time! It was just what I was looking for for my tv in my bedroom and match my furniture perfect, but will also look great in your living room or den area also! Wort the money!", 
    "I love it online when I saw and after I finished assembling it. At first I was discouraged because it was all flat wood that needed to be assembled. It took me a couple of hours to build. I did have trouble with the drawers but I finally got it together. I would recommend they give better instructions on how to build. Overall all I love the way it looks in my living room!", 
    "I love this piece! The directions for putting it together were great, I was able to do it alone (took a couple of hours) and all the pieces fit together perfectly. I'm giving it 4 stars since complete assembly was required for the price. It does look great and fits in my living room nicely.", 
    "This piece is perfect for our condo living room; sits below our wall mounted flat screen TV. Rather easy to put together (two people needed). Clearly, it is pressed wood and not hardwood, but still a good value for the price.", 
    "Great price for the size and it looks fantastic! I was searching for an entertainment center for a 65in tv with room on the sides and this was perfect. The wood is a lovely espresso color and drawers are solid and working well.", 
    "This by far is the worse thing I've ever ordered. First off I hate that dumb screwing system they have. Thing this is so small I got the 60 inch and it look like a TV stand for a child's room. The picture make it look taller, wider, and bigger then it is. It wasn't worth the ***bucks I could've bought a $** TV stand from family dollar and got the same look. I had to take out all the screws (after chipping the \"wood\") and secure it with gorilla glue. If I didn't use the glue the thing would've felled apart. It's more lamented then a polish wood if you can call it that. I've made purchases from overstock and was surprised of the poor quality but the prices ,free shipping, and the rewards always made me a returning customer but not anymore. From this day on I'll stick to amazon customer service is way better.Trust the picture is misleading it looks so nice but in reality its a real disappointment. Don't buy.", 
    "It looks very good, but I was disappointed with the delivery. The package was left outside, uncovered on a rainy day. Luckily, I got home right on time to take it in. Overall, I am happy with the product!", 
    "This console is decent enough for now. It is particle board, not wood. The directions were relatively clear, but I was more impressed that the hardware was individually packed, along with all the pieces numbered. That made putting it together very easy. The top drawer sticks when closing. For the price, I think I could have found something a bit better but not much. The design is nice but you can still see cords in the back since the 2 ends are open in the back.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Danbury-Modern-2-drawer-TV-Console/8385957/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=11", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8385957/Furniture-of-America-Danbury-Modern-2-drawer-TV-Console-3656a52e-47bd-4ee4-9e5a-ada86ccbe6da_600.jpg"
  ], 
  "description": "Create a stately look in your living room with this handsome\ntwo-drawer TV console by Furniture of America. Curved sides give\nthis piece an elegant silhouette, while the silvertone drawer pulls\nadd a modern accent. With its generous dimensions, this TV console\nmakes a smart addition to a focal wall in your room.Contemporary TV console offers convenient electronics storage\n  and display spaceAvailable in black or cappuccino finishesCrafted from metal, MDF wood and wood veneersFour open shelves hold electronic components or decor\n  piecesTwo drawers offer discreet storageWeight capacity of 100 poundsAccommodates TVs measuring up to 60' or 72'60' console measures 21.5' x 60' x 18'72' console measures 21.5' x 72' x 18'StyleContemporary, Modern, Transitional, UrbanMaterialCherry, MDF, Metal, Veneer, WoodTypeEntertainment Units, Media Cabinets, Storage, TV StandsFinishBlack Finish, Cappuccino FinishAssemblyAssembly RequiredColorBlack, BrownNumber of Shelf4Weight CapacityUp To 100 Pounds"
}