{
  "name": "Furniture_of_America_Berkley_Modern_Coffee_Table", 
  "price": "EUR 195.99", 
  "reviews": [
    "Arrives assembled except for legs, which takes all of 3 minutes to setup. Beautiful modern piece, adequately sized and of good quality. The extra space drawers are a great feature. I personally like the wood pattern of this unit. The side drawers have a shine to them, the table top does not. I would recommend this piece to a friend.", 
    "We purchased this coffee table after looking everywhere for a table with a low profile and clean, modern design. We also wanted a table that offered a little bit of storage, so we were very pleased to find this table at this price. The table looks great in front of our mid-century white leather sofa, and the pull out drawers give us the right amount of extra storage we needed in our room. The color of the table is a little less warm than we thought it would, be but this wasn't a deal breaker by any means. The table arrived quickly and in excellent condition, and took about 1/2 hour to assemble. Overall, we're very pleased with the design, size, weight, and quality of the table. It fits our mid-century home well.", 
    "I love this coffee table! so modernly and the drawers on each side are huge!! The whole tabke is nice itself and has such a wide table top to fit a big family. And I love the assembly, all I needed to do is assemble the legs and that's it! Very nice coffee table with such great features and it's very solid and sturdy. I love this table!1", 
    "It's definitely not the best quality but it's an incredibly nice table for the price. I love all the room both in the drawers and in the middle to put magazines, etc. The drawers actually can keep a lot of stuff. The con is the drawers are a little tight to open and close so you can't do this too much, and I already notice there's a little scratch in the drawer door inside where it meets the table. It's very minor as you can't see it when the drawer is shut .. Overall, it's very functional and does look great.", 
    "great looking table. I bought this for the game room and its fit in perfectly. It was easy to assembly and all parts where okay when they arrived. I really like the compartments. they bring alot of style tot he piece. Very happy with the out come and The price is great also.", 
    "I love the look of this table, really interesting curves and lines on it. The shelves and legs all feel really sturdy, and I've had the table for several months now and the table still seems as substantial as ever. I've received many compliments on it and it looks great with all my other furniture. However, be sure to use coasters on it and wipe up any messes asap or the top layer of the veneer will bubble up and you'll be left with a bumpy texture anywhere a liquid sat too long. I made this mistake and now the sticker layer on top is starting to peel on one side after it bubbled up. All in all though I would definitely recommend it.", 
    "Aewsome looking table very please with the delivery of the item, was fast and had no issues. After putting the table together which was pretty simple and took hardly any time, I was also very please with the outcome. Love the removable sides, really have never seen a unique idea like that. I would recommend.", 
    "Love the modern look to this table. Great for the price. Looks amazing on my shag rug. Love the storage. Very pleased!", 
    "Love this table. extremely easy to assemble, just needed to put the legs on. I've had a lot of compliments on the looks and style.With a lot of young children visiting its nice to have the rouned design.", 
    "Excellent table to go with the mid-century modern decor in my living room. It came wrapped like a tank! From the inside out, styrofoam then cardboard then bubble wrap and lastly plastic wrap. No damage at all. I was a bit disappointed that one of the drawers was a little catchy...but I don't use it too much. Haven't gotten the chance to get too pack-ratty with it. Overall great product for a great price.", 
    "Great table with good quality. I got mine less than a week and I've had it for months and still looks great and quality is so great. So glad I bought it, love the extra storage all aroud the table and the size huge, which is great!", 
    "I love this coffee table, it's so nice. The design and it's so great to have a coffee table with a drawer. Very good quality table and it was pretty easy to set up, it pratically comes assembled. Affordable and sturdy sturdy.", 
    "I'm very happy with my purchase, I did great. The price is great and the quality is very good. Sturdy and color finish, everything is great. It was easy to assemble and it arrived early than expected so I'm very happy that I purchased this coffee table, it's made for me.", 
    "The table is sleek and modern! i was able to setup in less than 5 minutes. Easy to clean! Definitely buy it!", 
    "love my new table for my new place. I never buy things online but I loved the way this table looked and didnt want to pass it up. Well I wasnt disappointed. assembly was simply from what I could see as my friend was putting it together.... LOVE the side part, looks very cool. I would recommend.", 
    "Looks great... Super Easy to put together. Is the perfect Center piece for the Living Room.", 
    "I love my coffee table it has such great assets. Is not like a regular coffee table, is more! It has marvelous compartments to keep te table top from haaving too much things on top and the quality is great. Easy set up and the price is awesome! Plus it was delivered to me in such a small amount of time. I love this table, it's great. I highly recommend it.", 
    "I love this c. table!! it's great! very useful and helpful. It has a good amount of room on the table top but if you decide to serve your guest with some snack, you can pull the drawer that turns into a tray, so great! My mom was very please and surprised when I did and she loved it. She even said she want one for her house, I was laughing with the surprised and envious look on her face. I really love this table, the quality is great, the price is great, not much of your time wasted in assembly, and it's one of the best table that I've ever seen.", 
    "i love the style and quality it has, it's great. Very sturdy, easy to set up and it has a unique style that I've never seen before. I love it and it goes well with my white sofa at home and the others. Such great quality and the price was such a bargain, and! delivery was quick.", 
    "I read the reviews and thought a laminate top like Formica might actually be very practical. While the top looks like Formica, the first time a glass was set on it the MDF underneath bubbled up. I now have a bumpy raised area under what appears to be Formica. While some have been disappointed at the Formica type top, in this case I wish it actually had been.", 
    "For the money this is a great coffee table. Setup is very easy and shipping was faster than expected.", 
    "This table is described as wood, MDF and veneer. However, this table has a formica top. It looks very cheap and plastic. I'm returning it asap.", 
    "A very attractive and solid table for the price. Well-packed (too much non-recyclable packaging though) and easy to assemble. The drawers stick a little but they may slide easier with use or with some lubricant. The design is nicer than I would have expected for the very reasonable price and it goes with lots of different styles and materials of furniture.", 
    "the moment water or condensation hits this table the ply wood interior bubbles up, eventually the thin paper veneer, starts to separerate, away from ply wood, not worth the money", 
    "I got this table because I wanted one with no sharp edges so my young granddaughter could visit safely. This table has the virtue of smooth contours. And I enjoy the modern aesthetic -- elegant, unpretentious. The workmanship seems quite good. Some parts, such as the legs and the wood facing on the drawers, shine, while the rest is visually quieter -- a nice contrast. I'm quite happy with this purchase.", 
    "I'm enjoying my coffee table very much! So nice, and sleek and very stury quality. The side drawers are a very nice touch, so hidden which makes it so sleek. Good, and very sturdy. Paid less for it, and now I have a great and wonderful coffee table.", 
    "The material used for the top of the table just doesn't hold up. A glass that apparently had a slightly wet bottom caused the material on top to bubble up ~ I see this on a few places. We don't use coasters, and apparently we should. But I'm surprised at how easily this happened. The style and design are great, but the drawers do have a tendency to stick. Not the best quality in either construction or materials. The price is good, but for a product that \"performs\" so poorly, this table isn't worth it at any cost.", 
    "I'm happy with the product overall. It was very easy to assemble. Quite heavy but I was still able to assemble on my own. I've been using it for a few weeks now and it's very sturdy and looks good!", 
    "The table isnt bad, just not what I thought. Very small for the room we placed it in. It would be good for a apartment or dorm but not a family room, very small. The wood looks cheap. Easy assemply. I recomend it if you were just starting out and needed a small coffee table.", 
    "This is a pretty cool table. I love the modern look of the it. The side drawers are the best part about it very unique. The assembly was very easy and no problem with it. The delivery was fast and I would recommend for anyone looking for nice looking table at a nice prrice also.", 
    "I liked the retro look of the table, however, when it arrived it looked very cheap. It also arrived with a chip on the side. We decided to not use it for our living room, but use it as a media table (to store our video games, DVD, etc.) so it gets minimal use. The middle of the table is sagging and it is difficult to open/close the drawers.", 
    "love it and not regretting this purchase. it's hard to purchase items online, but this is a great buy!", 
    "I love the design of this table. I love the pull out drawers---they are sturdy and work well", 
    "Let's see it was shipped to me in 3 days!, easy assembly, and I received a very good quality coffee table. I really like me table, very stylish.", 
    "Very well done with my coffee table, it's nicely done. First I would just like to say that customer service was great, the shipping was very smooth and quick. Smooth because no damages. Now the table itself, high quality wood used, and very sturdy. Love the hidden drawers, very impressive idea. I can tell how well the craftmanship that was put on this table, very impressive. I highly recommend it, very thought through process was put into this coffee table. I would think it should be more expensive for great quality but so glad is not expensive. I love my coffee table, and I know my guest loves it too they always admire it when they come over. So does my family. Why wouldn't they, this a great coffee table ever made.", 
    "I highly recommend this coffee table. Best price compared to others, easy setting, about 30 tops in assembly, and you get great quality for such a low price. Is a table that you can pass on from generation to generation, the quality is amazing. Sturdy, and very well designed coffee table.", 
    "Sure a great looking table and very modern. Never seen something like this and i just needed to have it. The price was great and it looks wonderful in my living room. I have gotten many compliments on it and definitlety brings a new look to the room. Satisfied with the purchase.", 
    "Great looking table, just what I was looking for, Its very simple but bring alot of charcater to the room. I have a small apartment and not alot of room for furniture, so this table I can use to store little things and put stuff on top. Very happy that I bought this table the price was great and it was fast to get togther.", 
    "The table looks great, but the center of it gets curved after some time with no weight put on it. It would be nice if it had some reinforcement in the center", 
    "The table is sturdy and was easy to assemble. Not great for putting your feet on because the edges are very sharp. Top scratches easily, but I haven't tried too hard to get rid of them, either. Can knocked over a glass of water and the puddle sat overnight. The water seeped into the top and swelled it up a bit. Not too noticeable anymore.", 
    "Is somewhat sensitive to water damage however.", 
    "I love the style and deisgn of this cocktail table. I'm into retro appearance and rounded edges. I wish this came in other color options athough the color is as described and shown. Didn't give it 5 stars because I already see wear at the top edge of the draws. It rubs on the part above when pulled. out. The draws a enough storage for the TV remote a a few small items. The middle section is adequate for magazines. I use it for two laptops. Nice table...not too small not to latge.", 
    "I wanted an oval table and one that was not the ordinary. I have mid century type furniture and this fit in. It is not heirloom furniture, and for the price wouldn't expect it to be, but it does the job, nice drawers, easy to assemble and looks great. Not asking for more.", 
    "Awesome coffee table - very beautiful walnut finish - went really well with my modern black leather sectional. Easy to assemble and arrived perfect - no scratches nor cracks.", 
    "Great coffee table- love the color - great amount of table top space and the storage is awesome- very roomy", 
    "I love this coffee table! My initial attraction to it was rounded corners. I have two small kids and spent the past few years taping and covering sharp corners of the small tables to prevent typical kids injuries. At the same time, we were craving a modern look to the living room that we can enjoy while being kid friendly. Table seems pretty sturdy and heavy. Putting it together was VERY easy (even with two kids helping). I love the storage space that it provides. So far, I have nothing to complain about. VERY pleased with the purchase!", 
    "LOVE IT sturdy color just like picture I love the drawers for storage and helps keep the table clutter away", 
    "What sets this table from many others is the two drawers, one at each end. I keep my remote and a few odds and ends such as my TV gude in one of the drawers and it is handy and a very smart way to keep things organized. I have a 18 month grandson, and he has to rip into anything laying out, with the drawers I keep my stuff out of harms way. It is a really nice looking table. It is made of wood and the drawers are made of plastic I think, but they all match well. It was a snap to put it together and I am 69 so if I can do it anyone can attach the legs. Give it a try you will realy like it.", 
    "After searching for a table for our apartment for months, we finally decided to purchase this table. It came very well packed, and was very easy to assemble (thanks to my husband!) The quality of this table is great and we love it so far. It\u0092s easy to clean and very light weight. I would definitely recommend this table to everyone.", 
    "I like this coffee table in my modern loft. The drawers are a bit tight and hard to open, but overall the quality is quite good. I like the curved edges to soften the look a bit. It has a few small chips, so it's not as durable and I wish it was, but overall I'm happy with this purchase. Buying from Overstock is a dream. It came so quickly and was delivered right to my door on the 6th floor.", 
    "This coffee table is honestly fantastic for the money. The deep side drawers and rounded corners make it especially ideal for homes with wobbling toddlers. Although it's clearly not real wood, it still looks very nice and has been a perfect fit in our home. Easy to assemble and easy to keep clean also!", 
    "The first thing you should know is that the drawer that's open in the photo isn't just for demo. it doesn't close. There is a huge block of wood glued in that prevents it. So it's not really a drawer, more of a removable shelf. This totally messes with the lines of the piece which is what attracted me in the first place. There are scratches and gouges in the edges of the drawers/shelf and the wood veneer around the top edge of the table was tearing away, and needs to be glued down before it snags on something and tears completely off. It was easy to put together, which was good, since there were no instructions. It's a 60 lb. coffee table so returning it isn't worth the trouble to me. It will just go in the basement when I'm able to find something nicer. This is the 4th and last thing I will ever order from Overstock.com. I guess I didn't realize they were a scratch and dent store, which I should have figured out since that's how everything arrives.", 
    "For the price, you can't beat this table. If you are looking for a long lasting piece of furniture, you aren't going to get that at this price point. I will warn you, do NOT let anything sweat onto this table. Any amount of water left to sit longer than 10 minutes WILL irreparably ruin the surface. Even a drop, falling off the cup while carrying your cup over the table to be set on a coaster, will warp the surface. My only other warning is do NOT place any heavy books in the center of this coffee table. It WILL sag. Noticeably. Other than that, this is a great table. The drawers on the side are handy. It was super easy to put together.", 
    "I love my new coffee table. It beats the heck out the Ikea one I had before. The color matches my sofa and its low to the ground so I can kick my feet up on it once and a while. The legs are metal (not cheap plastic) and come with nice pads on the bottom. The only set up was putting on the legs. The drawers open a little stiff but the are great places for storing coaster and remotes and removes the clutter I used to have. If the color and style matches your living room and then go ahead and order one.", 
    "Great looking coffee table in the end. Love the drawers and pass thru for coasters and placemets,etc..Easy assembly (just legs with an Allen wrench). Mine came with some shipping issues; something chaotic must've happened as the styrofoam was all banged up, hardware bags were ripped open (almost didn't have enough bolts for legs) and 1 of the drawers was jacked up. Took me some time and patience to get the drawer back onto it's guide track. Overall, I am happy with it, just wish that I didn't start out with a disaster when I first opened the box.", 
    "very good product, the color was a little different of what I expected but it is ok.", 
    "Love this coffe table. Very retro and all my guest always compliment it. Made for smaller living areas though.", 
    "Very happy with my purchase. Delivery took less than a week. The table was easy to assemble. Very comfortable with the drawers inside table. The drawers take a little effort to pull out, wish they were on little wheels or gliding system. I have a very narrow living room and it's perfect for that little space. My son still has room to run around it. Easy to clean, just wipe with damp paper towel or cloth. You can't even see the dust on it because of the color of the table. Would recommend it to anyone.", 
    "I love this table. It was easy to assemble, taking only about 10 minutes. It completes the look of our room and we've gotten numerous compliments on it. It was a great purchase.", 
    "Simply put, one great table!! Great finish to compliment a great design. The drawer space is larger than expected. Put together in 5-10 minutes. If I needed another or to give as a gift...this would be my choice.", 
    "We just received it yesterday, and when I got home, my husband had already put that together. It was a very quick assembly. It looks great. Not so big, not so small. One of the drawers doesnt open up as smoothly as the other one, but it is not a big deal since we won't be using it so much. Even better actually, so our kid won't be able to open it up by herself when she grows up :) Over all we love it so far...", 
    "Size, color and style fit room perfectly, side drawers great got storage", 
    "love this piece. will of course purchase from this line again. very very very happy.", 
    "Arrived in excellent condition. Heavy box. Very, very easy assembly (only need to put on the legs). Big drawers, ample room on top of table & in drawers. Excellent value for the low cost.", 
    "It's an interesting unique coffee table. The thing that attracted me to iris the modern design and the hidden storage. It was shipped to me in 2 days! and assembly hardly any, which took only 5-10 mins. Im impressed! Great deal for a very great furniture.", 
    "super cute table, easy to assemble, fast delivery.", 
    "Greatly designed coffee table. It looks nice in the livingroom area, and it goes well with everything. Drawer function is great, and the style itself is very different, I like it very much. I did great in purchasing this wonderful coffee table, my husband said so himself.", 
    "Just received my table for my new apt! I loved the way it looked online and it looks even better in person!. This table is at a great price for the quailty. I would suggest like with any table furniture to use coaster and care for it. The item arrrived in great condition and I had no problems with assembly. My favorite part about this table and what I think is most unique about it is the sides of the table. I shoppped around for a bit before I bought one and this is the only one I found with this design. Bottom line I like the table i think its a great buy and would recommend to anyone looking for a nice looking able for a good price.", 
    "This table is a nice addition to my living room, it goes nicely with my sofa set and matches with my end table. Very little assembly, just the legs wich takes about 2-5 mins. The quality is great, and very sturdy. I also like the drawer that comes with it, so nice to have a storage space to put all my old junk from old coffee table. I'm very happy with my purchuse.", 
    "Not bad for what it is. Functions well except for one drawer (just as other reviews mentioned). Looks nice and is a place holder for when I look for a more substantial table.", 
    "This is a nice table, very easy to assemble and comes with all parts you need. The box isnt too heavy so its easy to bring it in alone if you must. My biggest caveat that made this table 4 stars rather than 5 is that its quite weak. I can definitely tell its bowing where I put a 47\" LCD TV on. The TV is not too heavy and the middle part is sagging a little. This causes the drawers to be hard to open/close. Its not a deal breaker but I expected more when you're dropping 2 benjamins for a coffee table.", 
    "It came almost completely assembled; I only had to screw on the legs. It was such a relief, after already putting together two other items that day. Love the look and functionality of it. I would definitely buy it again or recommend it to a friend.", 
    "Am enjoying using this table. Compact but not too small. Sleek and modern looking. easy to put together. Only issue is the side drawers - do not open too easily - could be a little smoother.", 
    "Just as expected. Easy setup. Very solid!", 
    "has the right look. Drawer is solidly built. looks nice, clean. Shiny, but in a good way.", 
    "Delivery is fast, exactly as shown in picture, and I love it!", 
    "Outstanding product that is vey sturdy and appealing to the eye.", 
    "really nice coffee table, especially for us with little kids, there's no sharp corner for them to run into.", 
    "I like the table but the side drawers are very tight and hard to open. quality could be better", 
    "A review I read said one of the drawers did not shut, that it, like the picture stayed open. That was (thankfully) not true. We also read that the top would quickly mar with any drinks left on it, so my husband put a nice coat of wax on it, just to be sure. We love it, fits well in our space and is low to the ground. We like the lines, and the storage is great.", 
    "No wow surprise factor, just exactly what was expected in simple photo. I like it, my rumba can fit underneath, exactly why I chose this one. Did pay $120 to make custom glass top, as reviews mention top veneer fragile. Smaller than I expected, but still works out in my quaint living room.", 
    "It was a very good choice with a small child in the home and I have gotten many compliments. The only drawback I would say is that it has gotten scratched over time. But the scratches are barely noticeable when it is freshly cleaned. Would buy again.", 
    "This table is great of the price! Stylish, great scale for my room and relatively easy to put together. The only reason I didn't give 5 stars is the pieces that fit into the feet were extremely hard to get in. Other than that, I couldn't be happier with this table.", 
    "This is it. My husband has a draw to put things in. He feels as though he has a closet of his own. The other side is mine and the rest of the families. We can hide remotes, magazines, pens, nail files, whatever you may need. In the middle you can put your books or paper plates and napkins.", 
    "I love this table. I was skeptical about buying it because it furniture and I wasn't sure how it would hold up with shipping but it is great. It came wrapped very securely, and I love the size, the pull out drawers and the opening inside. Everything about this table, so far is great.", 
    "The table is a little cheap. It came in the mail and had a stratch so overstock gave us a discount which made it worth it. We store books and toys for a little guy in it and it keeps it out of the way. It does scratch easy but works for us now", 
    "Solid construction and a simple/modern aesthetic...and easy to put together too! Definitely a winner.", 
    "Table looks good and is functional. If they would have made the top and bottom of 3/4\" MDF instead of 1/2\" it would have been much sturdier. If you have small kids and they like to climb on things don't buy this. Either one of my friends kids sat on it or one of my friends put pressure on it while standing up; either way it cracked thru the middle (top and bottom pieces. Crack in top is hardly noticeable so I'm not to worried about it but this table won't stand up to much.", 
    "You get what you pay for, and this table is very affordable. The drawers don't slide completely out as listed, but overall, we are pleased.", 
    "This was a great buy for our family. We have a toddler and bought this table when he started crawling. The rounded edges helped prevent accidents. We store dozens of board books in the middle. The drawers take a little effort to open and he cannot get in there himself so we can store other things like remotes and Ipads in there that we would not want him to access all the time. It is a very functional piece of furniture and it looks good as well.", 
    "So easy to put together..just the legs...took 2 minutes..lots of storage for books ,kindle,remotes...love love love it", 
    "The only reason I didn't give this more stars is because I thought it would look more like real wood. It's very laminate looking, but I do get compliments on it and it's super functional!", 
    "This coffee table was so easy to put together, and looks great in our apartment. It is the perfect size and the drawers and open middle add great storage spots. If you're on the fence just go for it, you won't regret it.", 
    "A fantastic, easy to assemble table. Love the look and feel and it complements our furniture and space.", 
    "The drawers are very tight and difficult to open. Therefore we have no use for them because its a hassle to take things in and out of them. Also I should have noticed that in the picture there is a glossy aspect to the table which is on the side and I didn't realize it until we got it and took it out. I wish both the top and the sides of the table where the same finish. As you can see the top looks matte with a slight sheen where as the sides are wrapped with a glossy finish. Overall it is a study table, but I personally didn't like it.", 
    "The design is very nice and modern. Love the drawers, they actually fit quite a bit. The quality of the wood I don't like though.... It is very obviously artificial, without any texture (matte on the top and shiny on the sides which is weird). We have a toddler who likes to play with you cars on top of it and it got immediately scratched - it's not very forgiving.", 
    "The table is perfect height. It is also the right length for my small office. Super easy to assemble. The storage space in the middle is nice for magazines or the book you are reading. The two drawers are 10x21, which is great for my papers.", 
    "I realize that this table is pretty ugly in the picture, but its even uglier in real life. Cheap looking and the drawers don't fully open up. Its okay, and I really can't complain for the price, but I guess I am complaining, aren't I?", 
    "We love the design and look of this table. It is really easy to assemble. The table isn't too big but thats perfect for us. The side drawers don't offer too much space but you can easily fit remotes, iPads, and other small things. Great buy!", 
    "I've had this as my main coffee table for about a year and a half, and it has started to sag in the middle. It's just cheap manufactured wood, and there is support only under the legs, not in the middle of the table, so it's inevitably going to sag. However, I do get lots of compliments on it, so I guess no one else notices!", 
    "Nice table, heavy, like the chrome legs and the storage drawers on the ends. I wish it were a darker brown but it works ok since matchy- matchy isnt in right now and the price was right.", 
    "Super easy to assemble and infinitely easier than anything IKEA. It's pretty stylish too. The picture is a great representation of the product.", 
    "I really like this table. The quality is very good too. I like the way the drawers open up on the sides. It has a great contemporary look. Love it.", 
    "The drawers were very tight and it was difficult to open and close. The table is much smaller than it looks in the picture, be sure to look at the measurements. The finish is vinyl and looks cheap", 
    "Well packaged and easy to put together. The storage drawers are nice.", 
    "great coffee table. good looks & plenty of storage", 
    "Nothing fancy, but for the price I like the look of it.", 
    "3 Stars - While the quality of this item is great, the color is much darker in person than pictured. Misrepresentation and a poor customer experience.", 
    "Table looks exactly like that pictured. I was disappointed in the uniform 'striped' wood veneer. The drawer doesn't slide open easily. Also, what I thought was a plastic protective film on the side is glossy veneer. That looks cheap. When I thought I was going to peel off plastic, a small piece of the actual veneer flaked off.", 
    "First off, i was worried about putting this together. when i opened the box, it was fully assembled except for the legs. total jackpot!!! and i just love it. it fit our needs perfectly.", 
    "Exactly as pictured. So glad I bought it!", 
    "Love this coffee table. Easy to assemble, sturdy. Fits in my groovy-ish family room design, has a drawer and a shelf that leave clutter OFF of the top.", 
    "This table looks great though I feel it's not a great fit for a small living room. Its wood texture is really pretty, but I'm worried about it peeling since it's just a laminate on particle board. It came damaged, but that was due to shipping problems. Too bad I didn't notice when it arrived since I waited till I moved out to open the package. The drawers are a really tight fit! I have to yank it out in order to open it which causes the drawer to come apart sometimes. I avoid using it for remotes and such since it's such a chore. All in all, great design, but too bulky with too tight fitting drawers.", 
    "This looks like it's made of plastic, which was fine with me because I thought it would at least offers the prospect of being very robust. It's not. A glass left on the table will immediately cause water damage. The edge of the table top arrived with a chip that then peeled back leaving a rough edge. The drawers are difficult to open.", 
    "this is a modern style and easy organized table. the color is easy to match furniture.", 
    "Liked the looks of this table at the web site, but ordered with some reservations based on my previous experience with online furniture orders. The table came nicely packaged with no damage. Assembly took 15 minutes. Despite being made in China, it is of high quality. Looked exactly the same as at Overstock web site. The minor complaint is that the drawers are not very easy to slide because the sliding track is made of wood or some particle board, but it really doesn't bother me. You can scrub the tracks with a stick of soap to lubricate it if you wish. Would buy again.", 
    "Had to glue legs on because screws were stripped. Laminate around side had a crack.******* quality furniture.", 
    "THis is a decent table , really easy to set up. It looks nice and very functional ! Great for the price !", 
    "The walnut laminate is a cool tone in the black/grey/brown family. Love the storage and the style. Compliments my black leather sofa so well. Put it together myself.", 
    "The only down side is that it is hard to open/close the side drawers. Also keep in mind the top is a bit less shiny than it is shown on the picture. I am very happy with the design.", 
    "This coffee table arrived well packaged, no damages at all. Assembly was a breeze, you just have to screw on the legs. The hardest part was to get the end caps on the legs to go in :) The finish on the table is great; the drawers are finished more glossy than the top. Drawers are nice and deep. I'm sure I will enjoy this table for years to come. Great value for the money, and excellent build quality.", 
    "This table seems to be very high quality, put together easily, just put on legs. Looks great in my midcentury design living space.", 
    "Beautiful table. Larger than imagined. Nice to have a place to hide things like remotes and coasters. Drawers are a plus. Easy to match other room decor too", 
    "Good quality and unique looking coffee table. Side drawers are practical for remote controls.", 
    "This looks exactly as pictured. The side drawers are a bit shinier than the top of the table, but I am the only one who seams to notice. If you are going for that \"Mod\" or \"Mad Men\" style for your living room - This piece will set it off. Almost everyone who enters our living room comment on the coffee table and how it looks like it belongs in Mad Men. There are drawers on both sides (I thought it would only be one) and are very functional/wide for tons of storage. We love this table. I dinged it one star because the side drawers and top do not match up in sheen and because the faux-wood vinyl is very clearly vinyl and cheapens the overall look, slightly. Despite that, I would def. buy again, love.", 
    "This is a great table. The assembly was super easy (attach legs). The only cheap part was the \"floor of the drawers\" - its pretty thin and flimsy. However, this part doesn't show and its solid enough to store things inside. The outside of the table is superior. It is SOLID and attractive. Well made outside of the drawer bottoms. I'd buy it again.", 
    "Love this coffee table also loved that it came preassembled besides the legs. Love the drawers perfect for all the remotes controllers and everything else. matches the pictures perfectly.", 
    "Overall very happy with this table, a little concerned about the quality of the material holding up but so far seems very sturdy and love the design!", 
    "This is a really great looking coffee table. I have a pretty traditional couch, mid-century chairs, and a fresh looking rug, and I think it mixes the three very well. It's super functional as well, with the storage drawers and open area. We keep all the things in it that normally get lost - extra keys, sunglasses, chargers, etc. The finish is very obviously NOT real wood, but that goes along with the mid-century look (and price). While ours is still looking okay after a month, I fear that the veneer on top will scratch easily, so I wouldn't recommend this for a house with kids. Also, I\"m not sure if the description mentioned this, but the sides (rounded part) are glossy while the top is matte. All in all, we're very happy with the purchase. It might not last forever, but for the price it's something we'll enjoy for a while!", 
    "Took only minutes to assemble & fits our modern decorating perfectly. The drawers on the side are a little stiff (tight) to pull out...just have to make sure I'm not pushing on the top while pulling. Otherwise, great table", 
    "Love the new table, a little lower than anticipated but other than that a great addition to our living room", 
    "Use a lot of coasters, and wipe up fluid quickly, as this is an mdf/veneer finish that will bubble if liquid is allowed to seep through. The drawers could use some wax for smoother opening and closing. Easy assembly, and the color goes with a lot of different decors. Overall a good buy.", 
    "This is a great table. Could not have been easier to assemble (just screw the legs in place). Like other reviews have said, the drawers are a bit tough to open and close, but its no biggie. It's a slick looking table with nice amount of storage at a great price!!", 
    "Perfect for cozy den with a fair size sectional. Very sleek lines and round edges help manuver around. Overall I am very happy with this purchase.", 
    "Great design, easy to assembly, very quick delivery. I like it very much.", 
    "The drawers are a little too hard to open-you really have to pull hard & be exactly in front of the drawer to get it open. That is disappointing because the look fits in with the modern look of my home. The table came fully assembled with the exception of the legs needing to be screwed in, so there's no way to loosen them up. Plus it's a fit issue I think- they are a little too wide for the slot.", 
    "I purchased this table because of the storage it provides and which I desperately need. However, the drawers are very difficult to pull out. I tried some wax on the tracks, but that did not help. Hopefully this will improve over time. Other than that, product was as expected.", 
    "This is kind of a fun table that for us was ruined by the legs. They just don't go and make the table look really cheap. They just look like cheap, shiny, not-even-close-to -chrome-but-something-way-cheaper-looking. We sent it back.", 
    "Very easy to assemble. It is heavy but not so heavy that you can not move it. the sides that pull out are a high gloss but the top is not and seems to be some sort of paper. We will see how it holds up. It is a nice coffe table height. Not to tall and is only 40\" long. So if you have a smaller couch or room it fits nicely. Most are so large these days. The modern retro look is awesome with lovely clean line. A- only due to the finishes use in the table top.", 
    "Very simple to put together and took all of 10mins!", 
    "Good..the table top (walnut veneer) is a bit inexpensive looking--in that it looks just like walnut veneer as the site says. I was hoping it might look a little more authentic, but it matches the description, and the price, so I feel I received what I paid for...I may paint the top and call it my son's play table...he could set his trains up on it and store them in the drawers. The metal legs are real shiny. Might look nicer if they were a little more matte. But overall, I feel I got what I paid for.", 
    "I'm happy with my purchase, because it looks stylish and was affordable. That said, it's quality is only so so. The description is accurate - it's MDF and veneer (though the veneer might be vinyl or plastic instead of a wood veneer). The table surface's veneer, its thickness, and its corner radius all make me think of the school desks of my youth. I'm happy with the trade-off. If style and price are more important than having a rock-solid and elegant piece, then go for it.", 
    "This is a very functional but not particularly beautiful coffee table. It is a little darker and bit more fake looking than I expected from the photos. It went together easily - all parts fit well. It's very sturdy and not terribly heavy so it's easy to move around. I like all the storage space.", 
    "The item was received in well preserved packaging, looks exactly like in picture", 
    "table felt flimsy and the fake wood was dull and not 60ish looking like you would expect. overstock let us return for a slight fee about 27 bucks. would not buy the table but will do business with overstock again", 
    "I'm really happy with my table...its really cute and modern", 
    "Great looking piece. My only concern are the drawers are difficult to pull out and very small in comparison to other storage coffee tables. So I had to sacrifice storage for a trendy mid century modern look.", 
    "Table looks good, but the quality is lacking, spend more money to get something better", 
    "The drawers have a slightly different sheen on them relative to the rest of the table which makes it look a little chintzy. The drawers are very handy for storage, however, so I'll take function over form. The veneer also seems to be pretty cheap on the top, but I have yet to experience the peeling others have mentioned. Look, it is a budget coffee table that if it fits your decor will probably give you a solid couple of years so long as you don't treat it too poorly. I think it is one of the better looking tables you can get for the price, assembly was easy, and it is pretty sturdy. If you are ok with these limitations, it offers a good value."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Berkley-Modern-Coffee-Table/5328001/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5328001/Furniture-of-America-Berkley-Modern-Coffee-Table-2f6b855c-c893-4525-8ca2-9b28d90df1f0_600.jpg"
  ], 
  "description": "This Furniture of America Berkley wooden coffee table offers smooth\ncurved lines and shiny chrome legs for an ultra-modern update to\nyour living room. Removable pocket drawers on either side of this\nstorage coffee table make the perfect spots for magazines and\ndecor, or take them out and use them as serving trays when\nentertaining. Frame materials: Wood, MDF, veneer, chrome legsFinish: WalnutModern and innovative design at a suitable height for sofas\n  and sectionalsTwo (2) removable pocket drawer can double as a serving\n  trayOne (1) ample center storage for magazines and remotesSturdy brushed chrome legs for maximum stabilityDimensions: 43.35 inches wide x 22.95 inches deep x 16.14\n  inches highStyleContemporary, ModernMaterialChrome, MDF, Veneer, WoodTypeCoffee TablesFinishWalnut FinishShapeRectangle, RoundAssemblyAssembly RequiredColorBrownFurniture Frame MaterialWoodFurniture PatternStriped"
}