{
  "name": "Furniture_of_America_Kress_Glass_Insert_Mid-century_Style_Coffee_Table", 
  "price": "EUR 251.23", 
  "reviews": [
    "Very interesting table because of the unique style, and shape. It took about an hour to assemble but there was not trouble atl in doing so. While assembling the item, I was slowly admiring each and every pieces very good quality material. Everytime I'm in the living room I would find myself staring at it all the time, because it looks so nice. This is a very good investment on my end, good quality and low price.", 
    "I bought this coffee table after looking at many pictures of other tables on different websites. I love the modern look of this coffee table and it met all my expectations. The price was pretty good too. It was easy to assemble. You just have to be patient. (It does take some time.) I love how clean the table looks once it is put together. I would highly recommend this item and the fact that it arrived at my house within 2 days was the best part:)", 
    "i received my order within 3 days after purchasing, which is great. i assembled the item which took me about 45 minutes, and it was easy to do. The quality is amazn, very sturdy and heavy table which tells me all materials are strong and solid. The price is also great, very affordable. Overall, I'm happy with my purchase.", 
    "Great coffee table of newly re-modeled livingroom. Fast shipping, easy installation, and very good quality coffee table, I would recommend it to nayone.", 
    "I can't stop looking at my coffee table even since I got it, it's so nice. It was easy to assemble, and the quality is more than what i thought it was going to be, is better. Very sturdy, and the color and style is gorgeous. Best service experience in purchasing as well and so was the shipping, very nice quick service it arrived in perfect condition.", 
    "Size: After reading several reviews, I feared that that the table would seem too short for my couch and other furniture. Luckily everything fit together nicely and the piece goes very well with my modern living room decor. Quality: Item was very carefully packed within several layers of styrofoam and other boxes. I've had issues with furniture by mail in the past, and luckily that was not at all the case here. For a coffee table, it is very heavy! I like how sturdy and weighted all the pieces are and hope that will ensure its longevity. Assembly: (Disclaimer: I don't know if there are alternate types of directions out there so be sure to review yours before following this advice. I am basing these tips on the directions I received) Overall, the directions are quite detailed and for the most part perfectly describe how you should put the table together, however I disagree with two steps. Here's what I recommend to make things easier... Step 3: In spite of the diagram, connect part H to part B FIRST, before dealing with parts G,K, and F. Otherwise you will be forced to backtrack, or will have to find yourself a teeny screwdriver as you'll have minimal room to maneuver. Steps 6 and 7: I would recommend attaching the doorhinges and door panel before completion of Step 5 (before attaching Panel C to what will be the storage drawer). Again, the issue here is that you'll have a very confined space and will be unable to use a standard size screwdriver because of it.", 
    "This table is very nice and good quality. It's so pretty and I love the design of the whole thing. I get lots of compliments and raves from all my friends and family, they thinks it's very cute. They couldn't believe that I didn't spend very much for the quality and style that it has, it's incredible. I wouldn't trade this table with any other table, this one is just perfect.", 
    "Great looking table, very unique! I ordered my table and it arrived in a matter of days. It was very easy to put together and i get tons of commpliments on it. Very happy with the purchase and so far the table is holding up great.", 
    "I'm so impress of the unique style that this coffee table has, is something I've never seen before. I love it! Great style, great quality, and easy set up which is my favorite because I hate to assemble things but this one was easy. I like the white color coffee table which goes with everything and again the style, it's great and out of this world!", 
    "I've had this assembled for a few weeks, and I'm struck by a few things. One-- its design. It really is a good looking table. Clean, modern lines, sturdy. Sometimes I also notice the veneer is similar to what you'd find at a certain Sweedish chain of put-together-yourself furniture: i.e., fake looking. It's not bad. And for the price, much better quality. I use this as my TV entertainment center, and it works great. I have a tube table radio that fits PERFECTLY into the cut-out. It looks like the two were made for each other. Overstock shipped it in no time, although UPS took a while to get it here. Assembly was involved, but not impossible. Overall, I'd buy this again in a heartbeat.", 
    "This table is incredible, so nice in style and the quality of the furniture is good. My boyfriend and I assembled it and it was pretty easy. It comes with picture instructions that helps you a lot when it comes to assembling the coffee table. But overall, I'm very happy with my tabke, it has that sleek look and the very sturdy. I remebering buying it and in the same week it was left on my porch by UPS in perfect condition.", 
    "Beautiful coffee table and so unique in style. It didn't cost much, easy to assemble and very sturdy. I get a lot of great comments on the table, and I told them I got at Overstock.com. I think even one of my friends got one, and I know that she'll be happy with it because I am.", 
    "The design of this table is nice, but the laminate veneer is very cheap. Very poor quality finish and laminate. This piece should be about half the price or more as the price at $**** is far too excessive for a table of this quality. Scratches will appear easily as there is a plastic coating over the venner that will easily wear. I am a faithful and consistent buyer of OS.com products, but this one should be avoided. Very unsatisfied.", 
    "We went with the white color...we wanted something that would stand out. It was a great choice. The brown on the bottom matches the \"walnut\" colored things we have from Ikea. The glass is nice and a lot thicker than I thought it would be. The part under the glass is so cute! It really looks just like the pictures. Its much harder to put together than I thought. Theres about 100 screws and little pieces. The directions are pretty easy to follow though, and with 2 people it wasn't that bad. Overall a really good buy!", 
    "I love the design and the body of the coffee table. The shape is something I've never seen before, I like it! The white color is what I chose to get and I love how it stands out in the room, it's perfect. The storage space was designed very well with the open panel access to the storage of the table and the glass that gives a nice touch to the table. It's also very sturdy and the quality of the table in color, and materials are great. Overall I love the table and the fast service that overstock provided in getting the table over to me asap. I highly recommend the table, it's great!", 
    "These look just like they look on the website images. I was concerned they might not be sturdy, but they are totally sturdy and have a really nice weight to them. SIMPLE to put together. Took me a very long time to decide which of the two colors to buy since they're both nice, but finally went for the all walnut to fit with my dining table. The actual product looks lovely as it does on site! I love this coffee table and the little compartment is a simple yet unique functional storage. Love it!", 
    "Item was shipped promptly and arrived in great shape. Assembly took just under 2 hours for myself, mainly due to the tricky hand-screws. The only problem I had with the assembly is the order in which you are requested to piece the actual door for the desk. Should be done earlier IMO. In terms of quality, the brown is a nice walnut color, not the cherry I thought it would be which is perfect. The brown wood is authentic while the white is particle. The table has a very low profile and gives the atmosphere a modern yet an almost oriental feel. Great size and plenty of room for any accent to be placed on top. Extremely sturdy, really compliments the blue\\black\\white I have going on in my apartment. Great buy, worth the price; actually I would go as far as to say its a steal when you talk about price. Satisfied with my purchase with overstock once again. Such a beautiful table.", 
    "WOW! This affordable piece nailed my midcentury style to perfection. The size and height are ideal in front of my standard size sofa and I love that I can store a few books or magazines out of sight via the side storage. The white + walnut combination really pops and my hubby had no trouble putting the piece together. Occasionally the metal pieces holding up the glass insert have loosened a bit - they are not permanent fixtures and I may use a bit of wood glue to keep them in place. This is not a big issue. I spent weeks scouring local thrift shops for the perfect coffee table and then turned to the internet. This piece of furniture is exactly what I wanted, and it was super affordable as well. Win - Win - Win!", 
    "Nice addition to my furniture, all mesh well together. Good looking funiture and great quality wood and color. Very easy set up and very sturdy, just the coffee table that I'm looking for. Sleek with quality.", 
    "Bought this for my son's new apartment. It looks great! Expensive look for the price. Love Overstock!!", 
    "It is almost all together. It looks good. I just moved and it took time to get to it.", 
    "I'm veryhappy with my purchase on this coffee table. I'm looking at right now and I love it so much. So nice and very modern in style and something I've never seen before when it comes to coffee table. I'm enjoying it so much. The shipping was fast, assembly, easy!, and all the way with great quality.", 
    "It arrived at my door step in 3 days and the assembly only took me 20 minutes. I love the style of my coffee table, the very detailed shapes and the touch of glass looks great in the middle plus the extra compartment underneath the glass is the extra special touch. I love the table it goes very well my with other furniture.", 
    "I love my new coffee table. It is very low to the ground. So if you are not looking for a low to the ground modern coffee table then this is not for you!", 
    "I bought the white table, it gives my living room a modern feel. The only down side is that the suction is small and not strong enough to hold the glass in place, so it sleeps. Other then that I luv it and I get compliments on this modern white table", 
    "This is a very cool piece of furniture and, in my opinion, absolutely worth buying. I was hunting for a new coffee table with a little more personality than the standard rectangle it was replacing and I fell in love with the funky angles and stylish glass insert. I knew it was going to be flatpack-style (\"Ikea-style\") furniture, but I was pleasantly surprised at how solid and well-balanced it is when assembled. It isn't obvious from the pictures, but EVERYTHING is anchored together in at least 3 places, usually with a combination of wooden pegs (secured with supplied wood glue) and screws. The load-bearing pieces are secured with allen (hexagonal) wood screws in multiple places, as well. The legs seem small and dainty but after assembling this, I'm not worried at all about collapse. I could probably dance on this thing (as long as I don't step on the glass!). Now, it's worth pointing out that this is a very labor-intensive piece to assemble. I'm an experienced assembler-slash-flatpack-junkie and this took me almost 2 hours to do with no interruptions. I can imagine this taking someone less-experienced anywhere from 3 to 6 hours (or longer!) to assemble. The instructions are thorough and you can tell that they really want you to feel like you can build this yourself -- which I know you can! The instructions (which are careful diagrams without words) come in a stapled packet of 8.5\" x 11\" paper and I strongly recommend that you carefully tear the \"parts list\" sheet from the packet and lay it next to the rest of the packet while you assemble and turn pages. Some of the screws look similar in the diagrams and having the list right in front of you will cut down immensely on the time you spend rooting for the right piece. The pilot holes in my table were all drilled properly and I didn't have any difficulty lining anything up or tightening any screws. You'll probably end the project thinking that your life will be complete if you never see another allen-head wood screw again, but the result is worth the elbow-grease expense. A couple of tips I gleaned from my experience: - Be VERY careful unpacking the box. The pieces are laminated wood and they seem to do a lot of damage to each other when they bump edges or slide around. They're durable when assembled, though. - Unpack everything and line it up so you can easily see the part-number stickers. Also, try to do this in a large, open room, preferably with a hard floor (kitchen, garage, etc.). Soft or squishy floors will ruin your angles and make the project much harder. - Use a manual Phillips-head screw driver, not an electric one. (It's the one that looks like a medical cross if you look down the tip. If you don't have one, get one! It's a vital tool for household projects.) - Guide all of the screws using your free hand. Sometimes they'll try to go in at a slight angle, which can be corrected if you catch it early. - If you find that you can't quite seat the glass once you've assembled the wooden parts, try my little trick. Seat the glass as closely as you can, and then lift the table FROM BELOW directly in the center of the \"pocket\" where the glass sits. Don't lift from the ends! Because the table is so heavy, it will bend ever so slightly and the glass should drop perfectly into place. Gently set it back down and your glass is secure! Please don't try this if your glass is too large by more than a hair or two. That means that something isn't in the right place and it will probably shatter! - THIS IS HEAVY. Don't injure your back! Ask someone to help you if you can't easily lift it. Good luck on your assembly and enjoy your table!", 
    "This is an **** flat packed table for a ****price. Self assembly (lots of it) was required - which is not a problem, but the cut and fit of the pieces is an issue: The glass element did not fit, and the hinges for the door have already come off after a week of use due to the screws being too small, and the door - no mater how much I configure and fiddle, will not sit flush with the rest of it. If you DO decide to buy this product, please note this it will save you 30 - 40 mins of torture (it will make sense when it arrives): Screw the hinges onto the body of the table BEFORE joining the main top and bottom sections together.", 
    "This table is absolutely adorable! We've received so many compliments. It works very well with our 1950's modern furniture. Friends assume it is vintage and costly. It is very sturdy and substantial - very happy with this purchase!", 
    "This is a vey cute table. I bought it for the kids room and its the perfect height for them to do work and sit on the floor. I put the table together by myself and im far from being handy in anyway, but hey I had no choice. It took me a about an hour and a half. Pretty good I think. Its held put great considering My kids use it everyday to do work and eat snacks on. I pretty happy with the Item and will continue using Overstock.", 
    "After 2 months of light use, one of the legs collapsed with 2 glasses of red wine on the table. It ruined my sheepskin rug, and after taking the table to a professional furniture repair shop, i was told that because of the poor quality of the table, there is basically no way for me to repair it without visible brackets. I tried to get ANY reimbursement or credit from Overstock.com, but no there was absolutely no accountability on their end. Many excuses, though. So don't buy the table. The couch that I bought was also very low-quality, sagging in the middle, within 2 months as well. Both of these items were used VERY lightly- no children pets, etc, and I have a small frame (100lbs) so my use alone does not warrant the demise of these items. So the moral of the story is: if your are going to USE the furniture, be SURE about the quality before you buy - because the \"return policy\" definitely favors overstock.com, and NOT the customer.", 
    "So nice to have a white coffee table, it stands out a lot with my black sofa set. Great size and very sturdy. The price is great and it's no trouble at all assembling the table, easy and fast, jsut like the shipping. Great addition to my livingroom. I highly recommend it, I love it!", 
    "Well it did not take that long to get here which was fabulous. I have ordered a lot off of Overstock and I have yet to be disappointed. This table looks great, I cannot imagine anything for this price of better style and quality. Very modern looking and like other people have stated it is very low.. which I wanted. It did take about two hours for me to put together and I am pretty decent handy man. The directions are a little obscure but they give you enough to be able to assemble. Over all I cannot say enough positive things about this purchase.", 
    "The deisgn of my coffee table is incredible, so nice and uniquely made. Arrived in just a few days, fast and so was the assembly of the coffee table. I like the table because it goes with everything and the quality is great!", 
    "The table arrived within three days but Overstock shipped the wrong color so, no problem, Overstock shipped out the correct table the next day and emailed a label to ship the other one back. No real drama so far. The correct table arrived in another three days and there are A LOT of parts and no clear instructions as to what screws go where so, it's like putting a jigsaw puzzle together. It is a one man job and took about an afternoon to make sure all the parts went together like they should. Once put together, the table is nice, similar in quality to the that big box Swedish store but, the table is very low ..I mean REALLY low so it may be too short for most traditional sofas. Be sure it will be suitable in your living room before ordering!", 
    "Putting it together was a little time consuming, but not any different from most assembly-required products (like I%$@#). Once together, it's worth the effort--it's pleasant to look at, functional and pretty sturdy. Then again, we don't have rough kids or animals that would really abuse it (the glass section could be an issue in more rambunctious households), but I think it would work for most people who like the modern or midcentury modern aesthetics.", 
    "This product is for looks only. I love the way it looks but the quality is terrible. After putting a wet glass of water on it, there are now permanent rings from where the glass was sitting. The water goes through the cheap white laminate to the composite core and bubbles. Also the white top sratches of easy when scrubbed. There is permanent damage and bubbling of the white top after I sprayed it with an all purpose countertop cleaner even though I wiped it dry within 5 minutes. Also the laminate wood on three of the table legs are peeling off. I've only had the product for 6 months or so. Very disappointing product.", 
    "I was astonish by the way it's designed and the shape of the table. Uniquely designed and well made furniture. You would think that it's difficult to assembly but it was quite easy and everything went together just smoothly. The quality of the wood is nice and very thick and solid. My table is one of the greatest.", 
    "What a coooool coffee table! We have already gotten so many compliments on it! The storage is perfect and the glass opening looks great with a photo album, magazines, or books. We love how modern and vintage it looks at the same time. Thanks for sending so quickly too!.", 
    "Great looking table! The quality is really decent, but I am concerned about the white part bubbling if it were to get wet so be sure to always use a coaster! The magnet on the side drawer is a bit weak and sometimes it takes a few tries to get it closed, but overall, it is a great clean-looking coffee table.", 
    "I highly recommend this coffee table it is a real show stopper. It is so different looking then most coffee tables. The only thing you should know it is very low. But it looks great in front of a modern or mid century couch. Also very easy to put together.", 
    "Very happy with this table. It looks great with my white modern leather furniture. Had a problem with the original table being damaged. Overstock was very responsive and immediately replaced the table. Very happy with the service and my table.", 
    "This table is streamlined, and fits perfectly in my living area.", 
    "The table was not the easiest thing to put together, and the door won't stay closed. The parts all seem to be the correct size, so no issue there, but I am not thrilled about the look of the faux veneer. Not worth disassembling and sending back, but I will probably only keep it until I find something nicer.", 
    "Nice solid table, just as slick looking as pictured. Assembly took about 2 hours.", 
    "This is an ok piece, but a tiny chip was in the top where the glass butts up to it, so that sucks. Not worth the effort to send it back. You will need a stubby phillips to put it together to get in the small spaces. Fairly solid. You could also use this without the glass if wanted. It is just laminate though, so you must use coasters or it will ruin the top of the finish, or you could place your glass on the glass.", 
    "This is not a sharp looking table - but it suits the purpose. It is sturdy, but the look of it is cheap.", 
    "this was perfect has storage, a glass insert so i can show off trinkets, but i ordered the walnut and it looks aweful that the large silver screws show against the brown. it isnt very heavy so the quality doesnt seem that great.", 
    "very good.....just as stated will go with most homes", 
    "I recieved this table a few weeks ago. I'd gotten several other things from Overstock (kinda doing the mail order living room) and they were all very good quality, attractive and easy to put together. This monster, on the other hand, had a LOT of fasteners and even required wood glue. Maybe I was just feeling lazy, but when I opened the box and saw all those pieces, I put the thing right back in the box and went to bed. I invited friends to dinner a few nights later and cajoled my friend's husband into assembling it. And he is METICULOUS, but the door is still a little off. That being said, it is very pretty, and it appears to be sturdy. And it certainly supports the mid-century vibe I am going for.", 
    "The coffee table is very nice looking. We were apprehensive about ordering online, but happy with the outcome. It did take my husband a coupe of hours to put it together. But after some sweat and cursing, it was together and we really like it!", 
    "Looks different than anything I've seen so I like it, and friends that have seen it like it as well. But I got it for that little side storage and the magnets don't hold the door shut. So if you touch the top of the table the door slams open, and it's started to damage the door and the legs it hits. We've tried different things, but the door won't stay shut so now we have to keep it flopped open. Kind of disappointed.", 
    "We've only just finished putting it together. It took about 1.5 hrs with a cordless drill. It looks ok from a distance but up close the laminate has lifted from the edges and I'm sure it won't be long before it chips and looks worse. The walnut color is really nice and if the table had a high gloss finish it, would be perfect and probably not look as cheap. The design of this piece is great but you get what you pay for!", 
    "This is not what I expected, it is lighter and has a cheaper quality than pictured. Overall it is nice but the wood it is made from is plywood and very cheap. It easily gets rings on it and not very high quality.", 
    "just got this table 2 days ago. first of all i somehow thought that the white parts of the table was supposed to be glossy, but turns out it was covered with very cheap meterial. i spilled water on the table and didn't notice it for a while. when i noticed the spill, i wiped it out with papertowel and the table looked like a paper soaked in water... i'm just gonna throw it out and get a different one, a good one. it took me 2 hrs to assemble it btw", 
    "Disappointed, this looked really stylish online & was excited for it to arrive. The wood color looks much richer and better quality online, in person the wood grain looks really dull, flat and seems like a low grade, poor quality veneer. Maybe the High gloss white would've been better, but it was not what I was expecting to get. Ontop of that it arrived missing the pieces to hold the glass in. Returned... & still searching for a coffee table...", 
    "This table wasn't exactly the quickest thing to assemble. My husband and I did it together and it took us about an hour and a half (keep in mind we are not incredibly handy). There were probably a few pieces that could have fit together a little better, but once the whole thing is assembled, you really don't notice. The table adds a nice modern touch to our already eclectic living room. The table is pretty low to the ground, but it's nice that way. So far, everyone that has come over has loved it. For the price and the low cost of shipping, I don't think we could have found a comparable table from anywhere else that we like as much.", 
    "When I first opened the box, I actually considered sending it back because I was disappointed at how grey the walnut color appeared. I was also a little disappointed in the quality, but my husband convinced me to try it out and so we put it together (which was quite easy) and now we just love it. So glad I didn't send it back...it is super functional but stylish and modern. Looks great in our family room and we are so excited to have a little storage place to put our remotes to get them out of the way!!! This is a great piece!!!", 
    "I am super happy with the purchase of this coffee table. I recently moved into a new apartment home in Brooklyn and wanted my new furniture to match the modern new space I have. This coffee table is a great piece to add to this look, the shape and combination of the glass, white and brown gives this a very special modern look. Assembly was not hard either, took me a little over an hour and the price was great. Smooth transaction once again with Overstock.", 
    "I love the look of this table the design and matted top is very unique. I got the white one and placed it in my screen room. I love the way it makes the room look and feel. The table was not bad at all to put together but did take a bit of time but not hard work. The item came fast and there were no damages to the item. since i guess it was packed good. Im happy with the table and would recommend. My friends and family have all complimented me on the table and always ask where I got it from, and I dont want to tell them..haha.", 
    "Love this table It's so nice! I got my table with in days of ordering it and the assembly was very easy for such unique coffee table. The price was great couldnt pass it up. Wasnt looking forward on spending a lot of money on a new coffee table and this table was less than what I was expecting to spend which great in my pocket. Good and sturdy table and it stands out with all my other furniture in the house. I get a lot of compliments from friends and family, so i know I did great.", 
    "This table is amazing! It's so nice! Just imagine I got mine in less than 3 days, and the assembly was a breeze for such unique coffee table. The price is great! I didn't want to spend a lot of money on a new coffee table and for this table it was less than what I was expecting to spend which great in my pocket. Good and sturdy table and it stands out with all my other furniture in the house. I get a lot of compliments from friends and family, so i know I did great.", 
    "This would be a great table for a young couple starting out. It's design is cool and offers storage for remotes, magazines, etc. but the quality just wasn't what I was expecting...but for the price...I should have known!", 
    "Only product I have ever purchased from Overstock that I haven't been happy with. It is really low too -", 
    "This is a cute little table but it sits VERY low and is much smaller than I anticipated (so be sure to pay attention to the dimensions). I have an \"L\" shaped sectional and it's a tad small but functional and fits well with the mid century modern look I was trying to achieve.", 
    "Looks great in my home! Great value, price", 
    "The manufacturer give a one to five rating of how difficult this would be to assemble, with the one being easy and the five being difficult. This table is rated a four, which I guess means really hard, and it did live up to this rating. For me. This was compounded because I received the all walnut, rather than the white/walnut version I had ordered. Customer service was willing to arrange pickup, but there was no way I could re-assemble the pieces to get back into the shipping box. Instead, I was issued a $* credit, and I decided to paint it myself. I used an appliance epoxy in a light biscuit color and took my time and it turned out really nice. Once painted, assembled and put in place it is just what I wanted. Furniture of America makes very good RTA furniture and I will order more products from them in the future.", 
    "I didn't love it. I use it as a shoe rack in my closet.", 
    "Table is mainly for looks. Don't expect high quality.", 
    "Took 2 1/2 hours to assemble. Directions are logical. Difficult to screw in small screws in storage section as there is very little space. I would place magnetized door and hinges on before assembling white top to wood-look bottom.", 
    "Very nice and great price!", 
    "Bought as a birthday gift for my daughter and she loves it!", 
    "Not a high end item, but looks clean. Used in my office waiting room, and it was fine for that. Probably wouldn't want in my house", 
    "This coffee table is very modern, materials maybe not the best, but the glass n the design, it just look great.", 
    "I am in love with the design of this table. Unfortunately, the quality is just not there, especially for the price. The top piece was damaged upon opening, I was so disappointed because I really wanted it to work. On a more positive note, Overstock has great customer service and helped me resolve my issue!", 
    "the table looks good, smaller than expected.....but major issue is that seems and edges don't align properly.", 
    "Assembled Easily.Actual table is only 12\" high. very short. Difficult to read this in the photo.", 
    "This table was somewhat complicated to put together. The allen wrench did not last through the last screw. Also, it is a sticker on the wood. Nevertheless, it has nice style. We think it is a good placeholder until we find something more substantial.", 
    "This is s small retro modern table! Perfect fit in my house.. Good quality and easy enough to put together!!", 
    "It is such a high quality table! Keep in mind it is very low to the ground. I love the look.", 
    "The fake wood looks better than expected. And, the hidden compartment is pretty darn cool. Looks really sharp, especially for the price.", 
    "Does not look like the picture - the table is very cheaply made. Would not recommend this product.", 
    "we bought this to stage an apartment to be sold. It looked great - but that's about it. It's really heavy, it's obviously cheap, and it doesn't hold up well. It's not the best quality but it does look really great if you're not going to actually use it.", 
    "And a big area to put it together. Takes a while but looks great", 
    "Very visible laminate makes the table look cheap when put together. It is still a nice and solid/heavy table.", 
    "It's a beautiful piece. We love it.", 
    "modern and very sturdy. well made", 
    "Putting the table together was easier it will take some time. But i don't like the looks of the table", 
    "poor quality build...the white is not gloss but matte and has a very thin veneer. product was returned once we opened it, very unfortunate because it is unique looking but lacking in quality.", 
    "Exactly as pictured. Very elegant and sturdy.", 
    "This thing along with many other items from overstock are a NIGHTMARE to put together. This table was soooooooo low i damn near had to sit on the floor to really use it", 
    "Some exposed screws, but it's not noticeable to people who aren't looking.", 
    "Good coffee table. looks really nice. but a huge pain to assemble. took me over 3 hours", 
    "It's a little too obvious that it is not made of wood. Other than that, it's a nice style. We ended up returning it though and will look for one that is a little bit better quality. Definitely not a bad choice for its price.", 
    "The design is great, but it's a little small & short. Make sure you check measurements for height & length! Also, its not super quality, but makes a small space look crisp.", 
    "really nice piece and good quality. Sturdy and easy to assemble", 
    "Within five minutes of owning it, noticed that the very thin, very cheap veneer had started peeling off from the area beneath the edge of the glass top. Very low quality materials, manufacturing and quality control. I do NOT recommend this product.", 
    "Took Matt a while to put together. Other than that, this piece compliments my contemporary living room design well.", 
    "My husband and I have been searching YEARS for the perfect coffee table to replace our 15+ year old worn up one. We wanted it to be rectangle for more space around our furniture set up (last one was square), have drawers still for remote storage while being a nice, modern style. You'd think that would be easy to find with only 3 requirement factors and thousands of tables out there....but no! Until I found this one on Overstock.com. It was what we have been looking for on every level....and at under $$$ is a \"must-grab-it-and-run\" deal. It was easy for the hubby to assemble (a few hours, but he took his time while watching a baseball game) and we are very happy with the quality. So stylish, yet since it has a mid-century flair, will feel timeless for years to come. The other bonus is that the hubby would constantly hit his shin on the old table *ouch*. But he noticed quickly with this one, due to the angle of the two sides, he doesn't do that any more. And boy is he happy about that! A funny side note - our little runt cat, loves the glass cut out area and will lay in there being....cute. (I'd post a pic of this if pic uploads were allowed.) We love this table so much we are considering getting it also for the father-in-law apt.", 
    "When I opened the assembly instructions and saw that it was rated a 4 out of 5 on the difficulty scale I was a little worries. The assembly wasn't that hard, but it was time consuming. Totally worth it though in the end. The table looks awesome and gets great comments from everyone who sees it. The build quality is top notch and we highly recommend it.", 
    "Great addition to the room. Easily assembled. Quality grade materials for the money.", 
    "The unique design of this table was what initially sold me - it's reminiscent of mid century Danish furniture, but of course is missing the huge price tag. The cubby on one of the sides is pretty clever and keeps clutter off the top. At first I was afraid this table would take up a lot of room (I live in a studio apartment), but it's surprisingly compact. I like that it's low to the ground because the couches I have are small. It doesn't stand out too much and make the room look cluttered. While I agree with others' comments about what a pain this is to put together, the exposed bolts in the legs don't bother me. In fact I didn't even notice them until reading the comments. As for not being able to set cold drinks onto the laminated surface, you wouldn't do that with your expensive wood mid-century table, either! Swipe some coasters from a bar or something! Overall: great table for a small space. Probably not a good idea if you have kids or lots of parties.", 
    "This table is lovely. it assembles fairly easy with two people. The directions were hard to understand since ours came with all the parts unlabeled... so it was a bit of a puzzle but we got it together nonetheless. You get what you pay for on overstock- so there is a reason why this didn't cost an arm and two legs- most of it is nicely covered particle board but the bottom is very heavy and seems to be a covered walnut or something. ONE word of advice: if you have children don't even bother buying this. and make SURE you screw in the swinging drawer BEFORE you attach the smaller white piece onto the table. Trying to screw inside the drawer when it was already assembled like the directions say was a nightmare. It looks amazing, but is hard to move so build it where you'll keep it.", 
    "but it's very short. Although they give measurements, I thought (foolishly) that the height measurement was of the legs only. But the table top really does sit only about one foot off the floor. There are many pieces to assemble, but my husband (who's not terribly handy) was easily able to do it.", 
    "Alot of work to assemble.", 
    "I love the design of this table but for price it cost, didn't expect the white surface of this table is made out of PAPER! Come on, put some cheap wood on it and you'd still make money instead of paper. Be careful when you place your drink on the white surface, it'll bubble up.", 
    "The finitions are not perfect. Quality is good but not excellent. The height is very low. But nice design.", 
    "We received the table by UPS. The table was damaged on of the corners, like the box had been dropped or something. Not very happy about this, because seems that every time UPS Delivers something to our office, the items are damaged in some way or the box is and sometimes we get lucky that the item(s) aren't broken/damaged. We didn't want to hassle returning the item, so we're keeping it. We bent the broken corner to try and match it to the rest of the table and we are going to try and attempt to color where it's damaged with a brown marker and hope the damage won't be too noticeable. We were so excited to get this table too. It's a great looking table. If it weren't for the damage done to the table, we would've given a 5. It is sturdy built and has a retro look to it, which is what we are aiming for. All in all, the table is a very good buy.", 
    "This is not wood veneer, this is the cheapest thinnest plastic shelf paper printed in a wood pattern placed over press board. If the cat rubbed up against it the \"veneer\" covering could fall off.If this were covered in a real veneer wood, even a cheep wood stained to a walnut color it would be light-years better.", 
    "I bought this in the walnut finish based on the reviews and the pictures online. I was disappointed....the design is great, looks cool/modern. But the quality isn't good; the laminate peeled off with a few of the labeling stickers, the edges were peeling back and the 'wood' just looks cheap. Took about 1-1 1/2 hours to put together. Instructions were pretty straight forward. But it was all for nothing because I will probably use it as a TV stand in a guest room or get rid if it. It's just not a quality looking or sturdy piece to use as a main coffee table. I really wanted to love it but I was disappointed.", 
    "I bought two of these tables act as a bed side tables. When I got the first one together I noticed exposed screws that were not on the original picture. It was a big pain to deal with this. In the end they gave me a percentage off because there was no other way around it. I would have never ordered this table had I seen the screws exposed. It makes the table look very cheap.", 
    "Got this table last year it will not last more then year, cheap wood.", 
    "The instructions for the legs were wrong, the wooden dowels go in the 1st and 3rd holes not the middle. Also received 2 incorrect legs on the first ship but Overstock quickly sent correct ones. Takes awhile to build but looks nice when you are done.", 
    "The design of this coffee table is excellent. My only gripe is the quality of the lamination material. If you set a damp object (not wet; but damp) on the white lamination, it will begin to immediately de-laminate from the particle board sub-structure.", 
    "Overall very happy. Great looking coffee table. Solid. Only complaint is that for the price I would expect actual wood...not the weird highly polished heavy particle board that so much of modern furniture is made with nowadays.", 
    "This coffee table is modern looking and perfect if you don't have a big living room. It's set pretty low once it's all assembled. The quality is just as I expected, not cheap looking or feeling. The assembly instructions could be better but no problem putting it together in the end. It is true white so if you're looking to brighten up your room, this is a great choice for the money.", 
    "Perhaps, I didn't realize this in the photo, but the wood veneer panels are all almost identical, which produces a very fake looking wood veneer. The fake looking wood veneer in turn makes the table look 'cheap'. I've decided to disassemble, sand, prime and spray paint the panels to cover the wood veneer.", 
    "I was very excited to order this coffee table. Everyone had talked about how great it looked. When I received the product in the mail I was less than pleased. Assembly took forever and the wood looks cheap. Definitely not a long lasting piece of furniture. Looks like something you would find on sale at ****. It's a unique design but seriously lacking in quality.", 
    "the table is a little bit lower to the ground than i had imagined. it took my boyfriend and i about 40 mins to put together. it's definitely the kind of piece where you're better of putting it together with someone else. overall i like it and i think i got what i paid for.", 
    "I really liked the look of this coffee table online, but upon arrival, was very disappointed in the quality of the white laminate. We opened the box, and as soon as we inspected the laminate pieces, we were unhappy with the quality, so we didn't assemble it, but boxed it back up and returned it. Therefore, I can not comment on the quality or sturdiness of the assembled piece.", 
    "Love this table. Its very modern & trendy & looks like i paid a lot of money for it. Its very heavy & sturdy. My only complaint was it was hard to put together thanks to the instructions not being very easy to understand. I ended up having to have someone put it together for me because i coulndt figure it out. Once together though its a great table!", 
    "The color is accurate but don't be fooled, this is not real wood. Or even veneered wood. It is 100% pressed board with a printed veneer. Luckily, it is going in a casual & laid-back space or I would have had to send it back. If you know what you are getting and decide based on that, enjoy it. In my opinion, it needs some more, closer photos so that everyone can see the quality.", 
    "Well, it looks cool.. but not really useable... quality is kinda bad", 
    "Great modern design and functional shelf and hidden drawer. It took over an hour to put together. I was a little put off by the \"plastic\" surface (think of formica kitchen counter top), but overall I like the coffee table. If you are putting this together, screw in the legs first to the bottom panel BEFORE screwing the bottom panel on to the top/sides. This reversal in step cost me another 30 minutes. Invest in a hex drill bit because this table has only hex screws and it gave me blisters doing it by hand.", 
    "Took my husband about 1.5 hrs to assemble alone. As he was putting it together, he mentioned being unimpressed with the quality of the white, yet the wood part was pretty nice (ironically this is the part underneath that hardly gets noticed). He mentioned that it's worth about (***)...just a bit less than what we paid for it. Very attractive style - I would pay more for better quality though.", 
    "I have just graduated from college and am furnishing my first apartment. This piece is a great piece and I am constantly getting compliments on it. It's sturdy and unique. Not too hard to assemble either (I'm a 23 year old female). I would recommend this", 
    "The white laminate is glued to the particle board base, the edges are not nicely aligned and look frayed, it reminds me of my first home study desk. Pieces out of the box were scratched and damaged. It is a good starter coffee table for a college student with high end tastes.", 
    "Good quality coffee table, and suprisingly easy to assemble. Very easy manual to follow with step by step instructions, and it only took me about 20 mins. Quality is solid, and style is one of a kind. Price beats others out there, so affordable. I really enjoy my coffee table.", 
    "I LOVE how this coffee table looks, but hate the idea of anyone actually coming over to see it. It was a total pain to put together. The pieces are SO CHEAP OMG. The sides were half unglued when I got it, and the white laminate will be gone if a drop of water so much as touches it. This one had to go in the formal living room, and it's just for looking at.", 
    "The table is just what I was looking for! It matches the mid-century furniture in my apartment nicely and looks very unique. No one believes that I bought it at overstock as it looks like I picked it up in a little boutique. The table does take a little work to put together but the instructions are easy to follow.", 
    "The table looks great. It is a little low as other reviewers have said but it works very well with our couch - which is lower and modern looking. The white with the wood is very stylish. It really stands out and many people have commented on how nice it looks. Very pleased with the purchase. Not too tricky to put together - just read though the directions all the way before starting. The glass panel is fun to change out the book you have on display.", 
    "First of all, the design is very eclectic on its own. Such detailed craftsmanship and good quality materials was used. Fake wood or not, the quality is great. Delivery service was also great, arrived in 3 days. Assembling the coffee table was time consuming but easy to follow manual. I live the shape and the white high light the very detailed design of the coffee table. I will spread the word!", 
    "I put this table together, very easy, but it does take about 45 min. Love the look of this table for the price. Mitchell gold furniture has something similar for over 1000.00 . This table is a must buy !!!!! Love it", 
    "A nice table to have, it makes all your old fashion furniture look very modern with this piece of furniture in the center of it. IT makes everything look great, and it goes well with the rest of my antiques. Great shape, strong wood was used, and the style and design is very sexy and sleek. I'm very happy with my coffee table, I didn't have any hassle at all with this gorgeous table. This should be a highly recommended table, great price, great style, and most important, a very good quality.", 
    "I have a very nice, and very unique coffee table. I get a lot of compliments of its uniqueness and quality. When I tell friends and family how much I bought it for, they were very impressed of how bargain the price is. I told them where to buy and I think some are planning to do so. Why not, it's a good quality coffee table, and the style is in that 2012 modern style. I would recommend this to anyone, not just my frineds or my family.", 
    "I love the simplicity of the table but assembling was not so simple... Took me over an hour to assemble and the quality of the wood patterned laminate was poor. And, this sits way too low for our couch. I want to return the table but it's too much trouble. However, if you are looking for a cool looking cheap table, this will do.", 
    "Very pretty looking and sturdy. The directions were easy to follow. Though because of the various parts involved in this, did take a bit more time to build it than expected. The only issue would be the height (it's a bit shorter than I expected), the side door for the drawer isn't clasped quite as tight so can fall open on its own sometimes and the glass is only supported not tethered in.", 
    "Great looking piece of furniture. It arrived quickly and was easy for me to assemble. However, it is really a cheap piece of furniture. This table lasted a few months before i noticed the veneer starting to peal off. And if you get a drop of water on the table, clean it up asap, other wise it will damage the table top. I have little water bubbles on the top of mine. The veneer on the top of the table is thin and does not handle moisture very well. It's a moderately stable table. The legs are a week spot so be careful when moving the table around.", 
    "With little to no handyman skills I built this table myself. It does require what I later found out was a Philips head screwdriver. Make sure you have that. I did not give the product a 5 star rating because the scale was a bit weird. It has a very Ikea scale - low to the ground and on the smaller side. It looks stunning though. Gets the job done and it's less than $200.", 
    "What was disappointing about the long and complex assembly of the product was that in the end I was left with a very chintzy and cheap looking piece of furniture. It's a very cute design but the finished product looks like the cheap bits of screwed together fiberboard that it is. Very throw-away dorm-room quality stuff. I got the 'wood' version - maybe in white it doesn't look quite as tacky. I don't know what I was expecting for the money, but I regret that I didn't spend the money to buy real furniture. Live and learn.", 
    "Overall, I really like this table; problem is, one of the pieces don't quite fit (the end piece was cut too long). I've contacted customer service, so hopefully I'll be able to complete my table with a replacement piece, soon. Also, it sits really low to the ground. Just a little bit disappointed.", 
    "This coffee table looks great, but the glass portion is really problematic. It tends to fall out of place or shift. It also doesn't fit perfectly into the table and is slightly raised. Because of this, I always have to be careful about how I handle this table. I love the look, but would have preferred a less flimsy table.", 
    "Look of product is what made it attractive, but once received realized it was not the quality or look expected. All wood is particle board with cheap looking finish and imperfections. Somewhat difficult to put together. Price is high considering it is much poorer quality than other popular named brands using same materials.", 
    "the veneer on almost every piece was chipping or peeling at some point. the assembly took forever and with all the edges this piece has, many did not line up perfectly. Overall I am very disappointed with it", 
    "I purchased this 8 months ago for my family room, which serves as a gathering place every day, and the table went into the trash can today. The table is certainly very contemporary looking -- no doubt about that. It is very obviously laminate MDF; I don't think anyone could mistake it for anything else. So if you're looking for a real wood look, keep looking. It wasn't too terrible to put together. The compartments are nice. The glass top never seemed to stay put (the little suction cup pegs just weren't strong enough). Its demise was an irreparable broken leg. If I had it to do over again, I would have placed it in the living room, where I am certain it would have lasted longer (we don't entertain much). But would I purchase this same table again (given that I am now in the market for a new one)? No.", 
    "Have a lot of patience putting this together! The instructions aren't the best, I would recommend a \"dry run\" together before gluing the biscuit joints together. I would also be careful putting the pieces together, the venere will chip easy or lift, however you can always glue it back down. Very sturdy, I have had for about 5 months now and have no problems with it.", 
    "Design theme changed and this did not fit the new design so it was returned unopened.", 
    "Stylish table, but obviously made from cheap plastic-wood. I have the brown one- not sure if the white one would look less cheap. I live in a small apartment and I have to be very careful not to walk into the corners of this table-- they are sharp! I've cut my leg on a corner before. Also, with the side cubby-- The door to it swings down and is a bit heavy (considering) and sometimes comes crashing down without me opening it. I have had it swing down on my feet and that hurts!", 
    "Love the look of this table. Fit in nicely with some of my pricier mid century pieces. Hate to say it, but the MDF material is really poor quality underneath the veneer, though. I'm back to review this after about a year with it. The angled legs are veneer covered MDF with screws sunk into it. One kid sits on the corner of the coffee table for 2 seconds and the leg folds in the direction of its lean and the leg interior disintegrates around the screws. Wood glued it back for a month or two but I think it's finished. The MDF is so weak that the hardware holding the glass top began to sag right away. Don't put your feet on the edge of this table. Veneer peels away and glass pushes off its hardware. And don't even THINK about putting a drink on the non-glass surface for any length of time. If the drink sweats even slightly the MDF bubbles up under the veneer and you get little cauliflower bumps all over the surface. Great table if you intend never to touch it or move it. Not kid friendly.", 
    "Style and functionality of the table looked spot on from the website. I received the kit for the table (yes, you have to put the entire thing together), opened it up and saw it is the lowest possible quality of pressboard I have seen. Going to return - totally not worth for $***. Be warned.", 
    "I was so excited about the value of this table considering the style. Had I seen .this in store I never would have bought it. The table is made of cruddy laminate, & there are places the large metal bolts show on the legs since it didn't even have the typical plastic cover as most self assemble products. My boyfriend opened it & assembled while I was gone or I would be returning it without a doubt. I won't be buying from this site again, terrible quality on something I expected to be high end.", 
    "It was not easy to assemble, required more tools than indicated and when it was finally put together it is simply too low for our sofa. Now that it is put together, it will need to be returned. Hope that is an easy task. It looked so good online. Disappointed!", 
    "I bought this table about 6 months ago. First, it is hard to assemble. Second, there are chips in several spots where the cheaply applied finish is coming off; I see the MDF below the finish and there is no way to fix it, because it is multi-colored and no one marker will suffice. It cannot be sanded or refinished, unless you want to apply another type of veneer to it. It's not like I'm hard on furniture; I live alone and any marks it's getting are due to very light contact, I'm not even sure what contact it is getting. I have not moved it at all until recently...Last, I tried to move it 2 days ago. We picked it up, and set it down gently, and one of the table legs fell off. Getting it back on, and getting it to stay, will be difficult. I will try wood glue, and it could use a nail application, but because of the material it won't likely hold. So this is a cool looking coffee table, but it just is all looks and no substance, it is just a bit of a rip-off, like if you're a hipster you deserve it or something. All I wanted was something stylish, but with at least a little substance. Sadly that's not what I got. The company should be ashamed of selling such a piece of junk."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Kress-Glass-Insert-Mid-century-Style-Coffee-Table/5328391/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5328391/Furniture-of-America-Kress-Glass-Insert-Coffee-Table-46dbf187-63a6-4de3-973f-dbbddcb347f3_600.jpg"
  ], 
  "description": "This Kress coffee table adds storage space and style to your\nlivingarea. The sleek modern shape of this coffee table is accented\nbythe asymmetrical glass insert that serves as a unique place\ntostore and display items. A fold-down door on one end of the\ntableopens up to reveal a discreet storage area that's perfect for\nitemsyou need to keep close at hand. Mid-century StyleMaterials: Wood, MDF, veneerGlass insertOne (1) drawer on sideDimensions: 12.8 inches high x 47.3 inches wide x 21.7 inches\n  deepStyleContemporary, Mid-Century, ModernMaterialGlass, MDF, Veneer, WoodTypeCoffee TablesFinishBrown Finish, Walnut Finish, White FinishShapeRectangleAssemblyAssembly RequiredColorBrown, WhiteFurniture Frame MaterialWood"
}