{
  "name": "Furniture_of_America_72-inch_Amber_Corner_Wall_5-tier_Cappuccino_Display_Unit", 
  "price": "EUR 113.33", 
  "reviews": [
    "I love the color and wood quality of this corner cabinet. However, it has only two legs and must be attached to the wall. The materials for attachment were included but did require a drill to use them. It would have been perfect if it was easily moveable and did not require so much assembly.", 
    "My order arrived the day after it was shipped free! A couple hours of assembly was required but the instructions were very clear. Be sure to follow instructions carefully.Some of the pre-drilled holes were angled which took more time and patience and use of a drill. One hole was missing. The quality is as expected in this price range. It's some kind of composite board with veneer (not solid wood). The cappuccino matches my furniture nicely. And it fits nicely in a small corner. Overall, I am satisfied with the purchase.", 
    "Took me a while to put together, but I did it almost all by myself. I had to get my fiance to tighten the shelf screws into the legs, some didn't want to go all the way in. The shelves aren't the best quality, but they look fine from a distance. The legs are one piece which make it look nice. However the package it arrived in was HUGE. It is good for small decor items and picture frames. Color is nice. I am happy with my purchase.", 
    "Works well in a corner wish it was a bit bigger", 
    "Lovely shelves in the kids' room!", 
    "The bookshelf itself is very nice, and sleek. great for a small apt, but the i noticed some of the holes were not deep enough. And you will need a power drill to make the screws secure", 
    "Functions well but looks a little cheap", 
    "I love this shell. I use it in my bathroom to hold my perfume.", 
    "Exactly like described, took a while to put it together but I enjoyed the challenge and proud to say I did it on my own :) (female 23)", 
    "in my daughters room for her scentsy animals adorable and serves its purpose", 
    "Fills up the corner with style.", 
    "Looks good but is a little bit different in person. I didn't expect that it may have to be connected to a wall to ensure sturdiness. So far so good and hoping not to have to make any holes in the wall.", 
    "This shelf unit was exactly what we were looking for. Looked all over and this seemed to be it. It is difficult to judge furniture online and your never quite sure if it is going to feel cheap and really MDF-ee. It does not, it has a good heft to it, and was relatively easy to assemble. Highly recommended.", 
    "I like it very much! I needed something in a hallway cornet that does not take much space. Works great!", 
    "I love this unit! It wasn't difficult to put together and looks great in my rather large powder room. It's the perfect size to display things you love without taking up a huge amount of space since it's tucked out of the way in a corner.", 
    "The unit was easy to assemble, and is of a size that it complements a corner without overwhelming the area. I would recommend it to anyone that does not want a large corner unit.", 
    "I have bought furniture from overstock before but haven't ever been disappointed. I will be steering clear from any furniture of America purchases in the future. I had to get drill bits in order to assemble this thing!! there were alignment issues as well. Reading the other reviews I've come to the conclusion that there are quality control issues coz not everybody faced issues.", 
    "I love the corner shelf and it looks perfect in my small living room. it was easy to assemble at first, but then things got difficult. I didn't realize I may have put the last two shelves upside down. The pictures in the instruction manuel weren't clear to me. When I figured it out, I decided to leave it as is because I didn't want to unscrew and re-screw what I had done so far. By the time I got towards the end and I was trying to screw on the second leg to the shelves it was hard. The holes didn't seem to align properly. I'm not sure if its because I may have put the bottom two shelves wrong or because someone at the manufacturing place didn't drill the holes in the right place. I really had to force it. Luckily it didn't break. After that I skipped the part where you attach the unit to the wall for security. I'm sure it'll be fine standing against the wall. It does look great!", 
    "This took two shipments to get to me. When I went to assemble, some of the screws were stripped, and the two sides do not line up. I had to take apart and rework, the directions were horrible, the assemble was bad also. I would send back but after 5 hours and a smashed finger I FINALLY have it up!", 
    "This is a great decorative shelf, not really big enough for a lot of books. The color is pretty dark and looks great in bedroom it's definitely sturdy. I am very happy with this purchase.", 
    "I was really excited to receive this shelf. I had planned to use in my home office. it arrived in a VERY long box of at least 6 feet; which makes sense because the shelf is very tall. However the box was bent in the middle. Unfortunately the bent box meant that the shelf was broken in half. I contacted Overstock right away and asked for replacement parts. Although customer service has responded they are requesting a replacement from the manufacturer, I still haven't heard anything or seen the replacements. I hope I get my replacements soon and I hope the broken support legs are not representative of this shelf's ability to hold my books!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-72-inch-Amber-Corner-Wall-5-tier-Cappuccino-Display-Unit/8344454/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8344454/Furniture-of-America-72-inch-Amber-Corner-Wall-5-tier-Cappuccino-Display-Unit-d77d5c20-0fb1-4c75-8867-613f3348aacc_600.jpg"
  ], 
  "description": "Luxuriate in opulent bliss when you invite this Melanie bench from Safavieh into your home. Perfect for pampering yourself in the master suite as you dress or undress, slide this alluring bench from the foot of your bed to a place beside you while you read newspapers or sip coffee in bed on leisurely mornings.Champagne colored crushed velvet upholstery offers luxurious stylingBirch wood construction lends natural warmthBench measures 19.3\"H x 42.2\"W x 21.3\"DBench arrives fully assembled for immediate enjoymentStyleModern, Transitional, UrbanMaterialMDF, VeneerFinishCappuccino FinishShelf TypeDisplay, LadderAssemblyAssembly RequiredColorBrownNumber of Shelf5"
}