{
  "name": "Furniture_of_America_Zoe_Modern_Rectangular_Coffee_Table", 
  "price": "EUR 145.10", 
  "reviews": [
    "This is an interesting and beautiful piece of furniture. It was easy to assemble and fits nicely in front of our sofa.", 
    "I have received many compliments on this table. I only wish they had a matching side table.", 
    "We really like this coffee table. I was a little worried the zig zags would be too visually dominant, but they're not, since they're recessed a little.", 
    "I wasn't sure what to expect from a table you put together from pieces but I was pleasantly surprised with this item. My boyfriend had to put it together for me (I'm not good with directions) but now that it's sitting in front of my couch with some accessories I really like it. It's pretty sturdy and easy to clean. It's unique looking so it makes it looks more expensive than it really is. I'm definitely happy with my purchase", 
    "This table fits perfect in my living room. I get a lot of compliments on the design of the table. It was easy to assemble. Total assembly time was less than 1 hour. I did have help. This is a two person job.", 
    "This table made a nice Christmas present for my daughter. Nice smaller coffee table for her new house. The only problem is with getting the top to stay on the frame. I think she said the table came with glue so she could glue it. Just sounded a bit strange to me.", 
    "I would recommend this to anyone. Great product, great price and free shipping! I love my table!", 
    "Good quality table that looks great with the rest of our living room furniture. Love the \"Z\" design!", 
    "This table is a great fit to our living room, I had some doubts about the assembling, but I did it by myself when my husband was at work - wanted to surprise him. I would highly recommend purchasing this table, especially for this price.", 
    "great table for the price, easy to resemble, fits perfectly well with black furnitures, not too big, but not too small. Great!", 
    "Great table took me 25min to assemble. Very happy with the table.", 
    "I love this coffee table. I was looking for something to go in my sitting room and this coffee table fits perfect! I highly suggest this table if you are wanting a modern up to date look in any room. It took my husband about 15 minutes to put it together. This is a very solid and well made coffee table.", 
    "Ok quality for the price. Little shorter than I would have hoped. Overll not bad. Easy to put together", 
    "LOVE this table! The wood of this table is very thick and sturdy. My boyfriend put it together so I can not speak to the difficulty of setting it up; but I will say that it took him only about 15-20 minutes.", 
    "This is a nice table with a unique design and cool finish. It has given an elegant look to my living room. Have got lot of complements for this.", 
    "This coffee table has such a contemporary look - it's unbelievable. My brother installed it and it took him about an hour to complete the entire thing... he did it on his own. THe table is nice and sturdy and is the perfect size. I would recommend this to anyone who is looking to make their living room a bit more modern.", 
    "A very nice table for the price. Couldn't build one for this amount!", 
    "Nice looking table. Have gotten compliments on it's design. My only con is the sticky circles to hide the screws. Would have liked some kind of matching wood insert to cover them but I can live with it as is. Perfect for my man cave :).", 
    "Good casual table. easy enough to put togeather. i have it in my theater room for sodas and popcorn. i am very satisfied with the table.", 
    "There's band saw marks on literally every piece of this furniture. Something that's very easy to take care of with proper equipment, and quick. The fact that they did not even sand the surface of these pieces speaks volumes to the quality of the product. It looks beautiful in the online photos, but quality is beyond sub par. I suppose you get what you pay for.", 
    "Love the table. Blends well into my other furnishings. Different levels allow for display of items.", 
    "It's my fault for not reading the specs carefully. This table sits low. The shelving is tighter than the picture makes it appear. My only true disappointment is that the feet are rough on the bottom. I wouldn't set it on my wood flooring until just got felt to stick on them. However, it's a nice table for the price.", 
    "Adds a very modern feel to the living room! love it!", 
    "I love the design of this table. However, it tips at one end. I have tried everything to make that side heavier by stacking several very heavy coffee table books. Nothing works. I also constantly stub my toes on the legs that stick out. I thought it was just me, nope, everyone who comes over does the same thing. I will be selling this when I move", 
    "This is an amazing coffee table considering how cheap it was. definitely better quality than any other coffee table in that price range. really easy to set up!", 
    "I was hoping the table would sit higher and a Little bigger for My living room, but it didn't. Still looks good though. Will replace eventually with something bigger.", 
    "This table looks good if kept in the room but its unsteady so keeps moving when touched so not at all functional.", 
    "Instructions were a little small but fairly easy to follow. The wash wood color goes well with my beach house theme too.", 
    "Average looks for the price", 
    "I bought it for my son and he loves it! Easy to put together and nice looking", 
    "This coffee table is really a great piece in my/any living room. Only downfall is it does show a lot of marks if you touch it with anything wet/greasy. Very nice though. Happy with it.", 
    "I bought this for my daughter's first apartment and she loves it!!", 
    "A little difficult to put togehter, but once done, it looks really nice.", 
    "The extra storage shelves underneath are great. Overall, it is of decent quality, good size - big but not too big, and a deep black color. I'm not sure how well it will hold up over time though, and it does fingerprint easily.", 
    "I did like this product - until today. I had a table-top frame that was holding a book fall over and it punctured the top of the table! It took a quarter-sized chunk out of the top of the table, and to my dismay, the table top is made out of cardboard - not even cheap particle board, but actual cardboard!", 
    "This coffee table is: Good quality. Easy assembly. Great look!", 
    "We chose this coffee table after an extensive search of multiple styles of tables on multiple sites. We are happy with our purchase. It looks good in the center of our living room, and it is practical. The two shelves provide plenty of space for magazines and remotes. It was easy to put together, and it is easy to move around.", 
    "This table demands attention and had alot of great features. The color is about as near black as you can get. The lower shelves are great to keep things off the top and out of sight withought feeling too substancial. The instructions were a bit nonsensical, but I was able to put it together myself in about 20 minutes. My only peeve is that the covers for the screws that hold it together are stickers, but to be honest I haven't noticed them. In summary... a great distinctive sturdy coffee table that is a good value.", 
    "This Furniture of America Coffee Table was as easier to assemble than other brands of furniture.The quality of the wood and finish give it a great look as a livingroom accent. The two asymmetrically places shelves make it a neat display area for books and knik-knacks. I love it.", 
    "I really like this table, easy to set up and looks very nice. It is a little bit low for a coffee table so I added drawer knobs to the bottom to raise it by 2 inches. This helped a lot and was cheap and easy to install with a Home Depot run. It is sturdy enough for the price and overall a good purchase.", 
    "I like the coffee table. It looks very stylish and cool in a contemporary living room. Has a slight cheap look to it with the wood grain pattern, but not too bad. It does look very cool. It sits lower than I expected and isn't very large, but no big deal. It is very light as well, probably because of the cheapness of the wood. Ok for the price though", 
    "Directions were pretty rudimentary, and the cover pages gave warnings about how it might take 1/2 day to assemble! One part of the directions showed the pieces in the wrong order (either that, or the holes were drilled wrong). Either way, I had to switch the 2 shelves so they matched the holes. The assembly kit only included stickers to cover the screwholes on the legs of the table, but you can still see 4 deep drilled holes on each of the shelves. They should have included an extra 8 stickers to cover those or plugs of some sort, so I guess I'll have to use paint or something because they look funky and take away from the sleek look I was going for in this table. The directions (or should I say picture) for putting the top on was unclear...I eventually figured out that you have to install the screws into the underside of table top, then set it down on top of legs and tighten. I still have one corner that I couldn't get all the in position, so it's a bit loose. Lastly, a small tube of wood glue was included, but no where in the directions did it say where to use it? It didn't make sense on the shelf screws, so I guess it should have been used for the table top. I didn't end up using it at all.", 
    "I am pretty disappointed with the quality of this table. I thought it was going to be actual wood, but it's really particle board with a fake wood grain veneer. That veneer makes it look kinda cheap--very easy to tell it's fake. The stickers that cover the screw holes also detract from the look. The table top smudges like a smart phone screen, so make sure you use coasters. It was covered in huge smudges from my hands just from building it. The pieces arrived in a nicely packed box. However, all the pieces were mislabeled. The legs were glued together incorrectly, so I had to break them apart and glue them back together in their correct form. The directions weren't very clear. It's easier to follow *** directions, which I hate. Overall the finished product looks nice and stylish, but had I known it was not real wood I never would have paid so much for it. It's more stylish than other coffee tables at this price, but I could have gotten a better made table for half the cost. I like the design, though, and it doesn't look bad enough to go through the hassle of returning it. I don't think it will hold up well over time, so I would be very careful when using it if you want it to last.", 
    "table is ok..........I should have spent more$$$$$ and got something better.......going to give to a friend....too cheap looking for my furnishings", 
    "The tabletop doesn't secure to the table, you just set it on. The pegs are short so the tabletop tips and shifts with weight. We bought some epoxy glue, did the trick. Hasn't tipped or anything since.Other than this, it's perfect. We've had it for a month or so, no other issues."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Zoe-Modern-Rectangular-Coffee-Table/5735834/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/5735834/Furniture-of-America-Zoe-Modern-Rectangular-Coffee-Table-a546a02b-fa2d-4b3f-8ac1-c2454b47b4b4_600.jpg"
  ], 
  "description": "Accent your living room in eye-catching style with this Zoe rectangular coffee table from Furniture of America. Stark, angular lines give this modern coffee table a striking appearance. Form follows function as the table incorporates two shelves that are perfect for storing books and magazines. This table owes its trendy visual appeal to its shape but fits well with more traditional decor thanks to its oak construction and black finish.\nFrame materials: Wood, MDF, veneerFinish Options: BlackTwo (2) separated and floating-effect bottom shelves for storageArchitectural and intriguing Z-shaped design legsTable dimensions: 47.25 inches wide x 23.25 inches deep x 15.5 inches highStyleContemporaryMaterialFelt, Laminate, MDF, Veneer, WoodTypeCoffee TablesFinishBlack Finish, Oak FinishShapeRectangleAssemblyAssembly RequiredColorBlack, TanFurniture Frame MaterialWoodFurniture PatternSolid"
}