{
  "name": "Furniture_of_America_Kiki_5-tier_Corner_Ladder_Display_Bookcase", 
  "price": "EUR 105.04", 
  "reviews": [
    "Love it! Exactly as pictured! I receive so many compliments on this! I would buy more if I had more places to put them. One of my favorite pieces of furniture!", 
    "Husband assembled in about an hour. Wasn't too hard. The piece is a nice addition to a corner in my family room. So glad I chose to purchase!!", 
    "I had a dark empty corner next to my fireplace that begged for something stylish and eye-catching. The Kiki 5 Tier fit the bill perfectly, was easy to put together, sturdy enough to hold heavy books on bottom shelf and graceful enough to display framed pics and artwork on smaller shelves. Arrived promptly and wrapped in an environmentally friendly manner. Thank you, Overstock, and thank you, Furniture of America!", 
    "I love this stand, functional and beautiful. Good deal for the price and pretty easy to put together as well.", 
    "I needed something to put small things on for my Bathroom. This fit perfect. looks great.", 
    "I wish there was a negative star rating... I'm very handy with projects and found this to be a very frustrating piece to put together... Might look nice once completed, will never know....", 
    "This bookshelf did not come with enough of the correct screws to assemble. I called, no screws were sent. I called again, wrong parts were sent. I called again, parts were sent, however they were addressed to someone I never heard of.", 
    "For the price, I like these shelves. It took a while to put them together but it was not difficult. They look nice. I have had to use a furniture marker, the first time I dusted them, the rag caught on a splinter, the stain/finish is very shallow, and the wood under is much lighter.", 
    "This was such a perfect piece of furniture for my new kitchen but had to send it back. I checked off each piece as I pulled it from the box but when I got to the hardware - nuts, bolts, washers, etc, lots of parts were missing. I was short 3 dowels, no washers at all, no bracket braces, missing screws, no tube of glue. Then I noticed one of the shelves had a bad paint coating and ripples in the wood. It's possible that someone else returned this and left out the missing parts. Customer service was very helpful with this and guided me with the return.Unfortunately, I've had this happen before with Overstock so I will shop elsewhere.", 
    "Does not hold as much as I thought. Sturdy product.", 
    "This beautiful bookcase arrived quickly and was easy to assemble. It fit perfectly in the corner that I had envisioned it in. It displays pictures & artifacts beautifully.", 
    "I purchased this ladder bookcase in white. Each shelf is very roomy for displaying pictures, figurines, and other memorabilia. It really sets off the corner of my newly remodeled bedroom. I have a Sunshine Corner, and display many items related to my Sunshine squares dance club. It is really an eye catching piece of furniture, easy to handle and to clean. I highly recommend this item. Nice height and width. Takes up just the right amount of space.", 
    "The bookcase arrived on time, and took less than an hour to put together. The color is a little deeper than my dining room set but looks great in the corner space in the dining room.", 
    "It went together easily. The color was the exact white I wanted. It fit perfectly in my room.", 
    "This bookcase is gorgeous and it looks exactly as the picture does. The only negative was having to put it together.... So many pieces! Definitely worth it though.", 
    "This product was very easy to assemble. It looks good in my great room. I use it to display decorative items. I would not use it as a bookcase since it wouldn't hold enough of my book collection.", 
    "easy to assemble and very sturdy. Great piece of furniture for the money. highly recommended", 
    "We were pleased to find all of the items necessary to assemble the unit, with exception of one screw.The instructions were easy to follow for two people to put the unit together. It is very attractive and fits very well into the corner space that I had in my bathroom to hold linens and bath products. I really do like how well it looks with my white bathroom trim.", 
    "It was shipped very fast and packed great, to put it together two people is the best took us less then half hrs. Looks great for the price I'm using it for nicknames I don't think it would make a good a good bookcase because of the design of it.", 
    "Had some problems with assembly...it does take two people to assemble! Spent a couple of hours putting it all together. It's very sturdy and well made..has a couple of straps to anchor it to the wall which I didn't use because I felt it was stable enough to stand on it's own. I love it and would recommend.", 
    "Great bookcase. Love the color and it makes my room look great and gives a cozy feel. The assembly was also very easy. Overall a great product.", 
    "Easy to assemble and perfect addition to that corner of my office that needed \"something\" without spending a fortune.", 
    "I would give this 5 stars, but it takes a while to put it together. Still, we are very pleased with the look and construction.", 
    "Needed hubby's help to put together, hate the T-bAR nuts! Could have been 10 inches taller", 
    "Shipped well one person build.", 
    "I live in a cottage loft and the ladder display bookcase is just perfect for the corner in my living room! I am very pleased with how it looks!", 
    "I purchased the white set. Had to return the first because some of the the pegs were missing and didn't quite line up. I only kept it because I need something like it for the corner in my exercise room, where it fits perfectly", 
    "Missing some small parts, holes not drilled correctly. Very hard to assemble. NOT happy with it at all!!!!!!!!!!!!!", 
    "I specifically purchased this corner ladder rather than another brand for less money because this product is shown without a crack between the upright boards in the corner-i.e., it shows it as fitting well and close together while the other brand shows a crack. Sadly, there is a definite crack between the corner boards of this product.", 
    "I was excited about this product because I had been looking for something like this for a long time. The price was a little high but it fit my needs so well that I decided to go ahead and buy it. When I went to assemble it, I found that there were two of one of the parts and none of another, plus missing smaller parts. Also, the paint is missing or poor on some areas. I love the design but I was under the impression that I was buying a new product in 100% condition and this is far from it. I have to say that I contacted customer service and they said they're sending replacement parts, but I'm still waiting to get notice that they've shipped. So far, nothing. For now, I'm left with a bunch of parts that I can't do anything with.", 
    "I can't tell you how long it took to put this together the screw and locking nuts were so hard to use. The second to bottom shelf is only secured with 3 screws because this item came with a screw which was stripped a side panel which was cracked and every time you move the shelf the top half separates from the bottom. Overall it looks great just hope once it's in place it will hold up! Wish us luck! don't waste your time and find one else where!", 
    "arrived on time great quality of material very easy assembly and it looks wonderful can't ask for much more", 
    "love this corner ladder bookcase. it was exactly what i was looking for to put in the cormer of my living room. great quality. does not to be put together -- took 2 of us about 45 minutes to put together -- definitely need 2 people", 
    "did recommend it to a friend. no surprises, just as described and shipping can't be beat, great service", 
    "I put this bookcase in the corner of my bedroom. It matches my furniture and is great accent piece. It was fairly easy to put together and it looks far more expensive than the purchase price. I'm very satisfied with my purchase.", 
    "Perfect for a corner. Very happy with the purchase.", 
    "I looked everywhere for this type of a bookcase and found it on Overstock. It was less expensive and every bit as nice as ones that were pricier.", 
    "Nice and sturdy piece. The only thing however is that you have to know how to properly pack the books because they will fall out on the sides.", 
    "I love the look. Not very hard to put together", 
    "I bought this item for my living room and it looks really nice in the corner. Wish it was a little taller but other than that its great!", 
    "Have a bose radio and plants and books on it in a small bedroom. Very convenient and good use of space", 
    "Goes together pretty easily. An attractive corner piece.", 
    "Well pleased with this product", 
    "I love this in the living room, looks great.", 
    "looks great but directions for assembly need some work.", 
    "Strong. Holds my pictures very well. Attractive. I've had it a year.", 
    "Not too difficult to assemble. Sturdy. Looks great.", 
    "Much better quality than I was anticipating for $$. Sturdy, and fairly easy to assemble. Possible for one person to do alone", 
    "I am pleased with the value of this product in line with the cost", 
    "This shelf works great for a corner where I wanted to put some electronics (phones & printer & router, etc.) into a compact space instead of using a big desk. It is well made, sturdy, and was pretty easy to assemble.", 
    "This was bought to replace a piece that I loved and I now love this more. It's a perfect height and sixe for my corner. Also vey easy to put together.", 
    "Beautiful corner shelf. It does take a little while to assemble but the time is worth it.", 
    "I would have given it 5 stars but they sent two of one piece. I got a hold of customer service, she was great. They are sending out the correct piece and I can't wait to finish it. Plenty big enough for books and and my pretties.Thank you overstock.com P.S., I've ordered a lot from overstock.com and this is the first small problem I've had", 
    "It looks great in my corner and blends in well with my decor. Very easy to put together.", 
    "Worked perfectly with the new furniture", 
    "This bookcase was amazingly complicated to put together. It took about 1-1/2 hours. But when it got in the room, it really made it look nice, while giving some places for accents without taking up a lot of floor space. It seems well crafted.", 
    "Plain and simple, I am enjoying the look, style, and the ease that was the assembly plus the time it took a friend and I to assemble was perfect. It fits in with my bedrom furniture AND LOOKS great in the corner.I will buy another of the same for another corner of my apartment!", 
    "This item turned out to be just as I hoped for the price. It wasn't to bad to put together. The shelves held good sized items without taking up too much space.", 
    "Brought this for a small corner that needs to hold the telephone and few mementos. Really easy to put together. Great value for the price.", 
    "Shelf is sturdy but tedious to put together.", 
    "Nice color and wood. Looks wonderful in my kitchen corner. We use the last two shelves for cookbooks and we love it.", 
    "This is just a beautiful bookcase.", 
    "I am very happy with this product. Quality is really good. Easy to assemble and simply looks great.", 
    "This is a good piece of furniture", 
    "Fits great in the corner of my living room. Very quick delivery", 
    "I purchased this to use as a corner display for decor rather than books. I have a floral arrangement, a vase, decorative bottles, etc . on itand it looks great.It is a nice piece, but I am not sure I would load it too heavily withlots of books. The bookcase is not a real heavy one.It is worth the money though.", 
    "Loved it, got it in white and painted to compliment the room it's in.", 
    "Perfect look for the guest room. Easily went together, though time consuming. Even came with the wood glue needed.", 
    "Let me just say that Furniture of America makes pieces that are very complicated to put together. Its extremely time consuming for the $$ you pay for their stuff. I will do my best from now on to never order from this company again.", 
    "I really wanted this for the cats to climb on, but the shelves weren't a comfortable distance apart for them. The usual veneer and stain, with some minor \"oops\" marks. Probably fine if you want it for the intended purpose.", 
    "I can't wait until it looks like the picture. The directions are confusing & I'm still trying to get it right after 2 weeks.", 
    "a little difficult to assemble but other than that... love it", 
    "Easy to put together. Can't adjust the shelves height to fit what you want to display. Part B was broken on both shelves I ordered. I called for a replacement, but the replacement was also split. My son just put it together with the broken unit.", 
    "Perfectly what I needed! Thanks overstock also, for the fast delivery! :)", 
    "It's just like the picture. Awesome purchase", 
    "The room looks great this is the answer to my clutter.", 
    "Not at all as sturdy as I imagined it would be.", 
    "It was very easy to put together and looks good in white.", 
    "Sturdy piece of furniture, exactly what I was looking for in a corner piece.", 
    "exactly what I needed for my bar area. At a good price and quality mfg.", 
    "Fairly easy to assemble. Looks great in living room corner. Rounded shelves look so much better than boring rectangular units I had seen.,", 
    "easy assembly, Still figuring out how to display my books on it.", 
    "Looks awesome with my knitting stash displayed so I can look at me yarn before I buy more.", 
    "very pretty--read directions carefully!!!", 
    "I think this item is great, fits everything I needed, texture is great and very easy to put together.", 
    "Easy to assemble. Light weight. Looks great in corner and adds height to the room. True to color...dark honey pine.", 
    "Pretty easy to put together and looks very nice.", 
    "The corner didnt seem to fit well into the wall's corners. But nice.", 
    "This is a quality piece. Detail and selection of materials are great. Easy to assemble", 
    "Good quality and really love it.", 
    "Absolutely love this bookcase and it looks fantastic!", 
    "This bookcase provides a nice sleek look in my living room, and it was easy to put together.", 
    "Exactly what I needed, looks good with existing furniture.", 
    "Perfect corner shelf to class up a room.", 
    "The color is beautiful and I really love the design. I would say that the wood stain isn't completely even and there are a few scratches on the piece that I received, but nothing major -probably one of the reasons it ended up on sale online. FYI, the two pieces do not fully meet in the back corner and I think this is part of the design but can be difficult to see in the photo.Assembly was moderately challenging, you could definitely assemble this by yourself but assembly does require an electric screw gun (which I don't have) so my piece will have to remain not fully pieced together for a while.", 
    "this is beautiful! Well made and heavy.", 
    "Looks great! Very easy to put together and it is also very sturdy!", 
    "Great, sturdy bookshelf. It fit perfectly into the little nook I have in my living room and really makes the space come together!", 
    "This makes a perfect fit for any room thats lacking space. Very happy with my purchase and definitely recommend it.", 
    "This bookcase works great in the spot I wanted it for.", 
    "This item arrived to our Idaho cabin well protected in shipping material. There are lots of screws and washers but eventually we got it together because practice makes perfect. I ordered it in black and the finish was perfect. I expected some flaws because of where it was made but no porblem. We ended up with a number of extra fastners and screws that were not mentioned in the detailed instructions. Maybe someone in the assembly line misplaced these in our shelf box!", 
    "Easy to assemble and it looks very fancy in my husband office.", 
    "Very easy to put together. Sturdy. I love it.", 
    "This corner case is a nice way to fill a corner and display various items. We have it in the corner behind our family room breakfast table and it looks good. It was hard to put together with lots of pieces, and I recommend you have two people to do it.", 
    "Very easy to assemble, very sturdy, haven't had any issues with it in the few months that I've had it.", 
    "The corner book shelf looks contemporary in our spare room. I needed something to fill the void, add a few books and it met my needs. Assembly was rather easy. It looks very nice. I'm happy with my purchase.", 
    "The corner bookcase is really just used for decor of my living room rather than a real book case. IT shows exactly like the picture. A good buy.", 
    "I really like this corner ladder, the only thing that i really really didn,t like was that when i was to assemble it, the directions in the mannual were really poor. i got some parts that i never used. Also, the directions don't have any word just pictures.", 
    "Assembly was pretty easy and the piece looks great! I was worried it would have that laminate/cheap look and it does not at all. All wood and very impressive looking.", 
    "Very sharp, nice quality piece of furniture. A PITA to put together, according to my husband who took on the task. The second one I bought went together much easier. Now we have a wooden, corner shelf unit in the den and a white unit in \"mom's\" room. Great additions. My sis is going to purchase one in black.", 
    "I received this in Cherry. the book case is solid wood which is fantastic and once all the screws are done tightly it feels very sturdy and solid. Much better than any particle board that you see for similar prices. It took about 45 mins to assemble, nothing tricky. Looks great. Not practical like a traditional rectangular bookshelf but its a beautiful accent piece for the corner", 
    "Beautiful piece. Wood finish is certainly smooth and pleasing to touch. Display is perfect for a corner display. Thank you for such an astonishing piece.", 
    "Now that I have the correct color, it is the focal point of the room. Also the items that I have chosen to place on it bring extra attention to the workmanship of the furniture.", 
    "Not only was this shelf what I wanted, the quality was better than I expected for the price. Assembly was simple and quick. Good product.", 
    "Great fixture for our living room. Love the cherry wood color, matches image perfectly. A lot of parts to put together, but easy to follow. One negative is the shelves are pretty close together so can't hold anything tall. Overall I am happy with this purchase.", 
    "Packaging: A Quality: BAssembly: B Overall good product. You get what you pay for.", 
    "Very nice and well made. I lov it", 
    "Perfect in the corner. Needed something smaller and more updated that our old 80's style bookcase. Love the smaller less clutter bookcase. Makes the room wider with the corner opened up. The black color is sharp and crisp. No problem building, directions a little vague but with common sense you can put together.", 
    "I was very pleased with this purchase. It is easy to assemble and perfectly blends with my furnishings. The color is deep and rich and is a great addition to my home.", 
    "It fits perfectly in the corner. It gave some heights to that area and it is fun to decorate!", 
    "Looks great in my living room. I actually bought two!", 
    "I ordered this in white on a whim and it is now one of my favorite pieces. I use it to display some decorative items in what would have been dead space in a small hallway. Because the shelves are curved and the depth is graduated, the shelf doesn't get in the way at all. It was surprisingly inexpensive.", 
    "Sturdy, functional but luckily we are handy with tools because instructions were not included. The black is definitely a true .black", 
    "My husband and I were very pleased with our recent purchase of the corner bookcase! It is nicely made, with solid wood and a lovely, espresso colored finish. It is exactly what we hoped it would be and adds the perfect touch to what was a rather dull corner of our living room. We purchased it because we didn't want a heavy looking bookcase behind our accent chair. It adds just the right amount of interest without being overbearing, and allows for a few, fun artistic pieces to be featured rather than a solid wall of books. I am always tickled pink when purchasing anything online which meets/exceeds my expectations.", 
    "Exactly what I hoped for. Great color and quick assembly.", 
    "Love it....very nice piece for the price", 
    "Love this ladder corner shelf. It was time consuming to put together. Arrived without the hardware so waited a week to receive and they still didn't send all of the hardware. It is a very nice addition to my living room and would recommend the purchase.", 
    "I really like this shelving unit. It is very sturdy, and blends in well with my wide dark stained baseboards and window trim.It's certainly worth the price! My son says it was hard to put together, lol, not my problem, but it did take he and his girlfriend a long time.I want another but can't find a corner to put it in!!!", 
    "I love the look in my dining rm!! I was unhappy with the amount of tiny scratches it had on it when it was delivered. I was able to polish the bigger ones out but some are still noticeable. Great buy!!", 
    "Solid, really nice and easy to put together! We love it and it's perfect for our corner!", 
    "Put it together myself. After the first couple of shelves, it became much easier to assemble. Very pleased with it. Fits in my decor easily. Thanks overstock!", 
    "Fairly easy to assemble, enhances the corner space I. Our living room. Great buy for the cost", 
    "Sturdy and nice. Easy to put together.", 
    "the handyman who assembled it said the directions were pretty funky…but once together, it is really nice and stable", 
    "Great corner bookcase. Just fits the corner space I needed for books and stuff. Only downside is the very top shelf is so small as to not be very usable.", 
    "Love it, adds elegance & simplicity to any corner. Quality of wood is good grade. Took 1 & half hours to put together but I ordered 2. 😀👍", 
    "This display bookcase fits perfectly in the corner of our living room and has been at the center of many conversations from friends and family who really appreciate the look and style of it also. We just love it.", 
    "We are pleased with this shelf and it is the quality that we expected. It has a fair amount of assembly, but it wasn't too difficult. It fits our space well and looks great!", 
    "Looks exactly the same as the picture, good quality. Very happy with how it turned out", 
    "I bought this for my son's room with no wall space. It is sturdy and attractive when assembled, which takes a little time but all the pieces and instructions were included. It is a very nice and unusual shelf.", 
    "This fits perfectly in the corner of our room. We are using it to hold all of the components for the TV and mounted the TV above it on the small wall. It came with little plugs to cover the assembly holes, but since it's against the wall we didn't even install them. It makes the previously useless corner 100% functional and stylish. It looks like it was custom built for the spot it fits so well.", 
    "This was exactly what I was looking for. We needed a smaller unit for the corner to house our TV remotes and some knick knacks. My husband felt that it was fairly easy to assemble and it seems sturdy enough. Perfect for the price!", 
    "I can't recommend this ENOUGH!!! We just purchased a second one, using both in our formal dining to display antiques. It's a nice change from your standard curio.", 
    "Perfect for what I needed - looks very nice in the space. Easy to set up.", 
    "I ordered the black bookcase. Oddly there are 4 bare spots in the frame on top and bottom where the paint didn't cover. But the flaws give the unit a bit of character or a little black shoe polish won't fix. Basically I just didn't want to make the effort to send it back and wait for another. It took a while to assemble and one screw was missing. Wth? It looks good in my office and overall I am pleased with it.", 
    "Shelf itself is nice and looks great. Although I have a lot of furniture assembly experience this is miserable. Directions are incomplete and a poor xerox copy. Screws do not fit easily into inserts suppled. I am still fighting a week later and am almost ready tp throw out $**. It is way too heavy to even consider returning.", 
    "This a very elegant corner piece! It has a nice finish wheather in black or wood grain, as I put one togeather for my wife and my daughter.It does require as stated that two people may want to assemble it!!", 
    "Needing an interesting additional for the corner in our guest room, I ordered this piece. It arrived on time and we put it together in 20 minutes. I was very satisfied with the weight and stability of the piece. I was able to display photos, books and a clock very attractively.", 
    "Love it. So easy to put together and look really nice and made well. Great purchase.", 
    "I bought this to go in my living room's corner. It was relatively easy to build, seems sturdy, and is very stylish. I've already gotten compliments. I bought the white one and painted it grey to go with my decor. I will say that painting this would have probably been easier before I built it because of all the nooks and crannies but I think it came out great! I definitely recommend this product.", 
    "I knew exactly what I wanted and what the room needed for a completed look. Overstock.com had it at a price that couldn't be beat. The shelf arrived when Overstock.com said it would, was easy to assemble, and is sturdy. I couldn't be happier.", 
    "quality product. well made and sturdy. fast shipping and a hassle free purchase.will buy again from them.", 
    "We are happy with the corner ladder display. It arrived in good condition and on time. By the manufacturers own scale it was a medium difficulty piece to assemble and it lived up to its rating. It really needed 2 people to assemble it. Unless you are a professional juggler. We arent really handy people but we were able to assemble it with out losing our patience. We would recommend the purchase to others.", 
    "It went together easily, less than an hour by myself. The wood finish is uneven and there are \"worn\" areas on the shelves, but it is a corner unit not a focal top. I have a TV hung from the ceiling and this will house the media components.", 
    "This is great for corner space. For the shelves, i used them for my direct tv box, dvd player and video game console. You just have to be sure the cord is long enough to plug in your console. This is great in a small room versus a large room because it is small, if you want it to stand out. .", 
    "Still not put together yet. Started, but I got bogged down with the way it is going together. I've put together a lot of furniture, but this one is just a little strange to put together. The sides do not meet in the corner as the picture depicts. I will finish and make it work.", 
    "When the shelf unit was delivered, it was packed excellent! Sometimes with big items shipping isn't easy and overstock.com made sure that it came undamaged. The only problem we had was that there was two of one piece and missing the actual piece that was needed to complete the item. Overstock.com Customer Service did work on this and get another piece sent out which was the correct item I needed. Again wrapped to perfection to avoid damage. CS did an excellent job keeping in touch while waiting for the piece and I am impressed. Thank you overstock.com!", 
    "The shelves were scratched, pitted and chipped. There were gaps in the joints. The shelf would have been exactly what I wanted except for the poor quality. I returned it.", 
    "I like that this does not take a lot of space or obstruct heating vents on the floor, yet offers 5 shelves for displaying my collection of creches. I was able to put it together alone, although having another set of hands would have made it much faster. The effect is not overpowering, yet makes a subtle statement in its simplicity and clean lines. It seems quite sturdy.", 
    "The color is fine. But this is just a little bit simple.", 
    "I never rate anything as excellent, but this fits our room nicely.", 
    "Fairly east to assemble, color is perfect, looks great!", 
    "Instructions need some significant update. The cover list several screws and such but when you see the actual items provided they don't match. Dowels are provided and glue but instructions \"strongly\" say not to tighten screws. Wood glue is not mentioned in the assembly instructions at all. I know from other projects you need to apply the glue and then tighten the screws. If the glue is fast drying you need to rush. Basically I would recommend the company review and update their assembly instructions. Example is the cover sheet provided, not one item mentioned on the cover sheet is even supplied or needed in the assembly. The actual product is fine but if you are a first timer, pass on the purchase or get help. Good luck!", 
    "This had very poor direction no words just pictures. Plus, they gave a pictures of all the parts and then did not use them in the directions. It was not that easy to build. Make sure you have a drill as the holes are not the greatest, plus the hard to find the holes to put the screws into.", 
    "Sturdy, simple and exactly what I was looking for! Fits into a corner well and is strong enough for some heavy items as well as decroative items.", 
    "I bought this corner ladder to put on my massage room it arrived yesterday when I open it this evening, i am missing wood dowels, wood plugs and two pcs of metal I don't know what it called. This is ridiculous! how will I assemble this thing without those pcs missing. The assembly instruction is also bad. Although it is free shipping still not worth it. I am so disappointed. It is better to buy in a furniture store you'll see the real stuff."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Kiki-5-tier-Corner-Ladder-Display-Bookcase/7752516/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=2", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7752516/Furniture-of-America-Kiki-5-tier-Corner-Ladder-Display-Bookcase-dba2803a-c513-46e3-8ae8-3daba921bf57_600.jpg"
  ], 
  "description": "Make maximum use of the nooks in your house with this five-tier\nbookcase from Furniture of America. This display bookcase widens\nfrom top to bottom, which makes it fashionable and appealing. The\nsturdy, angled legs on the corner bookcase help to ensure safety,\nwhile solid wood and veneers supply durability. Materials: Solid wood, veneersFinish options: Black, white, cherryCharming space-saving design with Five (5) rounded\n  shelvesKid-friendly with smooth, shelving edge frontsSturdy legs angled for great support and styleBack corner base panel for additional structural\n  integrityComposed of solid wood and wood veneer, engineered for\n  stability and durabilityCorner design maximizes vertical and corner spaceThe perfect piece to organize the home or officeDecor and accessories not includedOverall dimensions: 63.25 inches high x 29.5 inches wide x 21\n  inches deepStyleCasual, Contemporary, Country, TransitionalMaterialMDF, Veneer, WoodFinishBlack Finish, Cherry Finish, White FinishShelf TypeDisplay, LadderAssemblyAssembly RequiredColorBlack, Brown, Red, WhiteFurniture Frame MaterialWoodFurniture PatternSolidNumber of Shelf5"
}