{
  "name": "Furniture_of_America_Open-cabinet_Coffee_Table", 
  "price": "EUR 148.36", 
  "reviews": [
    "I am a petite female and prior to this month(March of 2012), I never assembled any furniture in my life. Because of all the horror stories on this website about the assembly of this product, I almost did not buy it.ALMOST. In the end,I decided to take my chances because I liked it too much.I was fully prepared to bite the bullet and pay for return shipping because I wouldn't be able to put it together right.Anticipating that this would be the DIY project of the century, I had it shipped to my previous landlord James' house because James is hands down the handiest guy I've ever known. Even so, I made an appointment with him to make sure that he wouldn't just attempt taking on this coffee table monster by himself. I figured two people putting their heads together would have a better chance of deciphering the notorious wordless schematic drawings. On the day of the big coffee table assembly event, I told my bf not to come over to my apartment that night because I thought I would be home late. I was so WRONG. The assembly process took a whopping 30 minutes. 40 minutes in total time spent, including the time for James to set up his work bench, getting all the pieces unpacked and laid out on the padded floor and then cleaning up afterwards. There are ONLY 6 steps in total. I was involved every step of the way. The drawings are very EASY to understand. The wood pieces are ALL labeled, and labeled Correctly! The hardware pieces were easy to tell apart because..well...they were in individual packaging. No pieces were missing or damaged in any way. The only discrepancy between the assembly instructions and my actual product is that at step 3 (or 5,can't remember), the schematic shows that I need a wood peg when in fact either they forgot to drill two holes or decided that was unnecessary. It doesn't matter though because it really is unnecessary. Every piece came together perfectly. The finished project is in NO way wobbly, unstable, or one side heavier than the other. The color and style are perfectly to my liking and matches my living room furniture nicely. It's a perfect size for an apartment, not huge, but not tiny either. IT's not very heavy(I was able to carry it to my 2nd floor apt), but it seems quite sturdy. I don't know why people had so much negative stuff to say about the assembly. Maybe they improved their schematics after so much negative feedback on that?? In my case this was the EASIEST to piece together out of all 5 pieces of furniture i bought online this month. Granted we used a power tool, which saved a bit of time. And two people are faster than one. However, had I not enlist James' help, I would definitely still have been able to do it myself, albeit maybe spending 60 to 90 min instead of 30. This is totally a one-man(or woman) project, no heavy lifting or trying to hold 4 pieces with 2 hands. If you are wondering if you should buy because the assembly sounds so daunting, don't hesitate, buy it! It's so very simple. In short, I am so very happy with the coffee table.", 
    "This coffee table is absolutely fantastic. I use coffee tables as desks as I do sit on the floor as it is my preference. Now what's awesome about this table is that it can take a very large amount of weight. The site does not specify the weight tolerance but I have to say I sat on it for a little while to test it out after I assembled all of it. I only weigh about 130 but it could hold me without a problem. I would like to also state that any reviews stating that 'it was too hard to assemble' is a load of bull. I assembled this entire desk with a phillips head screwdriver and the pieces provided within the hour that I had received it. I probably could have assembled it in about 30 minutes if I had a power drill. Keep in mind this desk isn't super heavy but it's still pretty heavy. Excellent desk, Excellent buy. 10/10 would buy another.", 
    "Everything is right about this coffee table. Mine did in fact arrived in 3 days, very quick. The quality and the design is amazing, and the price is such a bargain for such great qualities. I highly recommend it.", 
    "First a word of caution: this table comes in may parts with only schematic diagrams as instructions. There are several different screw lengths, wood pegs and fasteners included and the pegs require wood glue(included). for a person who isn't handy its a challenge. I gave it my best shot but finally set it aside until a handyman who was hired for another home project put it together in about half an hour for twenty bucks. Once assembled the table is quite large and useful. Its very solid and could easily handle a large stereo system or TV in addition to its use as a standard coffee table.", 
    "I'm very amazed of how fast the coffee table arrived after I purchased it online. Less than 3 days and arrived in perfect condition. Easy to assemble table and the quality is great. Very sturdy and very unique in style, I love it. It goes great with the rest of my stuff and just the style alone makes the table stand out. Very good price table with great quality.", 
    "The wood used is actually pretty thick for this table and I love the black wood grain look.I would have rated the table 5 stars but where the shelf attaches underneath the table the screws come loose very easily and in my case required me to purchase some wood glue to seal them in place. I do move the table around a lot so likely it it were stationary at all times I would not have had the same issue.. This is a great table for the cost!!", 
    "This was very easy to put together. The instructions were very clear except for at the very end when I had to make a support for the part that looks like it's \"floating\" and at one point it was unclear how to use the semi-circle shaped pieces. You need a Phillips head screwdriver to complete this task.I have one screw left over but the whole thing is staying together so....... haha :)", 
    "I was searching for a coffee table I could sit at for a little while and this one is perfect. It's sleek black and remarkably sturdy. Assembly was a tad difficult, but only took around 20 to 30 minutes with two people. The surface does retain smudges and kind of irks me, but it's a minor problem in hindsight.All in all this is a highly recommended product!", 
    "I've had this table for almost 1 year now and I love it. It is easy to clean. The little storage area is great. I put it together all by myself in about an hour or so. My boyfriend tightened some screws just to make sure. A great sturdy table at a great price!", 
    "I absolutely LOVE this coffee table... and it was so easy to put together. I did it myself (and trust me that's a big thing) :) Stylish, unique, well made and sturdy. I absolutely recommend this item.", 
    "This was a great buy!! I purchased it over 2 years ago and it is still holding strong!", 
    "While I love this table and its design I feel I should warn you that the design makes it fragile. Whatever you do, don't drag it when moving it. Ours snapped irreparably.", 
    "This table looks even better in person. The black wood is very nice, i would just advise while you assemble it to keep it flat on a rug or a towel because the corners can chip quite easily if you lean it against a wall. Other than that it was very easy to assemble. The instructions are only pictures with no description and even so it was very easy to put together. This table looks elegant and is very sturdy! Definitely recommend!", 
    "If you don't mind putting it together in not an outrageous amount of time, this is your table. The surface is wood grain and repels stains and water...and for just over $125 it cannot be beat....even for 5xs that price.", 
    "Was looking for something that would go with some of my **** furniture, but that had a little more spunk and storage. This fits the bill perfectly! It wasn't too hard to put together, and seems very sturdy. Arrived in only 3 days with no damage. SO HAPPY :D", 
    "I have owned this table since 2012 and it still functioning perfectly, even with a growing child! Great, sturdy surface for a little one to play on and the only scratch/chip it has is from ME when I thwacked it running the vacuum.", 
    "I love this piece! It goes perfectly with my red couch and gray wall. This was the first thing I have ever put together. It took some time but the directions were very easy to follow. Make sure you have tools handy. I highly recommend it!", 
    "Nice quality. Very good price. Not flimsy. Easy to put together. Nice lines. Looks terrific in my great room. Very happy with this purchase.", 
    "This coffee table was perfect. The size is great and the color makes it look very chic. I really like the unique modern feel and style!", 
    "Nice looking table but couldn't assemble. I've ordered alot of items from O that needed assembly and never had a problem. I just put together a dining room set 2 days ago from O, before that I assembled a large computer desk...6 years ago, I still have the desk, it's survived 3 moves and the thing still looks brand new. For this table, all of the pieces and parts where there, but the nail holes were not in the right place, the screws wouldn't go down into the holes for 50% of them. I tried to start over but once you get the silver locky thingys in there you can't remove them. I am really good at essembling these types of pieces but this one literally made me cry. I you simply must have this table I suggest hiring a professional to put it together.", 
    "Love it, but giving it 4 stars because smudges show a lot on the surface. Otherwise, a great piece.", 
    "This table looks good and has some interesting aspects to it but is made from pressed wood/fiber board and doesn't hold up. We slid ours across the carpet and the foot broke....the pegs broke off inside the bottom piece. We have used wood glue to repair it but it's still not repaired. I would not buy another one.", 
    "This is a nice piece - I've had my kids climbing on it and it seems sturdy enough - they've also left drinks on it and left greasy hand prints - so far it has been easy to wipe off with no residual stains/marks. I didn't want to invest in an expensive piece as kids just ruin things, so this is a great compromise because it's held up to their abuse so far and looks great in the living room. Husband put it together so I can't report on assembly.", 
    "Love the set up of the table, very handy storage. Slides around on my hardwood floors (even after I added grips on the bottom). Shows fingerprints and other smudges a tad too easily.", 
    "I guess you get what you pay for. But I loved the unique design. Be careful, it always seemed to leave streaks no matter even if I just used a plain damp cloth. Not initially, but after about a year. I couldn't get them out. I happen to favor real wood, no more composite anything for me.", 
    "Seriously, follow the directions. It was such a pain to assemble.", 
    "This table was purchased for my son's first apartment. It looks very modern and sleek and was very easy to assemble.", 
    "looks real chic...a bit larger than I wanted, but its just gonna have to work...not to bad to set up either, did it all by myself...single Black female! lol", 
    "the quality of this piece is great. very easy to put together and very stable.", 
    "This is very true to the picture that is shown here. It looks great in my family room. I would recommend it.", 
    "Cute but that's it. Took too long to put together. The instructions are not clear. It was missing a screw also. This table will not handle a move to a new location! It will break easily.", 
    "This coffee table is beautiful but it has a million pieces. It is very sturdy and the perfect size for my living room.", 
    "Great table at a awesome price", 
    "This unit was simple to assemble. It is lightweight, which makes it easy to move around when cleaning.", 
    "Love this coffee table! Modern, easy to put together and fab!", 
    "It took me forever to put this table together & the table is a little unstable on the side with the shelf. However, it looks amazing and is the perfect height to match my couch.", 
    "I just received this a few days ago.We managed to put it together in less than 30 minutes. It is a solid piece of furniture and it adds modern dimension to our living area.I really love it.", 
    "This table is great for apartment living. Its modern yet functional and has just the right height for a coffee table display.", 
    "It's not made of the sturdiest material, but for the price - I wasn't expecting top-quality parts. As soon as you open it, the numerous pieces and the variety of different screws and pieces made me think it was going to take me hours to put together. But I was pleasantly surprised at the fairly well written instructions.", 
    "Very nicely packaged. No damage to parts. I am very experienced with KD/RTA furniture and it took me a while to put this one together. Wood glue was included and helpful as I always glue the dowels in. Overall a good product, but very visible that it is not real wood in some areas. It is bigger than I thought, but also lighter than I thought.", 
    "It is a nice coffee table. I would recommend this table to anyone that needs a good product that is easy to assemble.", 
    "Very modern, clean look, Assembled easily, For $*** it is a great value, It is in my offcie lobby. Not sure how well it would hold up in a house with kids, but for this purpose it is perfect.", 
    "Sturdy table. Moderate effort to assemble with one person. Great addition to my lounge.", 
    "We enjoy our table, it smudges a little but it's easily cleaned and looks great in our living room.", 
    "Perfect table for my contemporary condo. My twin, 15 year old sons, assembled this item in less than 30 minutes with no problems. The table arrived timely, package well and I am very pleased! Thank you O :)", 
    "This coffee table goes really well with the all-black color scheme of my living room. I like that it has storage space and it's just the right dimensions.", 
    "Perfect for a yound person or very casual living area. Goes great with my decor!", 
    "It was easy to assemble and it took me just 30 mins to set up,and I am disabled", 
    "This was a gift for a college student who doesn't have a lot of room and wanted to maximimize space. The side shelves are very roomy and the table itself is wide and has plenty of area to put things on. She was able to assemble it on her own and is really enjoying the extra table space.", 
    "I like the table..not expensively made...but still a nice addition to most rooms...", 
    "Its big and looks good. But uses particle board and is clearly not sturdy. I am scared that if its lifted by holding on just to the top, it might completely fall apart. Assembly was not too hard - about 30 mins.", 
    "This table is very simple but with a neat little twist. It has a perfect magazine/book case area and then a large table area. It was really easy to put together with very few tools. The directions are very clear.", 
    "Easy to put together if you've assembled something before, directions are fairly clear, and the bits and pieces are nicely separated for ease of telling them apart. You'll need a Phillips head screw driver (the cross), but that's about it as I recall. Packaged nicely, though I'm against the use of Styrofoam. Looks great, and I'm definitely happy with it. It's nice and solid, not flimsy feeling at all.", 
    "really enjoy and a perfect fit, would recommend to others.", 
    "This coffee table was fairly easy to put together. It didn't take much time at all. It's a great size for a smaller living room, and the open cabinet is a great spot for easily accessible storage. I also love the way it looks!", 
    "i just put it together yesterday. its awesome. nice and sturdy", 
    "love this, it's just as pictured. easy to assemble (or my husband said so!", 
    "as above, i'd def recommend the table if you're not in a fancy apt and not trying to invest in somethng you'll keep forever. it's really great quality FOR THE PRICE. good looking", 
    "Sturdy. Good quality. Easy to assemble. Perfect size for a 12'x14' room.", 
    "Table was not easy to put together, finished product is not stable and has fallen apart many times. The surface of the table stains easily and fingerprints show even after wiping it off.", 
    "I was really happy with this coffee table! I like its modern design. It really pulls my living room together. The assembly instructions were super easy to follow as well and I put it together by myself in less than an hour. It also arrived in less than a week from the day that I ordered it. You rule, Overstock.", 
    "I like the modern design of this coffee table. It's practical in that there's under table storage, it's a good height, and it looks great. I can't speak to the assembly b/c someone helped put it together for me. It's definitely a great value and looks like higher quality than many more expensive coffee tables I looked at in stores.", 
    "Item looks far better in person than in the photo. Beautiful rich and elegant color and thick material makes it appear far more expensive than it was. It is in a room with extremely expensive furniture and it fits right in. A comparable table would cost at least $500 if not more if bought retail. It took my handyman under half an hour to put together. When I asked him if it was hard, he said piece of cake. You can't go wrong with this purchase and will be very pleased with it.", 
    "This is a great coffee table, modern style but also mixes well. The storage area on one side is a bonus. I have assembled plenty of furniture from Overstock and this was the most challenging! Took me about 2 hours, but I followed the enclosed advice and first identified and organized all the pieces. It helps speed up the process if you make no mistakes along the way. My experience with Overstock has been wonderful and I have saved so much money by being willing and able to perform the assembly of the pieces. I am woman---hear me roar! Also love my cordless drill-screwdriver. :)", 
    "great modern coffee table at unbelievable price. it took about an hour to put it together.", 
    "I bought this coffee table for the sitting area in my bedroom. Looks modern and chic. Only down side is that the weight of the table is not evenly distributed. The side with the bookcase leg is heavier than the other side thus the weight distribution is uneven; would tip over if you were to lean on the light end of the table.", 
    "It's a good price and a good deal - I'm very satisfied.", 
    "Very good piece of furniture at a reasonable price... easy to assemble and shipped in only a few days. One note: depending on where you place the table the storage area might not be that accessible.", 
    "Must admit my son put this together and he is very handy. Think it would be a bit harder for me, but absolutely love the product.", 
    "This coffee table is great. It looks great too. It was easy to put together. The table is made out of compressed wood but its nowhere near the cheap quality of ikea furniture.", 
    "I am completely in love with this table. It holds up much better than I expected. Somewhat tedious to assemble but not difficult, even if you're only one person. It's understated, simple but still interesting and unique. Exactly what I was looking for in my modern apartment!", 
    "nice design, nice look, not too hard to put together, don't think about it, do it", 
    "Love this table, Fairly easy to put together and im not that handy! To top it off this table is a great price and i couldnt pass it up.. It shipped fast and now its in my frontroom.", 
    "The table is a great value for the price. It's a bit larger than it appears in the picture. It is a very dark brown, almost black. It is very sturdy. We have set many glasses/cups on the surface and haven't seen any water rings/marks. However, we can see smudges from handprints, but that is easy enough to wipe clean with a damp cloth. And the smudges really aren't that noticeable in the first place. We are very happy with this purchase.", 
    "Love the coffee table. It looks nice and wasn't hard to put together. I'd recommend a drill to help. Great table for the money.", 
    "Nice table. It was fairly easy to assemble, came without a scratch and looks very nice.", 
    "We bought this to use for our 44\" tv as a console table and it fits perfectly in the space we use. Very easy to assemble. I wish there were matching accent table pieces which is why I didin't give it the full stars.", 
    "If you are looking for something fun and funky, this is the coffee table for you!", 
    "I purchased this to help set up a living room setting in a Metaphysical shop I am opening. it adds to the Zen feeling i was going for. I have already had someone ask me where i got it and the shop is not even opened....", 
    "Very great price with awesome quallity. Very sturdy and such a unique coffee table. I highly recommend it, it's a very nice coffee table to have. Great in price, quality, and the shipping is very fast.", 
    "Really intersting coffee table. So multi-useful! My family and I love th coffee table, so much table space, and storage for all other stuff. Plus the price is great with great quality and very sturdy I may add. Good coffee table to have in the home. My friend love it as well when they came over and wants to buy one. I told them where to buy it and that shipping is fast if they want to buy it right away and before it runs out. I highly recommend this coffee table.", 
    "I love everything about this table! Fast delivery, good sturdy quality, easy asembly and the price is very very nice, affordable.", 
    "This is a decent, inexpensive coffee table, and it was fairly simple to put together, I only once had to take apart and re-build a portion of the table (which is saying a lot for me, I usually have terrible trouble assembling furniture!). It's very stylish looking and goes well with both the modern and asian design furniture that I already had in my living room. The only thing is that it is not \"wood\" as stated in the description, it's particle board with a wood finish veneer. That doesn't take away from the looks of the table, and it seems very sturdy, but I wouldn't consider it heirloom quality or anything. Overall a very nice product for the price!", 
    "I was excited to assemble the table, but upon opening and looking at the directions, it was complicated to decipher. I needed help! Between the pieces being a tad heavy and instructions hard to follow... Luckily my uncle was able to help assemble the piece. Seeing how he did it, made it seem not that hard. But when I tried to originally tackle it alone, I had no idea where to start. There were a few times in the steps even with his help, that it wasn't clear which direction each piece went. But the equipment (tools) it comes with is very organized. Just wish the instructions were easier to understand. Once the table is assembled, I am now in LOVE with it!! I really love it! The height, the modern design... all of it, makes it very sophisticated!! It's a very sturdy piece and if you can manage to get through the assembly (took about an hour), it is WELL worth the price and the design!", 
    "This table added an extra elegance to my living room.", 
    "This table was very simple and easy to assemble, and it looks great in my apartment. I love the side cubby-hole and it's sturdy feel, in addition to the size. Though fingerprints show up rather easily on the surface (at least with my lighting), the table cleans super easily. Overall I'm very happy with the product.", 
    "It has all the room that I need and some. It was easy to assemble it myself and it was pretty easy. My coffee table is nice looking and very sturdy in all places. Oh and overstock shipped it to me within 3 days or I think 4 which is less than a week. Just perfect.", 
    "We got this to go with a more modern couch we just purchased. It looks great. It was VERY easy to put together and is very sturdy and appealing to the eye. Shipping was fast, as usual. Would definitely recommend this table to anybody in the market for a sleek, modern table!", 
    "This table is well constructed once its put together the look is sleek modern and a excellent value for the money ! I would reccomend this to anyone !", 
    "I'm so gald I bought this coffee table other than the other ones I saw online The table is so useful. the table top for a regular coffee table use, and the extra compartments are great! keeps everything neat in the living room surroundings and the size is perfect. i can't believe this is a coffee table. It's beyond all coffee table that I've ever seen.", 
    "At this time I'm temorarily using at as a TV stand which surprises me because my TV is quite heavy and this coffee table is able to handle it. Very solid, and good quality wood. I'm very impressed! Easy to assemble and Overstock sent it to me in short amount of time.", 
    "Love my table, very useful and functional. Easy set up, took us about 45 minutes and the finish product is amazing. It goes with everything and everyone in the family loves it. Very sturdy and very inexpensive.", 
    "The table is sensational! easy access storage space and the table top is sturdy. It was easy setting it up and delivery was great. Overstock did great in getting the item over to me is such short time. i get a lot of nice comments from friends when they see my coffee table, is nothing they've ever since before and they can't stop asking where they got it. I didn't want to tell them because I want to be the only one to have it. Very pleased.", 
    "I am very happy with my coffee table, is large and sturdy and lots of extra spaces for extra things. Assembly was easy and delivery at my porch in less than 7 days. very happy with my purchase.", 
    "I was pleasantly surprised by this greatly crafted coffee table. The incrdible look, wow! I have just easily assembled it, and it looks sensational. My coffee table is crafted to perfection, within quality and of real wood.", 
    "Great price and great coffee table fast shipping. Would buy from again. Looks great !", 
    "The table is amazing and a big hit with all of my friends. It is sturdy and it came to me without any default! Super fast shipping! I received this product within 3 days of ordering it! Thank you so much!! I will definitely be purchasing from overstock in the future. Amazing prices on products and shipping and outstanding fast shipping.", 
    "A very attractive and sturdy piece of furniture. Fast shipping, even though it's less than 5 bucks. Assembly was easy. The price is inexpensive and it is well worth what we paid for it. Overall happy!!", 
    "This Open Cabinet Table totally changes the whole look of our living room. Gives it a very airy feel and character now. I don't know what people are complaining about, but I personally really like this table and I think the quality is exceptionally good. I am pleased!", 
    "I really like the design of this table, it's not your every day coffee table and I guess that's partly the reason why I bought it. The other part is the affordable price. Overall, I really like it. It's heavy duty enough to hold up to my dogs running into it and climbing over it when they get overenthusiastic. After 5 months it still look as good as the day I got it. I'm giving it 5 stars for the heavy duty material and look combined", 
    "In a way, what you see is what you get with this product. It looks exactly as advertised. However, with a little creativity it can have many uses and be incorporated into any room. My boyfriend bought one table for his bedroom to use an office equipment desk, while I bought one of course utilizing as a coffee table. Unique look that allows you to transition from room to room. I'm happy with the purchase and think that it's worth the money spent.", 
    "Great table for the price. Very solid, and the best part is the assembly wasn't a pain. Maybe it's personal opinion but I really think I had a great deal buying this table. I love mine. :D", 
    "The quality of this table is very poor. It is particle board and paper - doesn't look at all like wood. The boards were warped and the table was very wobbly. I built it and promptly donated it to the thrift store as that seemed like less trouble than trying to return. Glad it wasn't my first purchase from Overstock, other items have been great. Don't buy this!", 
    "Just received my table. Wasn't sure about the purchase, but I sure am now. I love the look and the storage is great for my small apartment. Would recommend this absolutely.", 
    "Bought this for my sons studio apartment. He is very happy with it. Easy assembly, loves the look and the storage, plus a.nice wood grain. And you cant beat the shipping and the delivery Overstock offers! Once again Overstock delivers!", 
    "Very unique table. Easy to set up. You could see the wood texture and it feels very sturdy. I love the open pocket on the side. Very good deal.", 
    "This table looks really nice. Kind of easy to put together. Came packed good and glossy wood. Nice Overstock! I think the price for it is a little high, maybe about 70 is all it should of been.", 
    "It was less expensive than other coffe tables I looked at else where so I was nervous about the quality but it is great. Sturdy construction, not wobbly and is the perfect height for me to sit and eat while watching TV. Well worth the money. I really like this coffee table and I am sure anyone who buys it will like it too.", 
    "The plus is that this table is large and fairly easy to assemble. However, if you are looking for this coffee table to pull together a room that isn't a college dorm, then this piece may not be for you.", 
    "It's a nicely designed, nicely scaled table. Some might not like it while other might love it. I personally really like it. Not your typical coffee table at all...it's meant for a stylish apartment/house. Will recommend it.", 
    "Very happy with this table. only took 10 minutes for assembly. Wished we had purchased it sooner!", 
    "Fabulous for small spaces. It looks modern, fresh, urban and beautiful. It was super easy to assemble and has a nice weight. I love it.....", 
    "I can't really tell you what I think of my coffee table because I still have yet to get it together completely. During my first attempt several of the pieces were deffective. Overstock was great and sent me replacement but I still can't seem to get them to fit the way they should, not sure what to do now. Returning everything is more of a hassle. I'm sure this may just be an isolated inccident, but I am not happy to say the least. I have never had an issue with this before and I have bought items from Target and Walmart. I think I will stick to them for future purchases.", 
    "This coffee table is easy to assemble (15 minutes tops), has a modern/zen look, and is very affordable!A heads-up to all prospective buyers who want things to look perfect - the table's outer black coating is \"pasted\" onto the wood. So, while assembling the unit, if the screws are jammed in too tight, you'll actually see the black coating wrinkle and possibly peel off. I found this out the hard way. However, the manufacturer does provide a sticker-set (with the same material and texture as you see in the picture) that can be patched onto the damaged areas.Regardless, this table is well worth buying given its price and modern look. Similar tables at e-stores like ***** cost well over $200!", 
    "What a reasonable price for such a great piece of furniture. Assembly was s bit challenging but the after look is worth the time spent. It's a solid piece of furniture and the design is unique. I love it!", 
    "I can't see how anyone could not like this coffee table. Very unique design, good quality, the price is right and the shipping is uberly fast. I ordered mine on Friday and got my order on Wednesday. It came so quick that I didn't even have to time to put my other coffee table in the dent area yet. Easy assembly - no need to be a handyman to figure it out. All parts are separated nicely for you. Really, I can't see how anyone could not like this table. I love mine and all my friends rave about the design when they see it. Keep it up Overstock, I will continue to shop with your company more.", 
    "the look is sleek and fit well with the modern feel of my place. It is very easy to assemble and sturdy at the same time. Great design. Pricing makes it a no-brainer purchase!", 
    "First let me say that this table arrived well packaged, with all instructions and parts included ,well organized and clearly labeled, making assembly simple (although rather cumbersome). Had this been the first piece of furniture I'd ever purchased from Overstock, I would have never, ever again considered buying from them in the future. This coffee table is NOT wood/veneer as advertised. Its particle board and the \"veneer\" appears plastic/paper. Overall, it looks the quality (perhaps lower still) of something one might find at Walmart. I am very, very disappointed. I have never (at any price) seen such shoddy quality from Overstock. I would strongly recommend NOT purchasing this very cheesy coffee table. I am embarrassed to have it in my living room, and despite it being new, I seriously doubt I could recover even half what I paid for it!", 
    "This item states that it is 24\" High - it IS NOT - only 17\" High - so am disappointed with the product. It's a nice looking table but definately not as described.", 
    "This is a great coffee table. We found it easier to put together than most ready to assemble items from other stores. It's sturdy and unique. Yes, it is worth every cent spent on it.", 
    "I love this coffee table .... though it took a while for my uncles to put it together ... it looked great once it ws finally together.", 
    "I've been looking for this kind of design tables for a very long time; yet never lucky enough to come across it until now. My frriend recommended that I go on Overstock and I am glad I did. Saw this, ordered it, got it within 3 days, well packaged and assembly is little to no difficulty. The look is very unique and modern. Most importantly is that it still offer that traditional look. A perfect height with our sectional. I actually used it in the back of our sofa because it has a great shelf to display picture frames and store books underneath the open shelf. Perfect and sturdy table. Thanks Overstock. Don't hestitate to buy if you're interested, it'll be a smart buy.", 
    "The top part of the table doesn't fit well and comes loose when being lifted. I liked that it came with stickies to hide the screws.", 
    "Appearance is modern, easy to assemble if you have experience assembling furniture. I suggest reading the whole instruction before starting the project.", 
    "This is a great looking table...if you can ever get it together. Took me 5 hours, and I'm not a neophyte at putting things together- but the first 2 pieces had holes drilled in the wrong places, or not at all...as did the last 2 pieces. By the time I was done getting out my drill, and fixing all the problems- I was tired, had blisters and swore I would never assemble anything again. But, I will say.. once you get it put together, it does look great. By looking at other reviews, I guess it'd just luck of the draw if you get a good table, or a bad one.", 
    "The table is easy enough to put together. The black shows dust easily, I didn't think ahead about the color but the quality is decent for the price.", 
    "Once assembled it's pretty nice but it wasn't an easy road getting there - for one, there were no tools included to install screws so plan to use your own screwdriver. The directions weren't great and some of the pieces didn't even fit. The finish isn't top quality either, it scuffs pretty easily. I like it now that it's done but I wouldn't want to go through it again.", 
    "I received a defective product, but it was too bulky and difficult to return. I have been trying to find a way to make this product assemble correctly for a month. I'm giving up. Unfortunately, I'll never buy furniture from Overstock again.", 
    "this coffee table looks very good, quality is perfect , but the shipping was bad , the top of the table was chipped when i opened the box. i like the style in overstock. just the shipping need to improve.", 
    "the product was junk! would not recommend to anyone.", 
    "The table was not worth a penny. We bought it a week ago and we have already put it at a dumpster. The assembly instructions are extremely difficult to interpret in the sense that multiple steps have been inserted in just one picture without actually giving any written instructions per se. I and my husband are generally very good with the assembly process but it took about 8 hrs for us to assemble this one. The cabinet side was highly unstable and you cannot shift it without tearing off the cabinet. All in all, not a good buy, highly dissatisfied !"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Open-cabinet-Coffee-Table/4374749/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/4374749/Furniture-of-America-Open-cabinet-Coffee-Table-806ae80a-c5fd-4886-a943-fedc00a49bfc_600.jpg"
  ], 
  "description": "Reduce clutter, and elevate organization to Zen-like heights with this sleek and modern Furniture of America coffee table. The table's clean lines beautifully showcase the wide-open and easy-to-access storage compartment below, ideal for housing reading materials and remotes. Stretch out on the floor with your legs tucked under the open area, and use the solid table surface for dining, writing or computer work.Sleek and clean lines evoke Zen-like simplicityGenerous compartment underneath is perfect for storing books and suppliesSlide your legs into the open cabinet to sit on the floor and work or dine on the tableStore pillows and throws in the open cabinet area to maximize space in small living quartersStyleContemporary, Modern, TransitionalMaterialMDF, Veneer, WoodTypeCoffee TablesFinishBlack FinishShapeRectangleAssemblyAssembly RequiredColorBlackFurniture Frame MaterialWoodFurniture PatternSolid"
}