{
  "name": "Furniture_of_America_Stevie_Black_Finish_Hidden_Storage_Coffee_Table", 
  "price": "EUR 183.01", 
  "reviews": [
    "my only complaint is that there was one little round screw lock missing from the packaging - easily found at the hardware store, though. so, let's begin the praise: the fit and finish of all parts is great, looks very nice, i'd say it looks more expensive than it was. the shipment packaging was really well thought out, absolutely no damage to anything inside the outer box. the storage compartments are bigger than i thought they'd be, so this was a nice surprise - perfect for hiding medium sized organizing baskets inside with room to spare. i think this piece was thoughtfully designed, all the way down to the felt floor protecting pads and the hardware that keeps the storage compartment lids from over-extending. super pleased - would totally recommend it to others.", 
    "I was sceptical ordering this table since it was very inexpensive but the quality seems to be good so far - better than anticipated. I would recommend this product to anyone looking for a modern coffee table. I received the table within a reasonable time frame- well packaged and in good shape, no scratches or anything. The assembly was fairly easy, even though it took about 2 hours. But the result was great. I'm happy with my purchase!", 
    "a sharp, modern table. shipped in one large flat pack. moderately easy construction on par with an ikea product. is not especially heavy so it may move around a hard wood floor if one were to put one's feets on it. that's right i said feets.", 
    "I really love this table. I am a young female and put this together in about two hours without any problems. Would definitely reccomend to other people", 
    "This is a large coffee table and I love it. We have it in front of a large sectional sofa and it looks great. The two storage areas are much bigger and deeper than anticipated, which is a bonus. We keep a hundred CDs and DVDs in one side, along with a portable DVD player and all the connectors, and the other side has all our remotes, pens/pencils/paper/scissors/nail clippers/drink coasters/napkins, etc...for the lazy at heart! We like the glass insert a lot. It reflects light from widows and lamps so the black color of the table doesn't seem so heavy. The glass insert is held in place above the alcove by four small suction cups, but seeing them was distracting to me, so with the suction cups still in place I pencil-lined along the bottom of the glass, then cut 4 pieces of a 3/8\" square dowel, painted them black, and then followed the pencil lines to align and glue the top of the square dowel pieces around the alcove to serve as a framework for the glass. It turned out perfectly. Use a good wood glue or epoxy and let it cure for 24 hours. There is nothing negative to be said about this awesome table that is definitely a bargain for the price and was assembled by my hubby alone, even though two people are recommended.", 
    "I really like this coffee table, with the 2 compartments, it is perfect for my family room. It was not difficult to put together, I am a single woman, and I just took my time with the instructions ad it went together perfectly. The only reason I did not give it 5 stars, the glass scratches easily.Otherwise, I like it very much.", 
    "Arrived on time; had some friends put it together; great storage space; exactly what i thought it was going to be", 
    "I like the table but the top had a scratch in it. I enjoy the hidden cabinets and the black wood grain finish. The scratch wasn't enough for me to want to return the whole thing but if I could get the one piece replaced that would be nice.", 
    "good storage but edges started ripping of on all sides in less then a month", 
    "Solid table, not flimsy or lightweight. Great quality for the purchase.", 
    "This is my favorite coffee table to date, and I've owned at least ten of them. It's slick to look at, has tons of storage, the glass panel makes it even classier, and the open storage allows for some creativity, since you do't really want to put anything down on the panels that open up. The only downside is the sharp corners, but we put rubber corner pieces so that's not an issue anymore. A truly attractive AND useful piece of furniture.", 
    "Was a present for my daughters birthday. She loves it.", 
    "Easy to assemble if you follow the instruction and a bit on the heavy side. Overall, happy with it.", 
    "It was bothersome to put together, but I like it.", 
    "Looks good & worth the price.", 
    "could use stronger pieces to hold compartments open", 
    "Surprisingly this item arrived in great condition, although the carrier wasn't as careful as they should have been, the carton was dented and ripped - but because the contents were wrapped so well, no damage at all.The table took about 2 hours to assemble with one person, but it looks great. Heavy as anything - sturdy, and a lot of storage so things don't look cluttered.", 
    "Nice looking furniture except for damage from first shipment . To sharp corners . Overstock was great though and took care of problem right away .", 
    "like the hidden drawers on either side", 
    "When I was looking at options for a coffee table in the basement, I was looking for something that would be big enough to hold two large pizzas and also have enough storage for all the remotes that we tend to accumulate.This serves the purpose to the T. It has great storage for all the remotes and XBox controllers on one side and also easily stores a roll of bounty and clorox swipes in the other. The only con I think is that the edges are mighty sharp and a hazard if you have tiny people running around but then again, you would have already thought of foaming the edges in the first place.", 
    "Easy to assemble, great piece for my living room.", 
    "Love the two secret compartments ...sturdy table", 
    "holds up with two messy boys in the house. Modern look. can't beat the price!", 
    "Our daughter loves her coffee table! One side came damaged and Overstocks quickly sent a replacement part. The table has a lot of storage & character.", 
    "Took some time to put it together, but once it done it a great coffee table. Fit into our living room area nicely and the storage functionality is very useful.", 
    "I bought this table because it had a modern look to it and also function. I like the fact that it has a nice glass top in the center and at the same time it has lots of storage room on the top two sides. Its very steady and it has a mat finish wood grain that looks great with out giving off shiny glare of the surface. Its well made and easy to construct, just keep in mind that is a bit heavy, so you might want to assemble it in the room or close to it. The side storage is great for movie storage or magazines. Happy with this one.", 
    "Very reasonable price. The quality for the piece is also quite nice considering how much it cost. The directions are easy to follow and sturdy once put together. No complaints yet!", 
    "This is such a pretty table. It looks so chic in my living room. It is a great size to fit boardgames on top, and I use the two drawers for all my boardgames and card games (trust me I have a lot). This makes it such a functional table that also looks great. A bit of the wood started peeling up from the bottom, but nothing that a bit of gorilla glue won't fix. I highly reccomend.", 
    "It looks just like the picture, but not as functional as I would have liked it to be. Kind of a pain to clear everything off before you can get in to the compartments. Pull out drawers would work better", 
    "I love this coffee table - the glass panel in the center keeps it from being some monolithic block in your living room and the storage compartments are so useful for getting rid of clutter. It takes a little while to put together, but the end result is very nice. I will say I was disappointed in how it was packaged because there was a piece that got damaged (fortunately it is not a visible piece). Overall, I'm pleased with this purchase.", 
    "This table fit perfectly in my living room.", 
    "For the price - perfect - looks good - It is far better than what I would get at ikea for this price . Even though its particled wood its heavy and solid.", 
    "Takes a long time to put together. Take your time. Once together it looks and works great.", 
    "I was hesitant to purchase this because of previous reviews. However, all of the holes lined up perfctly and all the pieces where there without any damage. The one thing I will say though as it will take some patience and some time.", 
    "This black storage coffee table looks quite nice and am proud of my purchase! It did take a little while to put together as others stated (about 2hrs?), but wasn't difficult to put together on my own with a few basic tools. Great place for storage of my boys' school work, and after using our new \"homework\" table, papers are hidden away quickly. I bought a nice medium weave basket to go between to jazz it up even more! Nice value buy; especially when there is a % off and free shipping! Definitely recommended.", 
    "I love this table!! Such a beautiful piece! Little frustrating that the price dropped $$ after my purchase. Still happy with it none the less. Seems built sturdy enough to last through the years. You will need 2 people to piece this together just based on the size.", 
    "I am a handy female so it wasn't hard to assemble. I did realize something I didn't read in the directions that could have saved me 30 minutes, Place the lugs in boards with opening facing the hole first so screws easily slide and tighten with no problem. I did the opposite, duh! It is a solid product, it isn't real wood so be careful when handling corners on hard surfaces. It comes with a black marker for to cover dings.", 
    "This table is great once put together, HOWEVER, it took 3 people to put it together. Instructions were not that clear.", 
    "The table came in a flat box with a bag of alot of parts . Separate everything first to make sure what you have and look over all of it. I like this table it is a lot smaller than my original table . Putting it together is not fun . their are alot of parts and is very overwhelming . I have put together alot of furniture before it is not the hardest but may come secongd to that . If u can complete the task you will be very happy looks great and it grew on me very fast . i love this table . made very well and for the price i guess its good it should be a little cheaper just cause you have to put it togetherr . . all in all it is a great replacement for the one i had and looks great . if you have put furniture together before should be no problem if not good luck you can do it...", 
    "Lots of pieces and takes a whole to out together but it is worth it. The storage compartments are lager and useful,", 
    "I love this table. Price was great, quality is nice and the storage compartment is really cool - we keep a warm throw in there for the winter. It has a ton of small parts and took two hours to put together between the two of us but well worth it. It looks overwhelming when you open the box and take out all the pieces but once it's put together, it looks great. Definitely use a power drill - it will make it a lot easier and faster to assemble. We shopped all over and looked at tons of coffee tables until finally settling on this one and for the price, it can't be beat. Delivery was also super fast and product arrived in great condition.", 
    "Great looking storage coffee table. The only downside is it takes a while to assemble but hey its worth it. Very unique.", 
    "Great product once you get it together. The peg and screw alignment took alot of organizing to get together but once together AWESOME table. Great quality. The drawers are much deeper than I anticipated and store ALOT. Great look too.... Overall AWESOME table", 
    "Great item for the price I paid, shipping was quick and assemble was simple as well.", 
    "This coffee table turned out to be much, much better than the photos suggested. \"Awesome\" was the way my friends described it when they saw it for the first time. Extremely stylish and compact, with tons of storage space in the two hideaway lift drawers and under the centertop glass, without taking up too much overall living room space. Yes, it's going to take you four-five hours to assemble if you're working alone. And yes, the final assembly steps, screwing the hinges to the two top drawers, are a serious pain (use a drill). But you'll be very pleased with the end product, especially for the price.", 
    "Has storage space but quality is questionable. Rather bulky need lots of space in the living room", 
    "I had been looking for months for a new coffee table, and just could not find the right one for me. Then I just decided to try Overstock after seeing a commercial. I am so glad I did. I love how this looks in my living room. I also cannot say enough about the excellent customer service! UPS had damaged the first shipment, but I had my table by the next week!", 
    "I don't believe the manufacturer has ever assembled their own product. It was so frustrating for my husband and I both. It took us 5 hours to build. Lots of holes were off center and seemed impossible to fit where it was supposed to. And the glue they provide you must use sparingly. We realized after gluing the first few holes that we would have to go very light, as you glue down each of the wooden pegs. We are still not sure if it was worth it in the end. Yes, the coffee table is great, but I would not do it over again. I would save the time, effort, and frustration and buy a more expensive table with no assembly required.", 
    "Fantastic coffee table!!! Very easy to put together took maybe 30 min by myself. Love the storage options under the glass and hidden under the lift up top. Great size and perfect height to put your feet up!", 
    "A pain to put together, but well worth it. Looks great. Has great utility. Very stylish.", 
    "I saw this table and thought it would be a nice touch to my living room. Liked the color, the glass panel and most of all the storage. The table shipped within a few days which is great. Getting it delivered was a nightmare. Overstock does not allow you to have any input on shipping and sent the table UPS. UPS wouldn't give me a sense of what time it would arrive other than the day. I had to take a day off work to wait for the table, only to find out at late that morning that the table missed a connection and wouldn't be delivered until the following business day. I had to have someone come to my house to wait for the table, as due to missing time from the hurricane I couldn't miss another day of work. UPS didn't attempt to deliver the table until 6pm, despite saying someone had to be there from 8:00am. Then, the driver couldn't carry the box himself so informed us we would have to wait until he finished his entire route to go and get another person to help deliver the table, or my friend had to help him which he did. The box is 75lbs... When we opented the box there was major assembly to be done and the wood product was much cheaper than it looked. Directions are not clear and when we attempted to fit one of the pieces together it broke a hole in the table. Thankfully, the hole was inside one of the storage drawers as it was too late to take the table apart and return it at that point and I coudn't take another wasted day by UPS. Once assembled the table looks okay, but if I had to do again I'd have paid more for less hassle and a better quality table."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Furniture-of-America-Stevie-Black-Finish-Hidden-Storage-Coffee-Table/7348106/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7348106/Stevie-Black-Finish-Hidden-Storage-Coffee-Table-907a067e-a146-477c-b78c-4800bbacacdf_600.jpg"
  ], 
  "description": "Add a touch of contemporary style to your living space with this\nStevie storage coffee table from Furniture of America. A glass\ncutout in the top provides space for drinks and snacks, and a roomy\nstorage compartment below provides room to keep frequently used\nitems within easy reach. This wood coffee table features a sleek\nblack finish that easily blends into your decor. Color: Black FinishMaterials: MDF, Wood Veneer, GlassModern design with great featuresA great rectangular table top with mid-glass insert for added\n  modern styleTable offers an open shelf for easy access storageTwo hidden storage is revealed once both sides of table top\n  is liftedBoth hidden storage space is perfect to keep living space\n  clutter freeTable is nicely supported by thick sturdy baseDimension: 16.9 inches high x 47.2 inches wide x 24 inches\n  deepStyleModernMaterialGlass, MDF, Veneer, WoodTypeCoffee TablesFinishBlack FinishShapeRectangleAssemblyAssembly RequiredColorBlackFurniture Frame MaterialWood"
}