{
  "name": "Genuine_Walnut_24-inch_Round_Coffee_Table", 
  "price": "EUR 110.76", 
  "reviews": [
    "This is a beautiful well made solid wood table. The walnut grain is just beautiful. It's hard to find solid wood furniture these days. Mine has a plaque on it that says made in the USA. I only wish this table came in larger sizes and matching end tables.", 
    "I was looking for a small coffee table to use in an office space, and found this one on Overstock. It works perfectly if you are looking for a smaller size table to use as a coffee table. The table arrived promptly and in great shape. Thanks.", 
    "Nice table for the price. Fit the space.", 
    "Sturdy, well made, and looks great! I would order this table again!", 
    "This was her easy to put together and looks great! The finish is not too glossy and really has a mid century vibe.", 
    "Nice Quality table at a great price"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Genuine-Walnut-24-inch-Round-Coffee-Table/10305404/product.html?recset=bbd1c0d9-3866-4ebc-a44d-470c2e3edb03&refccid=YMLL7KGZNVZKP32OYHN65NFVEY&recalg=828,512&recidx=8", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10305404/Genuine-Walnut-24-inch-Round-Coffee-Table-3c098d6e-685c-4dee-a7e9-c7cb6e3e0cea_600.jpg"
  ], 
  "description": "With solid wood construction, this coffee table is a perfect\ncomplement to your conversational area. The round table design is\nwell suited for a circular couch arrangement or a gathering with\nmultiple chairs. The natural finish brings out the beauty of the\nwalnut wood grain pattern and adds warmth to your living room\natmosphere. Made from American walnut24 inch round table topOne (1) inch thick American Walnut table topIncludes One (1) coffee tableWeight: 14 poundsDimensions: 17 inches high x 24 inches wide x 24 inches\n  deepShape: RoundType: Coffee TablesStyle: ContemporaryMaterial: WoodAssembly: Assembly RequiredExact Color: Natural WalnutFinish: Natural Walnut FinishColor: BrownStyleContemporary, Mid-CenturyMaterialWoodTypeCoffee TablesFinishEspresso FinishShapeRoundAssemblyAssembly RequiredColorBrown"
}