{
  "name": "Greyson_Living_Windham_Solid_Birch_Iron_Coffee_Table", 
  "price": "EUR 292.39", 
  "reviews": [
    "this table looks beautiful. The wood is great quality. The assembly was simple. I recommend to position both peices of wood in their alloted spaces before putting in the screws or you might have to loosen a few to put in the lower peice of wood. The rot iron looks elegant and the measurements are perfect with my new couch. The wood is durable so if your glass leaves a water ring no worries just wipe it. The table is heavy so if you put your feet up it won't slide out.", 
    "I love this coffee table. It is a good size and looks like a quality piece even though I got it for a good price. I was surprised at how nice the wood was, I was expecting a cheaper look but it looks and feels heavy. Compared to all the coffee tables I was looking at at Pottery Barn and West Elm, this is a good quality piece for a great price. I saved hundreds of dollars going with this coffee table and I think it still looks like a good Pottery Barn piece. I'm very happy with this table.", 
    "This would have been a good table for us if not for the faux \"distress\" marks made at the factory. At first we thought it was a manufacturing problem as we couldn't imagine anyone would want 6 symmetrical 3\" black gashes on the top and the shelf (12 total). There are 3 - left and right on each shelf and they are the same length and similar positions. It's so very odd. The rest of the top has a smooth factory finish, so the contrast is grating. Everyone here looked at it and said - \"What the heck happened here?\" It's not even remotely believable \"distressing\". Looks more like an intentional act of vandalism. The picture on the O website is misleading, even enlarged to the max, you don't see the black gashes. If I had time, and it was cheaper, I might have considered sanding the whole thing down and refinishing it. The rest of the table is fine - seems sturdy enough and it is solid wood.", 
    "I love his coffee table! It looks like it came from ******* ****. It is really stylish and well made. It wipes clean easily. The quality is amazing for the price!", 
    "If you're doing this on your own, be ready, Not only is the box bulky, it's also pretty heavy and hard to maneuver. Instructions were included and were pretty self-explanatory however...more instructions would have been nice.Here are some tips:1. Don't tighten any of the screws fully until you have the shelf installed otherwise you'll never get it into position.2. Tip the table on it's side to install and mount the shelf3. Then and only then tighten everything down. It took a lot longer for me to assemble it as tightened everything down before installing the shelf.Strong and sturdy table, great style, nice finish", 
    "I purchased the coffee table in a bundle with the square and round end tables. The furniture is stylish and sturdy...very well made. The shelves are solid wood and the finish is beautiful....very high end. All three pieces were easy to assemble. I would highly recommend this set for anyone looking to go with a modern industrial look", 
    "I am always a bit reluctant to buy furniture online but this table did not disappoint. I was looking for something with wood and metal and a bottom shelf and was finding it very difficult to find one that was large enough for the space. This one has exceeded my expectations and I have received several compliments.", 
    "We purchased this to go with the matching end table and fortunately this looked much better than the end table. The end table had large gashes in the wood to make a \"reclaimed\" look that looks more like damage from shipping. This coffee table looked nicer and the \"gashes\" were more hidden and not as noticeable. We also had one of the bottom legs of the end table missing holes to attach the bottom wood piece and fortunately the coffee table had all required holes to secure the wood with screws. It is a very nice piece as long as the gashes aren't noticeable and all the holes are where they are supposed to be! I still think in the future we will pick out our furniture in person and not buy any more furniture from Overstock.com!", 
    "This table was really nice, but pay attention to the measurements, because it is very large!", 
    "I went out on a limb and bought this coffee table from Overstock.com and let me tell you, BEST choice I could have ever made. This piece is so elegant, so refined and rich looking. The table top is absolutely gorgeous! Paired with the x crossed metal frame legs and this piece completely changed the decor of my living room. It looks like a million bucks, but cost practically nothing! If you are contemplating this item, and it’s not sold out yet, I INSIST that you buy it. It’s that good looking. I just bought the matching side tables this week. Can’t wait to see what they look like.", 
    "My boyfriend put this together in less than 20 minutes under the supervision of my 6 year old daughter! Well built, solid and highly recommended. In some reviews people commented on the \"fake distress marks\". Honestly, I didn't even notice them. They are there but don't stand out--especially once I placed my decor on top of it. If you are considering purchasing--go for it!! Well worth the purchase both aesthetically and financially.", 
    "great, sturdy, large, wood table. It is perfect. It is definitely big and the marks on the table that people have pointed out are certainly visible, but they have really grown on me and don't bother me", 
    "It's a rustic, sturdy coffee table. I love the iron sides, give it a great look. I did not check out the dimensions before I purchased it, and that was my fault. It's much bigger than it looks online. Luckily, my living room is big enough to hold it, if not, i would have had to return it. Pls make sure you measure your space. It's big enough to eat dinner on it and serve up lots of plates and platters for a party. It's a nice semi-dark wood finish. It had 4 little nooks/creases on the top and bottom of table. Not too noticeable but def there. i was going to return bc of that but still looks great and adds to the appearance of vintage, rustic. There is also enough room on the bottom shelf to put books and even a cute suitcase trunk as decor. Overall, we love it and want to get the matching side tables and TV stand.", 
    "I was so impressed when this arrived. It looks even better in person - as though I spent a great deal more on it. Honestly, it looks like a $1000 coffee table,. The wood is heavy and the frame is sturdy. Very pleased.", 
    "I love this table. It looks better in person and the shipment came earlier than expected. The only bad thing was the directions it came with didn't specify which piece the table top was. We had to guess... A little bit of a headache... But other than that, I'm very satisfied with the quality!", 
    "Sturdy table. A little tricky to put together, it took two people for sure. I'm impressed with the quality and price. We had looked for a similar table in a million other places and they were either too cheap in quality or too high in price. This is a great medium. It is beautiful and feels like it will last.", 
    "I was pleasantly surprised when i saw this coffee table. I bought it for my daughter and her boyfriend for their new apartment and I was shocked to see the quality and value for my money!", 
    "Perfect size for our family room and large 10 person sectional sofa without looking too small or take up too much room as I had considered a larger square shaped table. Super easy assembly and its heavy enough to take feet resting on bottom or top. I love it especially for the price.", 
    "Very nice and sturdy. Love it.", 
    "Nice, sturdy table and easy to put together. Love it!", 
    "Okay, so reclaimed wood seems to be all the rage right now. Well, this is a beautiful piece of furniture. Does it have imperfections? Yes. That's why it is reclaimed wood. But imperfections only add to the uniqueness of its beauty. The price is excellent as you can see by checking out comparable pieces at Pottery Barn and other high end stores. It's a good deal. I'm satisfied because its aesthetically pleasing and, I believe will last a long, long time. Keep those deals coming, Overstock...I'm loving it!", 
    "Very heavy, great quality. Looks like pottery barn stuff. Easy to assemble, needs 2 people but quick assembly", 
    "nice quality, heavy piece", 
    "Heavy, full wood table top! Much better than expected for the price. Recommend highly. Perfect fit for my eclectic design style in great room.", 
    "Easy to put together and looks great. It is very nice quality wood. Excellent buy for the price.", 
    "Perfect coffee table! It's really large, easy to assemble, and the wood is gorgeous.", 
    "not fancy, but good for a casual location", 
    "good quality and easy to assembly", 
    "This table was quite easy to put together -- everything lined up like it should. It is really quite good looking -- we love the two-tier design. The stain is pretty much true to the picture. It is also very sturdy.", 
    "Love the look of this table. Easy to put together. I hate the \"fake distressing\" of three deep groves on one end and two on the other. Fortunately they are easy to cover with books, flowers, etc. Why, oh why would they think this is a cool thing to do??? The table has a very cool loft/barnwood vibe and It's great otherwise.", 
    "Nice table but it has some man made markings in an attempt to give it a rustic look, could have done that without the markings.", 
    "I needed a coffee table but was worried that it would take away from the rest of my family room. This table is perfect, and even better, it is so easy to assemble. It's functional without stealing the spotlight from other pieces in the room and blends in seamlessly. I love having the bottom shelf. And it's a great value!", 
    "I absolutely love this table. Was super easy to put together, my 9yr old petite daughter was able help me do it!", 
    "Great quality for the price.", 
    "Beautiful table! It's well made, solid wood top and shelf, medium stain color, nicely distressed. For the price you can't go wrong.", 
    "nice finishes and easy to assemble.", 
    "I'm really impressed with this coffee table ~ it looks more expensive and it's solid. It was a bit hard to get the bottom shelf attached, but one reviewer wrote to say to tilt it on it's side and that worked. Overall, very happy and would definitely recommend.", 
    "I bought this coffee table for my first new home, and it came in a timely matter and was fairly easy to put together. nice size for any type of room and luv the wood tones", 
    "Easy to assemble and sturdy coffee table. Great price, too!", 
    "Very high end looking at an affordable price.", 
    "This is a solid-feeling piece of furniture with great hardware! It's stylish and a bit industrial-looking with the metal and wood. Love it! I would recommend. I own the matching side table and am pleased with it too.", 
    "Sturdy, nice color wood, distressed imprints in the wood. I really like having the lower shelf in case we need to clear the top of the table.", 
    "A very nice size rustic look and east to care for. They arrived in perfect condition and in a timely manner. Thank you", 
    "Very sturdy, with nice rustic finish. Love it!", 
    "Very large for a coffee table. Not wild about the design of the metal. Would look better if metal had some curves.", 
    "I bought this along with the end table and was very happy when they arrived. The color and sheen of the wood were gorgeous giving the industrial look of the tables a beautiful warmth. Highly recommend!", 
    "Very sturdy, easy to assemble! We love these tables!", 
    "I was very pleased with this table. It is sturdy and well made. The wood and metal are heavy and the piece looks like a more expensive piece than it cost.", 
    "This is a solid piece of furniture and looks great in my family room. A little rustic which goes great with my decor.nonissues to report.", 
    "Same as above. Haven't opened it yet. I'm constructing a new condo.", 
    "Very good looking table. Really good quality. Excellent price. Larger than anticipated so definitely sketch out the measurements.", 
    "Love this table. It looks awesome with our leather furniture. It cleans extremely well. This is a very sturdy table and will hold up for a long time. Very heavy which I love.", 
    "I really love the table, very story and the wood is gorgeous however would of been nice to have real screws that you can drill in instead of ones with an allen wrench. Too time consuming and hard with a person who has large hands.", 
    "I would give this table 5 stars except that, as others have noted, it's a bit too glossy. Having said that, we were expecting it (thanks to all the great reviews) and were not surprised. We have distressed floors, so the wood color matches perfectly. The iron gives it a rustic feel, but the wood is sophisticated, not rough like some rustic items. I would buy it again and recommend it. Good fit for our great room.", 
    "VERY happy with the quality of this table! After a couple of months searching for a coffee table at my local furniture stores, this table is by far the best quality (in this price range) than any of the tables I saw elsewhere. I am pleased with this purchase and very thankful for all of the positive reviews which helped me go ahead and purchase this table, love it!", 
    "This is a substantial, beautiful piece of furniture. We have been looking for over a year for tables of the right look, quality and price and are thrilled with our choice. They were easily assembled, and look perfect in our home. Couldn't be happier.", 
    "Wasn't as rustic as I thought it would look. A bit glossier in real life with some intentional scrapes I believe to make to make it look a bit more \"worn\". Overall, it is a nice and clean looking table that functions well for it's price.", 
    "this table is unique and very well built. We had it together in a few minutes. Very heavy. Stable enough to put your feet up.", 
    "Would buy again! Beautiful wood and steel mix!", 
    "Nothing to complain about here. Solid and quite attractive. For the price difficult to find anything better.", 
    "You get exactly what you see. It's a great looking table and very large for the price. It's my favorite addition to our family room.", 
    "Distressed look is a bit forced.", 
    "Look great, very sturdy, and well made! We got the matching end tables too!", 
    "Exactly as described and very sturdy. Great product for a great price.", 
    "The finish was poorly done", 
    "Easy to put together. Looks great and very sturdy. I bought two large wicker baskets that store perfectly underneath for toys.", 
    "If it weren't for the fact that I would have to take this apart and pay to ship it back I would have returned this. However, it was such a pain to put it together we decided to keep it. There are chunks missing out of the wood that thought was damage at first, but discovered it is supposed to be a handmade \"whittled\" look. I like the concept but the grooves are too perfectly made to look accidental; so we cover these spots up with objects. The wood in the picture looks heavy and rustic, but the real thing is shiny, cheap and fake looking. Next time I will spend more money to get a higher quality coffee table and will purchase it in a store so I can see it before buying. Some pros are it is spacious and slightly better than an Ikea quality table.", 
    "This is very trendy and stylish. I put it together myself at age 53 and a small woman.", 
    "I am very disappointed with the table. Although the table is sturdy, both wooden surfaces have a series of wide scratches in two separate areas. On both the top and shelf surfaces, there is an area with 3 parallel scratches and a second area with 2 parallel scratches. These scratches are more like gouges for they are deep and wide so can not be repaired easily. Unfortunately, we can not use the box to return this item for we had to rip the box apart in order to access the table parts. For the price I paid, I would never purchase this item again.", 
    "I would recommend this table , it is well made, color of wood is rich and warm. A little hard to put together.", 
    "Bought this to replace a large leather ottoman that had seen better days. The size is perfect! Not as comfy to put feet up, but a couple big pillows on the bottom shelf ( that go with our decor) add a little color and are very handy to put under your feet while they are up. Looks very restoration hardware at a much better price!", 
    "I am keeping it, good for the price, but like some of the other reviews, it has some marking that look like damage rather than just distressed wood. Not really happy about that", 
    "it's solid wood. I found some carves on the surface and requested a replacement, and they shipped a new one very fast", 
    "I am very pleased with this purchase. I have received several compliments on the design, and everyone thinks it's very expensive! Love it!", 
    "Came in great shape and good quality piece for the price! Easy to put together- the distressed look isn't as distressed as I imagined but it still works!", 
    "Love the look of this table. The wood is gorgeous. Even though it is a bit rustic it looks great in a contemporary living room .", 
    "Coffee table is beautiful - it looks nearly identical to how it was pictured, although the corners appear slightly rounded/weathered in the picture and they are in fact sharp clean corners in real life, which takes the look very slightly in a different direction, which is why I bring it up at all, since some people are going for a very specific look! Wasn't too difficult to put together, but I would advise having two people, as putting the bottom shelf on was a bit of a hassle the way the screws are oriented. All in all very pleased, and LOVE how it looks in and completes the room!", 
    "We purchased the sofa table and wanted to purchase this coffee table but it was out of stock at the time. Signed up for the notification e-mail and luckily it came back in stock about a week later. The pictures speak for themselves and the type is awesome and can be somewhat rustin, industrial or modern if that makes any sense. Check the measurements because it is a good sized coffee table which I say in a positive way, but just something to be aware of. Really nice quality of materials... metal and solid BIRCH wood. How often can you find that at any price point these days. Assembly was easy. Had a small issue which Overstock is taking care of. Well worth the price... when O was out of stock I went to eBay to buy and it was almost double the price there. Excellent piece, fast Overstock shipping, and best price on O... buy it before they sell out.Cheers!", 
    "The table put together easily - and with no hitches - in less than an hour and it's beautiful! I'm very happy with it. Came packaged really well too.", 
    "We looked everywhere for the perfect coffee and side table, and finally found these! It had great reviews, so we were sold. They arrived and were exactly what we wanted!! Looks like ******* **** furniture, but at a much better price. Easy to put together and great quality! Love my new furniture!!!", 
    "I love the design of this table. However, the one thing I don't like is the way they try to make the wood distressed. There are two sets of grooves on the top wood surface that definitely look like a machine made them as the two sets are exactly the same. The indentations are parallel to each other and each groove is the same length. It does not look distressed, but machine made. I sent the first table back, thinking there was a flaw by the machine that made the grooves, but the second one arrived with the grooves exactly the same. I kept it because I liked everything else about the table", 
    "it had some flaws on the top.very heavy,not at all what I expected", 
    "Love love love this table and have received multiple compliments. Quite large so be mindful of the space you have available. My only BUT is that there was a poorly disguised gouge in the side of the table top but not worth the trouble to return.", 
    "I had been looking for a new coffee table for ages when I came upon this one. It's hard to find solid wood at a reasonable price. I've had the table for a while and it is wonderful. The color is a nice shade, not too dark and you can still see the grain/character of the wood. It was fairly easy to put together. You assemble it upside down. I was lucky someone was home to help. The top is easy, but the shelf would have been a bit difficult on my own. All the hardware and the lovely allen wrench come with the table. It was very well packaged with protection for the wood tops and at all the corners. I highly recommend the coffee table!", 
    "We love this table! Sturdy and beautiful! Large!!", 
    "Incredibly solid, heavy table. It's beautiful!", 
    "The packets of silica exploded in our box when it was shipped. This meant that the little beads went into all the open screw holes of the coffee table and there was no way to get them out. The result is that this beautiful coffee table sounds like a rain stick whenever it's moved and all the beads roll around the interior of the table. It makes a great looking piece feel cheap.", 
    "I took a chance and so glad that I did. The table is as good look as in picture. The size was just right for a L-shaped sofa. I also got the console table and love the look they create with the white sofa. The material is of good quality.", 
    "came scratched and looks like cheap wood even tho its real- its a real waste of money", 
    "Nice table. Good color. Super easy to put together. It's heavy and seems durable. The only let down was it doesn't appear to rustic and the attempt at it (random notching) is too random and almost makes the table look damaged. It is also very large- measure first!", 
    "Great table! the quality is amazing and shocking because of such a great price. I received a lot of compliments from guests. Easy to assemble.", 
    "Beautiful color, sturdy, and good size! I get a lot compliments.", 
    "I bought this coffee table for my living room a few months ago. I am happy with the way it looks and it is quite sturdy. My only compliant is that I've found it scratches kind of easily. I've scratched it by just moving my laptop or table tray across the the table. If I could I would by it again, but I'd be more careful!", 
    "very heavy and stronggood made", 
    "Solid wood, sturdy, and great quality. I must say I was very suprised with the quality of this product. Great buy! Definitely worth the money!", 
    "We have had this table for a couple of months, and we use it daily, including eating and drinking on it. It looks great and seems very durable. Easy to assemble, heavy, good quality. We are very happy with this purchase.", 
    "Perfect table- high quality. Table is easy to assemble. My kids have put their glasses on the table many times and have never left any water rings. If you are looking for a mix of rustic with a touch of industrial, this table is perfect!", 
    "Table is very sturdy, looks great and fairly easy to put together. The only thing that I think is a bit strange are the distressed wood marks. There are basically 6 \"notches\" in the table that look more calculated than distressed. Could probably do without those.", 
    "This table is sturdy and very attractive. It was easy to assemble once I figured out what I was doing wrong. The top does have shallow grooves and some indentations, as others have noted, that are obviously machine made. But for the price, it's very attractive, sturdy and a focal point in the room.", 
    "This is a great size & looks so good in room. Easy to put together but need to put bottom shelf on first- we learned the hard way. It is distressed on top so their were a few marks but think it is part of the look.", 
    "The product is beautiful and we were excited to receive it - but when it arrive it have several deep groves and it looks like they tried to cover the grooves with wood stain. Very dissappointed. Returned product and did not replace it.", 
    "Get compliments all the time! Great high quality product", 
    "Very easy to assemble (read all directions first though...) and very sturdy!", 
    "Quite heavy so you might need help carrying it to its destination. Solid and sturdy. Table comes with clear directions regarding care so be sure to read them so you don't scratch it. I would have liked it if the bottom and top wood pieces didn't have the exact same \"markings\" so that it felt more natural and less mass-produced & match-matchy. I actually prefer wood that is hand scraped so I like imperfections. It just would have been a bit better if they weren't the same imperfections on both the top and bottom pieces. I would doubt friends would ever pick up on this and it wouldn't have deterred my purchase but it may have caused me to pause. Happy with the overall look.", 
    "Amply sized (is larger than the picture indicates, so be sure to check out the exact measurements) - great simple style - sturdy and stylish", 
    "Wanted something indestructible with 4 young grand children. Have owned this about 4 months, and it still looks great!", 
    "This collection is lovely. The real wood plank top and base give warmth to a room. I have the end tables and sofa table as well, and all pieces look great, through some of the fasteners were a bit hard to screw in.", 
    "I'm always leery about the appearance of things online vs. the reality of beholding them. No need to worry here. I bought this piece to complement two end tables from the same collection. Assembly was required (I didn't care), and the finished product is substantial, sturdy, and quite beautiful. Its industrial look blended perfectly with and added a nice touch to my otherwise traditional decor.", 
    "I bought the whole set. Great quality, excellent price. The entire set is absolutely beautiful!", 
    "Just put together three pieces. Very happy with the quality of the wood. Could not be happier. I used a ratchet style allen wrench would made it easier to put together.", 
    "I am so happy with this table. I was looking to bay a table,and when I sow the reviews I decided to bay this table . It was as it was described by other costumes . I am so happy with it.", 
    "It's nice to see a wood table actually made out of wood. No particle board here. The finish is somewhat rustic/weathered. It looks just as advertised. The only odd thing is the few notches that are cut into the surface to make it look weathered. Problem is the notches are symmetrical and on both shelves, also on the shelves of the end tables that go with the set. So if someone looks closely, they'll see its on purpose. Other than that, if you're looking for a sturdy two level table with a wood/rustic/iron look, this is a nice one. The iron also has some fake wear and tear on it, but it looks much more natural. The non-perfect look also means you don't have to baby the table and worry about scratching it yourself. I'd buy again and recommend to friends.", 
    "We've had this table close to a month now. It is very heavy duty, good quality, and rather large. It does have the fake looking distress marks in it, but they aren't that noticeable once you get your décor on them. Overall we love this coffee table.", 
    "I would have given this 5 stars if it had not been so difficult to put together. It is exactly as pictured..the deep, rich color is as shown. A very solid piece...very heavy, great quality. The size is exactly as stated, however it actually seems larger than it measures because it is such a prominent piece. It fits very well in the space I planned it for, but if you have a rather small area in which you are putting this, it may actually seem larger than you are planning. I am very satisfied with this table. The assembly process was less satisfying, however. I am quite adept at building and assembling these kinds of pieces, but be aware that the picture on the directions is very misleading especially in how to place the bottom shelf. A couple of the holes didn't line up perfectly with the bolts, but I got them to fit. I assembled this alone, but it would have been alot easier if I had help. The shelves are pretty heavy. My tip for assembly, is after you loosely attach the top, (upside down as shown) turn the whole thing on its side until you get the bottom shelf in. It is NOT attached to the bottom of the side brackets as shown, but rather on top of them.", 
    "I wanted solid wood and I got it. This is a very natural earthy looking table. It's heavy and well-constructed. There are distressed marks on the wood and aging on the rot iron. It's very unique and eye-catching. I put a nice sized wicker basket on the bottom shelf to toss what-nots in. I put the table together by myself--44 year old female. Hint. There are four pieces: the top, the bottom shelf and the rot iron legs/sides. Loosely screw the legs to the top and then put the whole thing its side. Slide the bottom shelf in and screw all the screws in tightly. Took me about 30 minutes. I love this table and bought the two matching end tables as well. Excellent buy. I'm very very please.", 
    "We love how great our new coffee table lots! It took about 15 minutes to put together and is an awesome quality.", 
    "This was a great purchase. We have a very large/long living room and this coffee table was large enough to anchor the space. Overall EASY to assemble,tool (allen key) was included, it took about 30 minutes.", 
    "Large, sturdy coffee table. We get many compliments on the table. Wood is a little but shiny, and you can see some scratches.", 
    "The coffee table would be lovely but both the top and bottom have three deep I inch long impressions close together in one corner. Since the entire surface is not distressed, these are clearly damage that was present before the surfaces were stained. Also the instructions were backwards. They had to be reversed to assemble the coffee table.", 
    "We're trying for the a ****** **** look without paying the ** price... This fits the bill nicely. It is very solid and easy to assemble. End tables are also very nice.", 
    "This coffee tables look so excellent in person. I really love it! It wasn't pretty easy to put together, and looks really really nice in person. The wood is excellent quality!", 
    "I needed a coffee table for our new home. I searched my local furniture stores but didn't want to pay their price! I have received many compliments since we placed it in our family room. When I first saw it I was afraid it would be too big for my space. After assembling it is perfect!! Love, love, love it!", 
    "I looked for a coffee table at furniture stores near me, but didn't want to spend $$$ or more for one. I have never ordered furniture on-line, and was nervous. This really did exceed my expectations! The shipping was free, it arrived within a few days, looked just like the picture, and assembly was quick and easy. It is a beautiful coffee table that is super sturdy. It was inexpensive, but looks like the coffee tables that were over my price point at the furniture stores near me. I love it!", 
    "A nice rustic feel to the table with slightly worn looking wood and metal this is a beautiful addition to our living room. As others have mentioned it is BIG but it goes perfectly in our living room. You can't go wrong with this one!", 
    "I love this table and I might buy future furniture to match it.", 
    "We ordered this cocktail table to add an updated look to our family room. It is really well made and sturdy, just perfect for a room that gets a lot of activity. The color is exactly as it looks in the picture and the table is nice and large, but it does not \"take over\" the space. I would order this again in a heartbeat!", 
    "The table was easy to put together. It'll be easier if you have two people to get the lower shelf in place. It is large--so make sure you note the measurements and the space you have. Love the industrial look and quality. The heavy distressing adds a lot of character. Good value.", 
    "This is a nice looking coffee table. I ordered it for my upstairs bonus room so I would have something to put my dvd player and speakers on underneath my tv. It looks really nice, but was horrible to put together. Nothing was lined up. Some of the screw holes weren't drilled right and my husband yelled the whole time he put it together. Well, it is together, but he was not happy with the craftsmanship. I think it looks nice now that it is put together. For something just to serve a purpose as I ordered it for, it is fine. Not sure I would recommend it for my main living area.", 
    "A little more \"assembly required\" than what I thought. The wood pieces look a little \"fake\" - it's on an outside covered porch so it will do fine. Wouldn't recommend for an indoor coffee table.", 
    "I had previously bought a coffee table through Overstock and the product was flimsy and made of particle board---I took my chances and after the reviews on this coffee table-I purchased it. I can not believe how well this coffee table is built-it is solid wood with wrought iron! Extremely well made and sturdy-plus the open space was perfect for me to place 3 decorative storage bins underneath to keep the clutter at a minimal. It was easy to assemble and it has created a very warm feel to my family room! I am extremely happy with this purchase!", 
    "Great product and great value for this price! Will highly recommend if you are looking not just for a coffee table, but also for a small table to have lunch a dinner. It is big enough to have meal served for two people. Great look and great quality too. I am very impressed!", 
    "I would recommend this to a friend, only because Overstock's customer service was so helpful in facilitating a return. The style is great, it would have been easy to assemble, but it arrived with a split in the side of the top piece and many deep scratches. It's a cool looking table, and would have been really sturdy. Definitely not a cheap looking or feeling piece of furniture. I don't think I'll reorder only because it was very heavy and I'm afraid it would arrive damaged again.", 
    "Very nice solid piece of furniture made from real wood and metal with a great rustic industrial look. There is some assembly required with this product but it is very easy and straight forward and only took about 30 minutes. Looks fantastic with my leather couch and love seat very satisfied with purchase!", 
    "This table is gorgeous and actually real wood. The color is awesome. I see similar tables advertised at high end furniture stores and even on their commercials. One cannot beat the price.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Greyson-Living-Windham-Solid-Birch-Iron-Coffee-Table/8830291/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8830291/Windham-Solid-Wood-and-Iron-Coffee-Table-d33cca87-b553-4799-8d13-c74d517d246a_600.jpg"
  ], 
  "description": "Create a rustic feel in your living room or seating area with this\nGreyson Living Windham coffee table, which blends distressed\nbirchwood with iron for a vintage look. The exposed rivets provide\nan industrial accent to the iron X stretchers, which draw the eyes\nto the sides of the table.Surface and bottom shelf feature distressed wood for rustic\n  lookDurable frame constructed of rustic ironX stretchers highlight the sides of the tableGlides on the legs provide protection to floorsOne coffee table crafted from solid birchwood and iron\n  materialsRich brown finish complements dark brown metal with gold\n  highlightingTable measures 19\"H x 48\"W x 28\"DStyleContemporary, Rustic, Transitional, VintageMaterialGold, Iron, Metal, WoodTypeCoffee TablesFinishBrown FinishShapeRectangleAssemblyAssembly RequiredColorBrownFurniture PatternSolid"
}