{
  "name": "Griffith_Dark_Brown_Mid-Century_Modern_Coffee_Table", 
  "price": "EUR 97.44", 
  "reviews": [
    "This coffee table was the missing puzzle from my 50`s décor room. No second thought when it was recommended by a friend of mine, I made the purchase and I can say I am very pleased with everything overstock had offered me regarding my purchase. Absolute professionals, very nice quality and for certain, the best price tag.", 
    "I always chose irregular and unique solutions in my life and this is what I follow with my home. This fine and irregular shaped coffee table was the most suitable solution for my modern living. The color and material is beautiful and the whole frame and product high quality on low price. Love it a lot.", 
    "This coffee table is more than just a simple coffee table, it is a true piece of art in my living. I love the unique shape and color and the large size on which I can serve coffee to my friends. When not used for serving it is a great decorative piece and looks amazing with the bookcase I also ordered from Overstock.", 
    "I bought this table because it had such great reviews. The coffee table differs from most of the tables on the market because of its design. The rubber legs are a great aspect because I can drag the table around without having to worry about breaking the legs or damaging my floor. Table matches with the rest of my furniture perfectly.", 
    "This table is simple and doesn't take up much space. It looks like a table you'd find in England and has an elegant look to it. A great item if you're looking for small table to just rest in front of your couch No issues with shipping. Great for a small home or apartment.", 
    "I just ordered two amazing club chairs in the living and decided to buy a matching coffee table so that we can have a nice chatty corner with my friend. The look is really fresh, modern and elegant, and this table way better than expected for the low price. It is really large, comfortable to serve on and really solid. It takes two moves and the top is cleaned without damage. Thank you.", 
    "This coffee table is really large. i never had such size coffee tables only the well known medium classic shaped oak or wood table. It was time for a design change so this unique tables was a good start. All asymmetrical and with a really unique color that can be seen only when arrived. It is so spacey that serving coffee is fun these days. Love it.", 
    "I adore my new table. It has a really unique design and is way larger and solid than expected. I always stuck to the well known classic pieces and recently decided to make a change in look. With my large new leather sofa this amazing table looks perfect. It is easy to clean and serving coffee on it is just a child game. All top quality and perfect. My friends are always jealous of me because of this wonder piece. Thank you Overstock.", 
    "This table is not only great in price and quality, but looks also. The irregular shape and the smooth touch of the wood give the perfect combination of elegance and unique charm. My living looks great with this table, and fortunately it is durable and solid to last for a long time. I love serving my guests with tea or coffee on this table.", 
    "The table is very low profile. Nice quality, however one of the legs had a gauge in it, but it was painted over. Don't really want to pay money to ship it back....", 
    "This table is the perfect size for our needs. It has a neat design, yet is simple at the same time. The finish looks great, nice and smooth. No rough parts. Its super sturdy and was easy to assemble. Wonderful piece.", 
    "Arrived damaged with ding on corner and veneer lifted up. Item was moving all around in box. Nice looking table,but don't want to go thru return process again!", 
    "Pay attention to the dimensions, it is pretty small. Also it is very light weight and cheaply made. One leg broke after only a couple of weeks. It does have a nice dark, rich color though.", 
    "I loved the look of this table. The top was so attractive . However, pay attention to the size and shape . We need something a little more substantial that you could okay games on. I would have kept it if I could have justified it but ended up exchanging it for a rectangular style table.", 
    "VERY nice table. Much better quality than most internet furniture purchases. Style is so sharp and slightly retro just like I was looking for. Easily worth twice the price. Most definitely recommend. Only FYI, is a tad shorter than I expected.", 
    "Yes, the table is a bit smaller than expected, it has an intersting mid-century looking vibe and fit the bill for a small sitting area. I've had it for 6 months now and looks like new (minimal use).", 
    "We loved the look of this table, but the quality of the materials was very poor. Would not hold up well to daily family use.", 
    "I returned because it was shipped substantially damaged, and the following two replacements were bashed in as well. Overstock was nothing but helpful, though. Very very small table.", 
    "I love the shape of the table, the color of the table, but it appears smaller than I envisioned. It had the deminisions in the discription, but I just assumed it was standard coffee table size. That is not the case, it is much smaller. My den is smaller, so I ended up keeping it.", 
    "I got this coffee table because it wasn't square or rectangle. The table has a abstract shape and I love the flared out legs. The coffee table is on the taller side than what I am used to, but it looks good nonetheless.", 
    "I adore this coffee table. It has the perfect design and look with the perfect construction. I also ordered a few amazing ottomans that work perfectly as seating options and decor pieces. The table is larger than expected and it is perfect for serving coffee and snacks for guests.", 
    "not accurate if you want a table for your kids doll house buy this otherwise make sure you measure your space it was tiny tiny and could not fit with any couch too small", 
    "This is a fantastic, simple, midcentury-inspired coffee table in a smaller scale. Which was exactly what I needed and wanted. It's perfect in front of the fireplace, low-profile, small footprint. And it's a great shape. Love it.", 
    "I realize this is a $100 table not a $1000 table BUT when you are retired and on a fixed income you are very hopeful that what you order is acceptable. This table is a perfect replica of many coffee tables of the 1950's and I love it. BUT it arrived packed so poorly that it was damaged. It is far too difficult for me to try to repack and return so I \"mended\" the corner using an emery board and permanent magic marker. It worked. Now if I only had the 4th little foam pad that was attached to the bottom of only 3 of the legs. 2 other things you should be aware of: the little adhesive arrows that tell you where to place the legs...most were in the box rather than on the table bottom and don't try to tighten the legs too much as they'll cause a bump in the top of the table. So while I rate the overall table as very good I'm terribly disappointed I have to start with less than a brand new, unmarred product.", 
    "Very nice coffee table. We already purchased one and now we will buy a second one for my parents. It is very classy and stylish. It looks even better with four dark brown ottoman seats around it. It can complete the decoration in the room with a great aspect of furniture completion.", 
    "This table is much smaller than anticipated. It has scrawny legs and a wafer thin table top. The screws actually poked through the top of the table when attaching the legs!!! I purchased this \"vintage\" looking piece to sit on a shag rug in front of a low profile 60's style couch. The size is so diminutive that it looks like a flea on a white carpet. It will end up stashed in a corner somewhere...a side table at best.", 
    "I really like the design of this table. The unique shape of the tabletop and the fine lines make it look so fine and extravagant. The table is larger than expected but it looks even better as shown. It soon became the centerpiece of my living with its unique design and the legs are really solid to handle the top. Fair and useful deal.", 
    "This table has quite a unique design, probably this is why I ordered it. I was hoping it would look just as fine and simple, yet unique as shown, but the look is above my expectations. The smooth lines of the tabletop are stable on the solid legs and it has a beautiful look and aspect. Near that it is larger than expected, filling in the space with modern elegance. Thanks.", 
    "This modern coffee table is larger than expected but it is better as the beautiful irregular shape gets more space and freedom. I have a large and modern living so the table with the uniquely designed shape and top quality materials provide the best addition. The product was shipped quickly in a good quality and has a highly affordable price. Love it.", 
    "This table looks amazing in my new living room. It has a really unique shape and design, but this is what makes the piece so special and perfect for my taste. The table is large enough, even larger than expected and looks fantastic in front of the sofa. The quality of the wooden material is great and all the details are fine and beautiful.", 
    "This is a small inexpensive table. It is temporary for me until I find something better. The past reviews led me to believe this was something great...not really. It is very *** like."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Griffith-Dark-Brown-Mid-Century-Modern-Coffee-Table/6593187/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/L14165519.jpg"
  ], 
  "description": "Durable and versatile, this Griffith coffee table features a\nbeautiful dark brown stain finish. This wooden living room table is\ndesigned with a noticeable influence from the mid-1900s with its\nirregular shape and engineered wood form.Modern coffee tableEngineered wood frame with solid rubberwood legsFinish: Dark brownThe naturally uneven wood grain in the basswood veneer\n  results in an uneven appearance of brown stain, resulting in some\n  areas being darker than othersProduct Dimension: 13.7 inches high x 39.3 inches wide x 23.7\n  inches deepStyleContemporary, Mid-CenturyMaterialWoodTypeCocktail Tables, Coffee TablesShapeSpecialtyAssemblyAssembly RequiredFurniture Frame MaterialWood"
}