{
  "name": "Hanging_Corner_Storage_Shelves", 
  "price": "EUR 40.06", 
  "reviews": [
    "Will fit any corner of any room, but made poorly.", 
    "We were looking for something to finish off a small area next to a window. These were perfect! Tall, sturdy and wide enough for books, a plant and statue. They were fairy easy to ut together and hang", 
    "I ordered two of these for the corners of my living room and they look great! One corner was slightly peeling up but it faced the wall so it's not noticeable at all. For inexpensive shelves, these are actually a little better than I had expected.", 
    "Very bad quality on paint", 
    "easy to simple and looks good on the corner of the wall.", 
    "adds something nice to the living room look", 
    "nice for office - adds shelf space vertically", 
    "Like the looks and it fits perfect for the space I have but my husband said it wasn't very good quality when he put it together and it didn't seem to sit flush with the walls", 
    "easy to assemble, easy to hang, holds lots of stuff", 
    "Big enough for books, picture frames and you can't beat the price.", 
    "looks great in the corner! just what I expected"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Hanging-Corner-Storage-Shelves/9467593/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9467593/Hanging-Corner-Storage-Shelves-b58b2d94-e442-4bcf-98c7-4eefb5b85e38_600.jpg"
  ], 
  "description": "Make the most of a small room with these hanging storage shelves which feature a space-efficient design. The unit mounts in the corner of a room, adding storage without taking up valuable real estate on the floor. Four roomy shelves hold books, collectibles and other small items. With its attention-grabbing, alternating side panels, the unit doubles as a piece of art.Pre-drilled mounting holes and drywall anchors included for easy installationComposite board and PVC laminate are easy to clean with a dry clothSet comes with one shelving unitAvailable in maple, cherry, chocolate, black and fruitwood finish options for easy decor matchingUnit weighs 14 poundsMeasures 53.13 inches high x 11.88 inches wide x 11.88 inches longStyleContemporary, Modern, Traditional, UrbanMaterialLaminate, MDF, VeneerFinishBlack Finish, Brown Finish, Cherry Finish, LaminateShelf TypeBookshelves, Curio, Display, StorageAssemblyAssembly RequiredColorBeige, Black, Brown, RedNumber of Shelf4"
}