{
  "name": "Laminated_Espresso_'S'_Wall_Mount_Shelves_(Set_of_2)", 
  "price": "EUR 36.27", 
  "reviews": [
    "Everyone likes the shelves.", 
    "The laminat cover is very cheap looking and flimsy. Probably wouldn't have bought if saw in person.", 
    "Exactly what I was looking for.", 
    "These shelves look nice and are easy to install. Comes with a paper guide you tape to your wall to make sure your holes are drilled the right distance.Even though the box wasn't damaged, there were scratches on my shelves. I managed to hang them in a way where I couldn't see them and so it didn't bother me.", 
    "Got this in espresso shade. Very nice product and get a lot of compliments for it!", 
    "I haven't used this yet they are kind of akward and didn't look good on my wall.", 
    "Exactly what I was looking for. It is a small shelving but it serves purpose for what I need it for. Bought 2 and it looks nice on my daughter's room.", 
    "This isn't a user friendly assembly/hang project. It's poorly made as the corners do not butt up against each other neatly.", 
    "Serves purpose of featuring light collectibles at eye level", 
    "I bought two sets of these to hold mugs and coffee flavoring syrup bottles in a beverage display in my home. The width is perfect for holding four large syrup bottles or four wide mugs each, and they look very nice once up on the wall. I've found them to be quite secure and sturdy - no issues with falling or tilting.The only slight downside to these is that you have to be VERY accurate in your placement of the screws to hold these up. There is almost no margin for error if you want the shelves to hang evenly. I can definitely recommend these to anyone wanting an attractive, sturdy, and unique decorative shelving option. Just be prepared to spend the time necessary to carefully set your wall screws.", 
    "These are nice, but the identical ones sold at Target come with LED candles, which I love.", 
    "They look great. Fabulous shelves!!!", 
    "Very unique, easy to put up, adds great color and style to room.", 
    "Great look...a little difficult to hang.", 
    "They are nice form bit the paint is very bad, and scratch", 
    "These are exactly what I wanted at about 2/3 of what they cost elsewhere. I'm pleased.", 
    "This was exactly what we wanted. Quit delivery, good quality and color matched the picture", 
    "Easy to mount and looks good on my wall", 
    "These were easy to assemble and hang. Love them. Good quality", 
    "good combination with the book case I have", 
    "These shelves are exactly as advertised. I am very pleased with the purchase and would highly recommend.", 
    "These shelves are MUCH smaller than the picture makes them appear. Still cute for a small wall space.", 
    "So It arrived fairly quickly looked exactly like the picture, it was slightly smaller than expected but perfect for the wall above my toilet. I bought this item to put some mason jars on top, a bathroom idea I got from Pinterest. Did not use the screws at all I always use tape or Velcro to put anything on my walls. It holds up great, very strong.", 
    "Great way to display items.", 
    "Very nice little shelves for small displays like small picture frames. Easy mount.", 
    "So many things you can do with these! I bought 2 pair. mounted on this short wall I had that was bare. Looks great! Word to the wise... USE A LEVELER, use a tape measure and mark where you plan on putting your screws/anchors in! I used of those tools and my results were great!", 
    "Awesome quality and they look great in my bathroom", 
    "They look nice on the wall. very happy with the quality and design.", 
    "Being used to display various baseball memorabilia. Buying more today.", 
    "Easy to install. Quality not up to expectation especially given price.", 
    "Not overall bad quality wise - just smaller than I thought.", 
    "Super easy to install, stylish and looks great", 
    "Item is as advertised. Priced properly also.", 
    "I love how these shelves look, even though they are super small. The quality however is horrible. Before we were even able to get it on the wall, the metal hanger and screw came off. I wouldn't recommend it.", 
    "These floating shelves are very difficult to attach to the wall. They came with hardware and a template . . . but you MUST be RIGHT ON the holes in order to get them flush. They say easy and only 15 min. to do the job. It took me FOREVER ! ! ! Finally got one up and will fool around with the other later. Kinda stupid . . . or is it just me?", 
    "Nice shelves for the price", 
    "very clever.... easy to hang, beautiful to look at.", 
    "No quality defects, easy to hang, and look nice in my small water closet.", 
    "These were a little smaller than expected. They do the trick.", 
    "Look beautiful on my living room wall", 
    "Horrible instructions, impossible to put up.", 
    "Used these in 2 different places and created a nice focal point below a sign.", 
    "Just what we were looking for. Fit our space perfectly and good quality.", 
    "I love these shelves. I had a hard time finding some nice shelves that didnt look cheap. These were great.", 
    "They shipped well packed, with no visible damage. . They aren't huge, but if you actually read the details you will no EXACTLY what sizes they are, so I don't understand how people can complain about how big they are. All in all, cheap stuff, that doesn't really look cheap. Exactly what I wanted.", 
    "These shelves are sturdy and were easy to hang. They fit flush against the wall and hold my figurines and small plant beautifully.", 
    "I bought the shelves in white and hung them in a guest bedroom. The shelving perfectly filled a blank wall and gave me a place to display some favorite items. Looks great!!", 
    "I love that it came assembled. It is very unique and a great way to display your treasures. :)", 
    "We used these as display for my daughter's dozens of softball trophies. The are perfect. They come in sets of two, we ordered three sets in the espresso. To any moms of teens with trophy collections from sports, cheer, pageants, etc. - they are IDEAL for trophy storage! They are deep enough and sturdy enough to hold any trophy, even the 3 foot tall one that my daughter had from undefeated state champs. They are super-easy to install, and have stayed on her wall for over a year now with no issues whatsoever. She dusts them every time she dusts her trophies and the rest of her room, and they still look brand-new. What the image doesn't show, is that you can rotate them so the are not both situated the same way, which is especially helpful if you order several sets. Cannot recommend these enough!", 
    "Very nice, especially for the price. Easy to hang and perfect for my space. These are nice because the are not as deep as some other shelves, so they don't stick out from the wall as much, which is exactly what I needed for this particular space in my living room.", 
    "I needed an odd shape and these fit the bill, larger enough and deep enough", 
    "Great little shelves that add a modern look to our bathroom. I like that they are two separate shelves so I can hang them to take up more/less space. They're not very deep, but considering their sole purpose is to hold tchotchkes, it's perfect. The drywall anchors that come with the shelves are crap, so I just used my own.", 
    "love these shelves. wished they were a little bit bigger for the wall i put them on. measure well. perfect for a smalller wall space.", 
    "I like these shelves.The style is good and easily used in many areas.", 
    "Great accent piece! Good Quality and reasonable price", 
    "Planned to order 2 shelves but didn't realize 2 were in a pack. So, ended up with 4 shelves. Put 2 on either side of TV and rearranged them to look almost like a box with an open end going up and one down...so they set on top of one another. Looks really stellar!!! Love it!!! I ordered the expresso color. I've been finding really cool stuff on Overstock.com that you don't find anyplace else. I love O!", 
    "The shelves are small but are really great looking...very different!!", 
    "I have a contemparary decor in my living room and this accentuates my setup. Espresso in color, this is super easy to fix but light weight. Wouldn't put anything heavy on the shelves. But great looking for good price.", 
    "I would buy it again. It was smaller than i expected but still I absolutely love it.", 
    "I bought these shelves along with the \"Intersecting Walnut Rectangular Shelves.\" These are terrific. They arrived on time, already assembled, and the quality of the construction and laminate material is very good. The other shelves were complete junk and need to be returned.", 
    "I recently moved and discovered I needed some shelves but not just any shelves they would have to be black and of some different design then the ordinary shelves. At first I thought maybe one of competitors would do couldn't find any and I mean ANY! Finally I told my husband overstock usually has the unusual and VOILE' you did!", 
    "These shelves are so different from the run of the mill ones you see in all the stores. They were easy to put up and everyone comments on them. I saw similar shelves at a department store for almost twice the price.", 
    "These shelves are wonderful. The price is a little higher than I would have liked to pay, but they look wonderful hanging on my wall.", 
    "I love the decorative stylish wall shelves. They look great in my sons bedroom. They are a great wall decor for his room. Everyone loves them and wants them. I recommend these to all.", 
    "We ordered these to fill out a large empty wall space. They are interesting and versatile - I love the way we can move things around change the appearance.", 
    "I loved this product =) , I put on my living room and it looks amazing. I am thinking about getting another set.", 
    "The product is much smaller than I thought. The picture on the website is misleading.", 
    "Colors matched, pieces exactly as shown. It's easy to install although I recommend using other hardware instead of the drywall anchors supplied.", 
    "The picture makes the shelves appear larger than they are. The shelves are small. They look great on a small wall space.", 
    "Very pleased with product and it matched perfectly.", 
    "I love these shelves! They look so nice on the wall in my living room. They mounted easy as well!!", 
    "I love these shelves. They can be arranged differently to create a unique appearance. I wouldn't recommend setting anything super heavy on them, but they work greate for lighter objects.", 
    "Not real big pieces but exactly what I needed. Good contemporary design."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Laminated-Espresso-S-Wall-Mount-Shelves-Set-of-2/7752378/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7752378/Laminated-Espresso-S-Wall-Mount-Shelves-Set-of-2-835ae61d-dedf-4b06-91cd-00669edb9ba0_600.jpg"
  ], 
  "description": "Flaunt your superior sense of style and show off your favorite\npersonal items with this set of S-shaped wall mount shelves. Each\nshelf offers two individual display areas for displaying your\nfavorite items or organizing your current living space. Giving the\nillusion of floating, these contemporary display shelves are\nultra-modern and available in both espresso and white finishes to\nmatch your current decor.Includes all hardware for easy installationFramed on laminated medium-density fiberboard and finished in\n  laminate for simple cleaning and durabilityAvailable in espresso and white finish to match any existing\n  color schemeIncludes two shelves and four display spaces with no visible\n  hardware, perfect for displaying your personal itemsOverall dimensions measure 4.75 inches high x 22.5 inches\n  wide x 4 inches deepMaterialWoodAccent TypeDecorative ShelvesColorBrown, White"
}