{
  "name": "Laminate_Intersecting_Wall_Shelf", 
  "price": "EUR 40.06", 
  "reviews": [
    "I, for one, am so sick of the stuff that China shoves off on us. This is a nice shelf, but as usual, the quality of the workmanship is sorely lacking. I will use it, since it is going on my bedroom wall, but I'm not thrilled with all the runs, drips & errors on the shelf overall. It's always a hit & miss as to whether you will receive a product that the person who assembled it in China, actually attempted to make it look nice. I think we have ALL learned that by now!", 
    "Purchased this shelving set for a narrow wall space. The workmanship was less than expected: slants in the smaller squares made the whole unit appear lopsided. Could not adjust. In addition, the white option did not create the look I wanted.", 
    "It fit in the space I needed to show my the rememberenceses of my late husband.", 
    "Great little shelf. Easy to hang with included 'cheat sheet.'", 
    "Is already armed and as pictured, would recommend", 
    "Absolutely love this piece!! Not too big nor too small . Good quality", 
    "Quality item. Looks great on the wall.", 
    "Smaller than pictured but very easy to put together.", 
    "Super simple to assemble and fits great in the center of a smallish (34 in) wall.", 
    "Liked the shelves. Good for small Walls", 
    "Just as the pic shows. Assembles easy.", 
    "Kind of cheap looking but looks as advertised.", 
    "Nice wall fixture love it holds pretty well", 
    "easy to put up looks grate", 
    "Item is REALLY tiny. From the picture it is very deceiving that the shelf is somewhat a good size. Everything in that photo is miniature except for the ball of yarn. That's actually about size of a softball. So the whole shelf is not big enough to put anything in other than tiny little figurines. Check out the measurements before you buy.", 
    "this works beautiful in my mother's newly painted bedroomNice and heavy and very easy to assemble,I would recommend this to anyone,", 
    "this item fit my wall perfectly as I had hoped it would! I'm glad I ordered the darker color as my walls are light and needed something to stand out. I can now change the small decorative items seasonally.", 
    "had need for something to disguise wall mounted fan", 
    "My daughter got one for bday and wanted another", 
    "Used this wall shelf, in white and paired it with 4 watercolors for my bedroom. Fills in a very large wall, and looks wonderful.", 
    "Nice accent. If you need something small yet elegant. Here it is.", 
    "The shelf unit is smaller than I expected but it does look terrific on the wall. It came with a template to hang it in a snap.", 
    "Perfect to display small items. I use in a bathroom for little things like a candle, small flower arrangement, etc. above the toilet. Completes the room.", 
    "Same here this shelf puts a nice touch to the kids room", 
    "I am pleased with the look of the shelves, but they are significantly smaller than the picture makes them appear. The measurements are technically correct, but they are measuring from the tip of the top box to the edge of the bottom one. If the shelves pictures are in fact the same size, the decorative vase and other items must me quite small. No vase of mine would fit in that space.", 
    "Easy to assemble not as easy to hang.", 
    "Cute way to bring color to your room when you add accessories!", 
    "Just a little crooked when assembled. Nice nonetheless. It's sturdy construction though. I'm satisfied", 
    "perfect accent for a wall!", 
    "Very stylish. Good price!", 
    "These are pretty nice. just like the picture. I love how they aren't your normal boring shelves.", 
    "the seems don't match up that great (gaps) but overall my teenager loves it so that makes it PERFECT!!!", 
    "We have been looking for modern looking wall art for my daughter's room. We fell in love with this one. It feels very well made (not real wood, which we knew, but solidly put looking for a laminate item). And the geometric shape feels fun and modern.", 
    "I so love this wall shelf! So much, that I ordered another one!! It's solid wood and sturdy. It also adds a nice pop to my family room. Great Wall accent piece.", 
    "Comes with anchors and screws.", 
    "Difficult to hang level and smaller than you might think. Nice idea.", 
    "Like a puzzle with style and u can add little things for instance a flame less candle, little stand up decors ,etc..", 
    "looks nice, quality is a little poor.", 
    "I almost didn't order this shelf based on the poor reviews, but I'm glad I did. (I purchased the white one) It's very sturdy and nicely built, so I'm not sure why others are having problems. Maybe the builder is using new material? Not sure, but it's worth buying... I definitely recommend it.", 
    "Looks great on white wall. But if wall color is darker items placed in it aren't very visible.", 
    "This is a cute little accent shelf, but the quality is adequate at best. I will probably keep and use a pen to touch up the areas that are missing paint.", 
    "I received the self last night (January 5, 2016) and it's not the size I thought it would be. The shelf is still cute on my wall but the items I wanted to display on it will not fit.", 
    "Would have liked it better had it's finish been a furniture stained look but ir works where I am hanging it....a little difficult to stabilize and get the hardware to work and remain secure", 
    "I loved this item, but again - needed some assembly and I'm waiting for it to fall every time I put an ornament on it!", 
    "fast shipping and very good seller", 
    "I ordered the brown wood color but I recieved white instead . I ended up keeping the white because it looks great in my bathroom .", 
    "I really like these shelves. A different look than hanging a picture.", 
    "This has added character to my living room wall", 
    "I love it so much, look super cool on my wall", 
    "Really much nicer than boring straight shelving!", 
    "used in my half bath everyone compliments it.", 
    "Looks great! Easy to put up.", 
    "I have been looking for some unique good quality shelves to decorate our living room & I found them with this purchase!!!", 
    "This looks fantastic in my livingroom", 
    "Very unique. We needed something above a rather ornate fireplace. This little piece is just perfect. Easy to assemble and comes with a measured strip to help one hang it accurately.", 
    "This is way cool. A perfect idea to add something to a plain wall.", 
    "Delivered quickly, easy to put together and hang! Looks great over the tv!", 
    "This is a poor quality piece. Target stores sell nicer ones for less money. I didn't even remove it from the box when I saw how the wood looked.", 
    "I ordered the white. It balances off the entire dining room. We have already received many compliments on it. It's well made and easy to attach to the wall.", 
    "I am very pleased with the purchase of this shelf. I goes well with the decor in my guest room. looks nice. I would recommend this to others.", 
    "This is a nice little shelf. Not very heavy or sturdy but still very nice!", 
    "Adds a nice touch to any room. Good value for the price.", 
    "exactly as described! looks great!", 
    "This unique shelf has added a whole new dynamic to my living room décor. The cubbies aren't very big so don't expect to put anything bigger than a baseball in each slot. It's also very easy to put together and even comes with a template to hang level on the wall. I love it!", 
    "It looks really good over my 32 inch TV, another one over my dresser. I wouldn't risk putting any heavy decoration on it, I have some candles, tiny vase, plastic pumpkin on it. Great wall filler.", 
    "Easy to assemble. Fair quality for price.", 
    "was easy to set up and install on the wall when measured out properly", 
    "easy to assemble, no tools needed LOOKS GREAT !", 
    "Looks exactly as advertised on the website. I bought the espresso color and it matched our bathroom well. The size is just right -- not too small. It is something that I would put in secondary bedroom (or an master in a apartment) rather than master bed in a house.", 
    "I would definitely recommend it if you are looking for something simple and cute!", 
    "OUTSTANDING QUALITY--WE DID 2 WALLS WITH DIFFERENT COMBINATIONS OF THIS PRODUCT AND EVERYBODY HAS LOVED THEM.", 
    "Great for small areas. Love this.", 
    "I love these shelves. They are super easy to assembly and hang. They look awesome in my bathroom.", 
    "This wall shelf is beautiful. It was easy to assemble and looks great on the wall.", 
    "The shelves are lovely, but be aware they are smaller than they look. I simple added a second one to fill the space.", 
    "wow cant believe how fast this shipped and how great it looks! I love overstock.com!", 
    "The color is just as the picture. I bought this for decorating small accent items in my apartment. The wall shelf is easy to hang and the nail holes are small enough for no problems in an apartment.", 
    "Really cute style but wish it was bigger.", 
    "looks great against the green wall and white chair rails and trim. Love it and very satisfied with purchase", 
    "Love this wall decor. Its different and no one I know has it.", 
    "Easy to set up,and looks great", 
    "Very nice very easy to put together very easy to hang up I love it.", 
    "Was very happy with this purchase. Was smaller than expected but good quality.", 
    "Love these shelves. Exactly what I was looking for. Very stylish and durable.", 
    "this shelving is beautiful but a bit heavy for regular sheetrock walls. needs suports", 
    "This is going in my son's bedroom and he thinks it cool.", 
    "This shelf will be a nice touch to our family room. Nice size and provides a unique wall hanging for whatever.", 
    "easy to put together and nice on the wall, i think i need another one", 
    "Before I could even find the spot for it, the joints came apart. It is pretty cheaply made.", 
    "Nice attractive conversation piece with multiple ways to decorate it. Displayed in my living room.", 
    "I haven't even hung this on the wall and the wood came apart at the seams. Apparently it is only held together with low quality glue.", 
    "Was very happy with this shelf would recommend to family or friends", 
    "Look so cheesy, cheap and small, we returned the item!", 
    "I bought this thinking it would have a little more room inside the boxes. the smaller squares are only 5-1/2\" high on the inside. so very few things I had fit inside. I like the overall design, but this is a laminated particle board. I would not put anything with much weight to it.", 
    "This little shelf is perfect to add to a wall, if you don't want to commit to a painting or art piece. Adding little trinkets and momentos, makes this very personal and nice to be able to change it around. We use it to put things that our child made when she was little. Love it!", 
    "great, but wasn't as large as I thought. nothing more can be said", 
    "Assembly takes two minutes, plus five more to measure, mark and drill the wall and hang! The shelves are sturdy MDF with a decent-quality laminate finish. The brass mounting brackets are recessed and are of the type that allow you to lift off the shelf without removing the wall screws.", 
    "I bought this on Jan 2014, and installed on Feb 16th. I only set 6 sea-shells on it. And yesterday, I was taking shower, and this item droped suddenly. I checked and found the two piece wood parts come off since it's detached from the glue. dont' buy this poor quality item. Don't buy. It's not worry it.", 
    "We added this shelf to the decor of our bathroom and it looks great! I plan to find some white bottles of different shapes and sizes to put on it.", 
    "A mostly good review, except Overstock shipped my the espresso color when I ordered 'white'. With the product being a time-sensitive gift, I could not return and had to paint it white myself. Poor rating for that.", 
    "The shelves are small but are really great looking...very different!!", 
    "When I saw this shelf, I thought it would be perfect. After receiving this shelf, I knew it was perfect and then decided that I had to order a second one. They are just perfect for my nick knacks.", 
    "Very difficult to hang. So not recommendable to everyone. I gave up on hanging the piece the way it shows in pictures when the right side slid down. So it hangs like a diamond shaped doo-dad with a bird plaque in the middle. And I put extra screws in wall to help support it.. The two other separate shelves were difficult to hang also. All I can do is hope they stay hung and do not crash down. Nothing can be placed on the shelves because of uncertainty of staying in place. But a bird plaque is with each shelf because plaques were hung with map tacks.", 
    "I absolutely love it, so does everyone else who sees it. The quality is not so excellent, but it looks VERY nice and stylish.", 
    "It should cover the wall as Showcase. It is not a toy or baby's doll house.", 
    "Had to remove hardware on back because they were not level. Luckily holes behind hardware were level. Used my own drywall anchors and screws. Looks beautiful on the wall in half bath. Great storage.", 
    "Easy to put together and looks great in the location where I put it.m", 
    "Shelf was better then I was exceting for the price! I should have order two!!", 
    "This shelving piece i have not hung yet, but the material is actually very fair and it is not a cheap light material. It feels very durable. Totally recommend this item. Haven't put it up yet but it is not a hard piece to put together.", 
    "love this item, am thinking of getting another and display them together on one wall, but not sure yet. This product is nice and simple and gives just the right touch to any wall.", 
    "ok, this piece was a good change for my master bath.", 
    "We bought this shelf to accent the decor in our son's room. It was easy to assemble and seems sturdy on the wall. My son displays some small trophies and sports stuff on it with no issues. It looks very nice in the room. The wood is a rich dark color. I would recommend."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Laminate-Intersecting-Wall-Shelf/7752367/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7752367/Laminate-Intersecting-Wall-Shelf-b84eac33-f966-45f4-8e2f-85ca6af3f509_600.jpg"
  ], 
  "description": "This decorative intersecting espresso wall shelf provides three\nstorage cubbies plus level display space on top, perfect for a\ncombination of large and small decorative items. Easy to install\nwith no visible connectors or hanging hardware. All hardware\nincluded. Adorn your walls with modern elegance with this wall\nshelf. With plenty of room for small objects d'art, photos and\ncollectibles, this piece provides an ideal way to display your most\nprecious items. If you prefer a more minimalist approach, use this\npiece as wall art to create a focal point for any room.Colors: Dark brownFrame materials: Laminated MDFFinish: LaminateNo visible hanging hardware, hardware includedNumber Of Shelves: Three (3)Dimensions: 18.75 inches high x 26.5 inches wide x 4 inches\n  deepMaterials: Laminated MDFStyleContemporaryMaterialMDFFinishEspresso Finish, White FinishAccent TypeDecorative ShelvesShelf TypeDisplayAssemblyAssembly RequiredColorBrown, WhiteNumber of Shelf3"
}