{
  "name": "Laminated_Veneer_Corner_Wall_Mount_Shelf", 
  "price": "EUR 41.68", 
  "reviews": [
    "If you are placing this in an area where people can't really get too close to it it works well. I mean it isn't awful looking or anything like that, it is just laminate. I think it is unique looking and that is why I bought it. I used stronger attachments than what was sent with it so it is more secure seeing as I live in CA with the Earthquakes want to be sure it didn't come out of the wall. It looks nice but Laminate is laminate....again you can't tell if you have it in a location that people don't really walk up that close to it to tell. Fits my need so I like it. If you want something that is more showy you're going to have to buy real wood and that is 10x more expensive.", 
    "Picture looks much better than the actual piece. The design is very interesting and it's simple to assemble. However, the quality is low grade. I had initially bought this for the living room corner; however, after looking at how unnatural and cheap the veneer looked I decided to use it in my workshop as shelves.", 
    "I was very pleased with the shelf and how easy it was to install. If you plan on using it for DVD storage, they do fit, but you have to put them in exactly right. The instructions say to put it up with two people, but I installed it myself and it's still hanging.", 
    "These shelves are perfect for any corner of the room. I love them. You can put almost anything on the shelves and it really allows the room to come together and create a beautiful ambiance. I highly recommend trying this piece out if you have the same, are moving into a new apartment/house because it helps with the decorating process! :o)", 
    "These shelves look great on my wall. They don't hold a ton of stuff, but they definitely add a little pizazz to an empty corner.", 
    "I have been eyeing this shelf for months, but it was not in stock. I even put on my calendar when it was estimated back because I wanted it so badly! I absolutely love the design and think it's wonderfully functional for a corner. I highly recommend this shelf, I love it!!", 
    "What you don't see in the picture (clearly) is that the shelves are curved from the front so there is nothing really that you can put on the shelves except maybe a 4\"x4\"x4\" cube. Anything bigger will not fit.", 
    "I absolutely LOVE these shelves. I bought 2 of them and put them at either corner of my dining room. I get compliments on them all the time! They were really easy to put together, and easy to hang!", 
    "I was worried that I would receive some cheap particle board shelf, but I only needed a shelf to pretty-up a corner in my sunroom. What I ended up receiving was something of much better quality than I had expected--sure, it's not solid wood, but it's extremely sturdy and very attractive, and the finish on it makes it look like a solid-wood shelf. I'm very happy with this purchase!", 
    "My husband put this corner wall mount shelf in our dining room in the corner between two windows. It looks great and I am able to put some of those little items that you never seem to have space for and they end up on your table. I put a photo, a handmade vase, a small dish from Ireland, a few items brought back from Costa Rica by my daughter and a decorated glass bowl filled with dried flowers on the shelves. It has caught the eye of everyone who has come in the door. I also know that I can change what's on it anytime I want. As simple as it is to assemble, having instructions would have made it easier. You need to set it up so that the the top piece has a small screw hole in the center and that the bottom piece gets the large silver circular screw for decoration. The rest of the pieces have pre-drilled screw holes that make it simple and then they have walnut covered pieces that hide the screw tops. Aside from lack of directions, it's a great piece and I might order a few more in the future.", 
    "Bought 2 for each side of a mirror in the bathroom....Looks Awesome!!", 
    "Love them, look great in our dining room and family room, very pleased", 
    "I love this shelf ..it looks classy and unique. Almost didnt buy it because of a review saying it looked bad from up close. I find no flaws in this product. It's very easy to construct. I searched several sites and overstock had the best price for this item.", 
    "Pay attention to the dimensions or you might be disappointed. Goes together easily.", 
    "This was a great product and an equally great idea. We returned it however, not because of it's style or quality, but because we wanted to put our router up off the floor but it wasn't high enough to fit the router. If they made a taller one, we'd purchase it!", 
    "I would've liked the shelved to attach a bit more precisely. The joining point tends to be a bit short of a right angle, but it is relatively close. Considering that it is just a veneer shelf anchored into a partially pre-drilled hole in the end of the attaching shelf, it is what I should've expected. The end result is that the wall anchoring points don't end up being flat on the wall at the top and bottom pieces of the shelf. Once secured it does pull tight though. Once hung up it really does look nice. You would have a hard time finding something nicer for $$ dollars.", 
    "The object may seem larger online, but when you put it up and place items to display you have limited foot space. The space that you work with is just over 7 1/2 inches tall with apx 6 inch depth which limits you to small picture frames and other small knickknacks. However it has a unique look and can add interest to an otherwise dull corner.", 
    "Great product for the price. I was extremely pleased and would highly recommedn to a friend.", 
    "It was just what I needed to fit in a corner that was very dull and boring", 
    "this shelf is so cute ,hanging in the corner above my electric fireplace. Perfect for the spot. Most who see it want it.", 
    "I bought two of these shelves to utilize multiple hallway corners in my new home. The shelves looked like they would be great for displaying belt buckles that I have accumulated over the years. The shelves arrived together pretty quickly and were simple to assemble. Mounting proved to be a little difficult for one of the shelves which was sent with one incorrectly sized screw for mounting... which we only realized after pounding the wood screws into the drywall... great. We were able to hang the other shelf with no incident - so it definitely wasn't operator error. Slightly frustrating to make an additional trip to home depot for correctly sized screws, have two unnecessary holes punched through the walls in my new home, and a delay in getting my things up and displayed. Probably wont be purchasing from this manufacturer again.", 
    "I waited a very short time for this shelf to arrive and was extremely happy with it!! It is very unique and ads a warmth and charm to my family room.", 
    "This was easy to put together, fit together well, and is just a cool corner display shelf for any room.", 
    "The Picture is ALMOST exactly what to expect. What you cannot see on the picture is how all the boards connect with screws. These screws have cheap plastic caps to cover the head of the screw. After the caps are installed they standout and really ruin the clean finish look I was hoping for.", 
    "This is a great shelf, looks just like the picture. There are a lot of pieces to put together, but it only took about a half hour. It's a great looking corner shelf.", 
    "I saw these on sale and looked around my living room for a place to put it. I had a perfect spot as it turns out, so I bought it. I did not however read the description carefully. These are laminated veneer, which means they're made of particle board with a, in this case cheap, veneer over the top. They screw in at the top and bottom in the middle of the board, and they give you a plastic cap to cover the screw head. In fact, most of the screws holding the individual pieces are visible and must be capped. Overall it's not the quality I would have hoped for, but for a good deal they do the job of holding my travel souvenirs just fine.", 
    "This corner shelf is cool. It adds that little extra zing to the way your room looks. Great for displaying little knick knacks.", 
    "Product required assembly. It now hangs in my house and I am pleased to say that it is as advertised. Would I purchase this product again? Yes.", 
    "Easy to put together, inexpensive, and just really nice. Super modern and does require a near-perfect 90 degree angle corner, otherwise it will look completely off. I did have to switch its originally designated place because of this - but looks great nonetheless. Would recommend for small rooms w/ lack of storage space and few usable walls.", 
    "not thrilled with this product it looked like cheap furniture", 
    "Each square requires assembly and mounting, as such still sitting in pieces on my floor. Will hopefully look and support ok once I find the time to put it all together.", 
    "Thought it was a bit pricey, but I love the way this looks in the corner of my bedroom so much! It took a bit of time to assemble, but it was easy to figure out and put together. Hanging it was very easy, too. I'm using this to display my collection of vintage banks, and they look so cute on this. Really dresses up the corner of my bedroom where I've hung this. Completely happy with this purchase.", 
    "I bought two of these shelves to go on my wall and they look good. The pieces don't line up perfectly,but you can't tell when you are looking at them from a few feet. The finish is slightly cheap looking but could be painted. Overall the product looks good for the price and I'm happy!", 
    "I bought 2 of the walnut finish corner shelves for my bedroom. It took less then 20 minutes to assemble both shelves, any only a few minutes to secure them to the wall. For the price, I think they're great. They are very dark brown with honey hues to resemble walnut wood grain. The design is fun and unusual, and really compliments the decor in my room. Fast shipping and packaged very well. Thanks Overstock!", 
    "Product was shipped in a timely manner. This corner accent shelf adds character to any room. It's convenient for a room with not a lot of wall space and or if you have young kids that tend to knock your favorite pieces of tables and break them, because it's up high. Make sure before purchasing this shelf that you're aware of the 7 inch dimensions as you can only fit small and light weight items on this shelf. Also, it's helpful to make sure the corner you choose to place it in has a stud or the least sturdy sheet rock, so it doesn't leave huge torn holes in the sheet rock. I am very satisfied with this shelf and even went on to buy one for my son's bedroom!!!!", 
    "I ordered a few of these and assembled them slightly differently than the original intent. I put a pair together for the kitchen, to go on either side of the window, using only 3 shelves on each. They hold my prettiest coffeemugs, keeping them in easy reach. I added the leftover shelves to another pair that I mounted on the dining room wall, 16 inches apart, with straight shelves in between, to give me a place to display my cookie jar collection and some other decorative pieces. It looks like I bought it that way! Be careful when you assemble these shelves if you are going to use them in a pair. You have to make sure that the shelves face the right directions -- you don't want them exactly the same, you want them to be mirror images. I had to re-do one to get them to fact the right way.", 
    "Great shelves that fit in a corner. Took minutes to set up.", 
    "This shelf was easy to put together and is sturdy. I bought it for my sons room to display a few of his sports trophies and other items, and I think it looks gorgeous. He really liked it too, which I didn't think he'd have much to say about a shelf. I purchased the brown one, and placed it in the room against a blue-green accent wall, and due to the way the shelf zigzags between the two wall colors it looks really neat. It's good quality, I'm definitely going to purchase another one for my smaller downstairs bathroom to hold some decorations.", 
    "The piece looks great in a corner, near our corner computer table and really adds visual interest to an awkward double corner area. We can add small photo frames and it just pulls the whole corner together. Definitely not made of wood but when place near dark woods its looks great!", 
    "Liked it but seems expensive. Make it cheaper........................................", 
    "Nice shelving can be used anywhere. The next time I would order white color for my daughters room.", 
    "Excellent buy. Nice style and quality for the price.", 
    "This is a beautiful quality shelf and get unique. I have had no issues or complaints. In fact several compliments! It was very simple to assemble. Would look into buying another for family or friends. Definitely recommended.", 
    "Interesting method of putting together. True to the description of the product. Will have to be careful with the veneer and prevent scratching.", 
    "Pretty peice.Glad too have order that item.", 
    "We installed this corner shelf in our master bathroom and it looks cool. Easy to put together.", 
    "I really like this! It assembled in a few minutes. We hung it at the bottom of the stairs. It showcases several of my favorite smaller collectibles.", 
    "It was so easy to assemble and I am happy with it overall.", 
    "Love it for convenience in space", 
    "Decent quality for the price, looks beautiful on my bathroom. Great shelf space without taking too much room.", 
    "Once put together and wall maounted it looks impressive.", 
    "Very Satisfied with the product", 
    "got this in white and it looks really cute in the master bath", 
    "Excellent ....space saver .....good looking .....easy to put together ....Love it !", 
    "Cheap laminate but the price was also cheap!", 
    "It is made extremely well and looks beautiful. I recommend it.", 
    "A beautiful shelf!!Easy to put up and it looks really nice!!", 
    "Really good looking an easy to install.", 
    "Modern and sleek. Easy to install", 
    "Perfect addition to extra room to put some Nik naksLove it", 
    "Quality is a bit poor but overall good buy!", 
    "Love it! Easy to put together.", 
    "Looks very good. Easily assembled", 
    "We've placed this in our bedroom to display a few family photos - very original design. It's a laminate not a solid wood but you can't tell unless you get yo close. Great value for the $", 
    "If you're just looking for something cheap that will look good on the wall and hang your stuff, this is a good buy. I very much looks like laminate and cheap, but it looks cool in the corner and holds cute accent pieces.", 
    "This was a great buy the product actually looks better in person!", 
    "Looks great on the wall. Took 10 minutes to build. On the darker side of walnut.", 
    "it does the job and looks nice.", 
    "Perfect fit and height for corner self", 
    "Kind of my own fault for not really measuring, but these shelves are so small! I bought them for books and trinkets but nothing fits on them. I got it in white and it does look nice. Just make sure you measure the things you want to put on the shelves.", 
    "Gave as gift. Easy assembly. Looks great!!", 
    "Great for the price. They help add that extra touch.", 
    "Excellent for tight corners-where there's not much floor space...unique piece...made well...easy to hang up.", 
    "comes in too many parts and needs 2 people to install", 
    "Easy to assemble. Bought it in white finish to match wall.", 
    "Easy to assemble. Veneer is ok.", 
    "It's great just like the picture. Very easy to put together", 
    "Nice, sleek look. The plastic caps to hide the screws do not always fit, but its not the end of the world.", 
    "Good use for granddaughter's bedroom", 
    "THIS ITEM IS VERY VERY HEAVY", 
    "It's just what I needed for my wall.", 
    "best buy nice item you are not going to be desapointed", 
    "Great solution for corner of wall", 
    "Love it! Just what I needed!", 
    "It was what I ordered and came on time", 
    "Very easy to put together. It is exactly what I was looking for in my small living room. The quality is good. It looks even better on my wall.", 
    "had need for something just like picture", 
    "Looks gorgeous. Came in perfect shape and exactly what I was looking fir", 
    "The fact it is not real wood is why I gave it 3 stars. It is fairly aytractive.", 
    "Easy to assemble and mount. Brought the dining corner to life.", 
    "I ordered the white corner wall mount shelves, and the walls that they are on, one is Edwardian Gold, the other is burgandy, it looks so fab!!!!", 
    "Got two of these put them up and down a wall they're perfect", 
    "Was looking for a small corner shelf & this one looked just right. It's sturdy and easy to put together, but gave it a 4 star because it is extra small. You will not be able to put an average size paperback on the shelf without it hanging over. Will work to hold most cell phones if it's next to bed.", 
    "love it, easy to put together.", 
    "easy to assemble, but spacing of shelves is a little tighter than anticipated", 
    "Nice add on to my basement.", 
    "Shelves are smaller than I thought they would be. Like the way it looks in the corner.", 
    "This is a really pretty shelf and it hung so nicely.", 
    "Incredibly easy to assemble. The directions say it will take you 30 minutes and two people are needed. I did this by myself in 25 and by no means am a professional. Be aware, though, that this shelving unit is too small for books (as I later realized). This is evident in the photo with the props they use but I didn't realize it until I put it together. Overall, this is a great shelf and not too expensive. I'm happy with my purchase.", 
    "Luv it. Works great in space", 
    "Took about an hour to assemble because they don't give you normal screws, they make you use the tool provided. The screws are about 2\" long and it hurts the hands. Being able to use a drill would have taken the build time down to 5-10 minutes. I don't like how companies are doing this all the time now. It's fine on the wall, but the shelves are narrow and hold very little. I could've cut out my own squares and screwed them together myself with a drill, and had more shelf space while saving time and money.", 
    "You have Nice furniture looks great in my homePrice is right!!!", 
    "It was perfect spot for place in my brother's home to place artifacts, etc. Looks good. Rather heavy and needs to be anchored to studs.", 
    "Looks darker then the picture but it still great", 
    "Easy to put together and they look great!!!", 
    "This is a great shelf! Very happy with purchase!", 
    "These were the perfect solution for an empty corner. Made nicely. Shelves themselves were smaller than I expected so be sure to read the description.", 
    "You get exactly what you paid for. Its a sturdy set of shelves!", 
    "Perfect,looks very nice in my living room corner.", 
    "Very nice,it is big beautiful.", 
    "Look just like the picture. It will take a little time to set it up.", 
    "We purchased the shelves for the living room since I didn't have any space on the floor shelf. The shelves are easy to assemble, have enough space for all the items I needed to accommodate.", 
    "nice, I put in office area", 
    "These are so cool and I love them in the small place in the kids room", 
    "Great addition to my craft room. Holds and displays my jewelry busts.", 
    "My daughter has an odd shaped room with low ceilings. We bought this to house her lotions, perfumes, etc. Worked out PERFECT!!", 
    "Love it, it is so pretty in my living room and it was very easy to put together.", 
    "Easy to put together and perfect for a small space.", 
    "This shelf is perfect for a corner nook of a room. It is easy to assemble and fits one item on each shelf.", 
    "This shelf is awesome, it really ties our room together and is perfect for accent pieces", 
    "It is very large but very sturdy. I really like the design. It has an old fashioned look about it.", 
    "Not to my expectations. Too dark and not able to hang the unit because of the weight and the screws will not stay in place when screwed in. Afraid to hang it because parts of the unit is weak. Would not buy again.", 
    "It didn't wow me or anything. It's a $** corner shelf, can't expect much. I put it together in about 15 minutes, Installed with the hardware that came with it. Picture is somewhat deceiving, because it's small (4.5 inch shelves), so measure it out to make sure it's right for you. Overall I recommend.", 
    "Not sure how sturdy it will be But very cute and will work nicely in corner that was bare.", 
    "Shipment arrived today. Every shelf is damaged. It appears the package was dropped or thrown off the truck at some point during shipping. Foam packaging inside the box did not provide enough protection. The veneer is dented and cracked on one corner of each section. As though the box hit the ground very hard on one side. This could be a nice looking item if not for the damage. Therefore, I'm only giving you 3 stars.", 
    "We like the shelf, we have a split level home. So we installed it above the steps in an empty corner and put pictures, nick nacks on it with a small vase with artificial flowers on top. Really gave that corner what it needed. Note. When I receive the box I thought we were missing something because the box is only 8x8. Found out it's easy to assemble and looks great.", 
    "What a find this fit perfectly in an odd space and looks beautiful too", 
    "Although this product took awhile to put together, it is exactly what I wanted.", 
    "Cheap looking...shelves too small", 
    "Love them they look great", 
    "Overpriced for cheaply made product.", 
    "Everyone loves this piece in our home, so much so that we have 2 of them. We really do like the look, however it is laminate and either our new home's (2012 build) wall corners are not square, or the wood doesn't fit together at exactly 90 degree angle. It still can be fastened into the wall securely, but there is a gap. Still very pleased with it.", 
    "Good quality. Looks great", 
    "Sturdy elegant and very functional", 
    "Just what I needed. Love them.", 
    "Easy to assemble fit perfectly in my daughters room ! She is using it for books", 
    "It was so easy to put together and its very sturdy", 
    "Easy to assemble and install, but small compared to corner shelves I previously ordered on ******.", 
    "Easy to put together! Cool looking.", 
    "this product arrived without instructions and it was not clear how to fasten it to the wall. It has a wood finish veneer sticker on it and looks really nice but for some reason did not fit in the corner of our home very smoothly; I suppose we live in a crooked home..", 
    "This shelf is well made and it looks so unique on my wall. It is a good use of corner space.", 
    "Took some time to put together and mount right on the wall..Looks great those after putting some effort to do it right..Suggest you use a power tool other than the included tools as it takes a while to assemble", 
    "smaller than I thought but a great display for my tea cup collection", 
    "i like how it looks on the wall, but its a pain to put together.", 
    "I got on time without damage", 
    "Easy assembly and installation.......would buy again", 
    "Sturdy and good. Pretty easy to install it", 
    "VERY NICE Product!! Worked well For our Living ROOM.", 
    "Perfect spacesaver. Shipping was fast.", 
    "nice shelf, but a little on the small side because you can barelyput anything big on it..", 
    "Great corner shelving to add pictures", 
    "ERVFIHJRWOIFHJHFJOAIREHFJOIWREHFJOIWREJFOIREWHFJRW", 
    "Love it. I receive many complements. Most people ask where I got it.", 
    "This is absolutely the best and the most gorgeous item for decorations on my living room this whole entire year my wife loves it very much too just like I too....", 
    "I love it!!! It was very simple to assemble and it looks great in my home!!!", 
    "Good quality for the price. Can only sit on one wall in corner not reverse able", 
    "I like this shelf very much. It's easy enough to assemble and it looks fantastic!", 
    "This is a cute shelf. easy to put together, not a fantastic material, but it works. I wish the actual shelf was a bit bigger. We did drill a 3rd support hole because we will have a few heavier things.", 
    "This looks great on the wall. The deep brown wood gives a rich appearance. However the little plastic tabs that hide the screws do not fit well and fall out. You have to put a little clear glue to hold them in place.", 
    "GREAT looking, useful and easy to mount. You will need a hammer and a small screwdriver.", 
    "Very cool looking. I really love it! Had to use a bit of super glue to make the brown stoppers stick to cover up the screws. They kept falling out. Very small price to pay for such a unique piece:)", 
    "I love the color, and it fits perfectly in the corner my bedroom! Love it!", 
    "This cabinet looks great in my bathroom corner to create additional storage.", 
    "Great addition to my home", 
    "It is a great fit in the area.", 
    "The white brightens a dark room and the shelves utilize wasted space. Easy to put together.", 
    "This was so easy to put together and adds a real chic look to my brand new retreat", 
    "assembly is a bit odd, numerous screws that are covered with plastic buttons.", 
    "Great addition on my livingroom", 
    "Love the shelf! Easy to put together and good quality.", 
    "Great idea to have a focal point in bedroom. Nice accent piece.", 
    "The shelf is made well, looks good, and easy to put together.", 
    "Holds alot and looks expensive", 
    "Exactly what I was looking for and very decorative", 
    "a little tricky to line up to mark and the wall anchors' that came with it does not hold this shelf because it is heavy. But it seems made and color nice.", 
    "This little shelf is perfect. I purchased one several months ago and it has been one of my favorites because of its size. It fits in a corner, is big enough for picture frames, small flowers or knickknacks and showing off special cards, giving them a safe place to hang out!", 
    "Great purchase. Looks amazing.", 
    "What you see is exactly what you receive, I can't find the words to tell you how this made such a difference in my corner. It was easy to put together, the quality isn't too bad this piece will be around along time. The only problem I had was the covers for the screws didn't fit. It was a easy fix I glued them on. Don't hesitate to buy this you will be happy.", 
    "Good looking. Fairly easy to put together.", 
    "I am super satisfied , it looks nice in my room!", 
    "I bought the white shelf system some time ago and I love it. It's unique and I am complimented on it frequently. It installed easily.", 
    "We were hoping the shelves would be a little bigger. We can't fit much on them. A 5x7 frame barely fits and has to be horizontal. Besides that, its fairly easy to install and looks great.", 
    "The description claims it will hold many things including books. I wonder if by books they meant thin 20 page books - It holds nothing heavier! So very disappointed.", 
    "Looks great and have received a lot of compliments. Adds a little something different without being to big and allowing for clutter.", 
    "This looks great in my stairwell. Wish I had another pair of hands installing it. It's not quite into the corner on the bottom but I didn't know until I was done.", 
    "Still in the box and wont be opened until Christmas which is a couple weeks away. Had to do a review after four email requests from Overstock.com.", 
    "This shelf was way more than I expected! The quality is great and the surprise was the wonderful size. Most of my collectibles fit, so now I need a few more of these.", 
    "Worked great for my corner", 
    "enhances corner in a unique way", 
    "I ordered this shelf from another company and paid way too much. I wanted another one for my room, so I checked out Overstock and found the exact shelf for half the cost. It took my hubby about 20 minutes to assemble and it looks great. It is just what I wanted. Shipped fast, too! Thanks.", 
    "Loved it so much I am buying 2 more!!", 
    "I don't think I would order another it worked in the space.", 
    "wood veneer item but somewhat cheap looking .No nproblem with returns from N.Ireland Thank you so much", 
    "Looks very good in my \"fun room\". Quality all around! Packaged well. Happy I found these shelves!", 
    "I love it and it looks so gorgeous in my office. I got so much compliment about this book case and 2 other wall mounted. all of them look great and perfect to use for decoration stuff in my office. I love it", 
    "This shelf was easy to install, and it looks great in our computer room.", 
    "Looks great on wall, a little different from a normal shelf. Only thing is the screw cover plugs are a little big, making then somewhat visible depending on the angle you look at", 
    "I love this piece it is so beautiful", 
    "It was easy to put together & looks good!", 
    "Exactly as I had hoped. Perfect for the space.", 
    "Easy to assemble and very sturdy.", 
    "I'm not a fan of fake wood:-) with this lovely piece you can not tell. Fits true to shape and the style is amazing. Color match my décor perfectly..", 
    "I really enjoy this shelf, everything I expected.", 
    "Perfect. Had my son put it together. ..gave it to him.", 
    "Took about 20 minutes to assemble. Very easy to install. Looks really cool in the corner. Had a few compliments on it already.", 
    "Unit is too small. Make sure your walls are square. Will be noticeable if not. Ease of assembly is questionable. Boards do crack.", 
    "Very small shelves and cheap particle board. Never put it up, gave it away.", 
    "Get a ton of compliments!", 
    "wonderful item looks great , I bought 3 more.", 
    "Thumbs up absolute thumbs up.", 
    "lovely design and easy to assembly", 
    "Excellent shelf! Even though it's on the smaller side, it adds a dramatic pop to any corner.", 
    "It looks just like the picture. Easy to assemble. I have an older house so my walls are a little off but you can't see it. Love it. One of my favorite pieces.", 
    "I ordered this in white, & it is very lovely. I plan on ordering more, because they look so good in each corner of the room. They were very easy to put together & mount.", 
    "Very simple to put together and to install. Definitely good quality for the price", 
    "great for space-challenged areas!", 
    "I ordered these corner shelves for my daughter, as her bathroom isn't very big, she's a teenager so she has heaps of stuff on her vanity. The shelves don't take up any extra space,they look so cool too! I just ordered a secon set!", 
    "I bought the white one, it went together easy and looks real sharp in the master bedroom.", 
    "I really like the look. It fills the space well and does what I wanted it to do.The height of the shelves however is shorter than I expected. I can't put some of the things I wanted to put on the shelves.", 
    "Shelves are heavy and well built easy to put together but very time consuming you need to attach all shelves together but it wasn't hard to do. It's a creative way to hang shelves and uses a minimal amount of wall space and looks very nice", 
    "Looks great. It was very easy to assemble.", 
    "Easy to assemble and looks good. Other websites sell it for more than O.com", 
    "This piece is not what I expected. It looked great in the picture shown but once assembled, it looked cheap. I put it in the back of a closet and am not using it - nor do I plan to. I would have returned it but the box was discarded before I had that opportunity.", 
    "These are perfect for my home! I ended up buying two! :)", 
    "Took some finesse to build but look great now that they are up", 
    "Worth the price. Be careful putting it up. You may need help.", 
    "Great Addition to the room", 
    "These shelves are perfect to display smaller items. I have them in my daughter's room and they are great for the little knick knacks kids seem to collect.", 
    "Love this, used in a small bathroom for deco, very nice quality.", 
    "Great design but mine did not sit flush. Has small gaps. Tired to adjust but couldn't.", 
    "perfect addition to my living room", 
    "So glade I decided to get this. It fits perfectly on my wall by my vanity. It completes my vanity space so well.", 
    "I actually bought for two for two corners of my living room. I love it.", 
    "It is nice showing off collectables , but then I see it in all sorts of catalogs .I had hopes for something unique..", 
    "Very flimsy. When attached to wall it bowed out from wall in the middle. Had to add extra nails on additional shelves. Looked good though after putting stuff on the shelves.", 
    "unique, fun to look at and displays great", 
    "Dresses up corner nicely. Easy to put together.", 
    "Cheap...wobbles loose. Wouldn't buy another one.", 
    "It is very simple and show piece", 
    "Easy to mount. Looks great.", 
    "easy to assemble... believe it or not... its held to the wall by only two very long screws. it can hold quite a bit of weight... but nothing too heavy... it always captures everyone's attention.", 
    "very easy to install, looks great", 
    "It's good view and useful", 
    "Just moved again and had to down size, my husband had a few things I know he wanted to display, this is perfect on the corner wall in our bedroom.", 
    "I put it up and it looked okay. Unfortunately, the corner where my two walls meet is not truly a 90° angle, so it didn't completely line up. Good for college student dorm room.", 
    "Thought shelves would be larger. Probably didn't check for sizing before ordering.", 
    "A little pricy, but worth it!", 
    "Easy to install. Looks good", 
    "works as described, the finish does look a little fake but its formica as described so its to be expected.", 
    "Very pleased with this purchase !", 
    "wood looks cheap and not up to par for the price", 
    "Was pleased with product. Did the job and fits in wall corner perfectly. Would have liked the quality of the material to be little better, but does the job for what I needed it for.", 
    "I love it. I was worried when I ordered it, but it fits perfectly at my house.", 
    "Not what I needed size-wise (my fault) bit also didn't like the materials. Should have paid more attention.", 
    "Much smaller in scale than anticipated but works in my daughters bedroom. Cute with the corner desk.", 
    "Just what I was looking for!", 
    "The only problem I had was the wall mount wouldn't go in so I used my own.", 
    "I have a corner that needs something and this was jus perfect for all the small pictures and things my husband gave to me, any the grand childeran gave to me. This way I can see them everyday.", 
    "Great item for nic nacs. Looks nice hanging on your wall. However, you'll need a bigger self for bigger books.", 
    "This was a request so I sent it as a gift. It was exactly what my recipient wanted and fit perfectly in the corner. No complaints.", 
    "Got 2 for my wife's spa room where she does her facials etc. Everyone loves it!", 
    "Imagined this shelf would be bigger then it is. Over all it's good. Sit nicely in a corner. Missing one peace to cover screw head but not a big deal.", 
    "Easy to put up. Easy to put together. Adds character to the room", 
    "They look great in my living room corner", 
    "Bought 2 and placed in corner going up the stairway and they look fantastic. Took approx. 30 min to put one together,would have been faster with a power screw driver. The shelves are not wood but wood product but they look good and are durable.", 
    "just like it looks in the picture , nice quality", 
    "Was perfect for the corner in the Living Room - not too big, just right", 
    "Item arrived on time. Quality is good. Easy to put together, however, it is a challenge if you hang by yourself.", 
    "Excellent item for an empty corner, very cheap and looks great!", 
    "Please advise. I never received this item.", 
    "very sturdy and worth your money", 
    "I like this very much. It was what I was looking for", 
    "I bought two and put in the corners of the room and they look fantastic", 
    "Easy to install. We'll made. My daughters love this in their bathroom. They can put essential items on the shelves.", 
    "Used in my office. Has a real modern touch. It gives the illusion of being suspended. Easy to assemble", 
    "Easy to assemble and pretty strong construction.", 
    "This is an awesome unit. Easy to put together and get on wall.", 
    "This gives my living room and corner a touch of class .", 
    "Took a half hour to assemble and hang looks very good on the wall.", 
    "Put it in dressing room Love It!", 
    "Shelves are small so it's only useful for light display.", 
    "My 14 year old son put it together. It holds part of my elephant collection.", 
    "Its very good corner stand. and looks awesome", 
    "What a find. Love the shelf , wish I had purchased another", 
    "ASIDE FROM OVER ANALYZING HOW TO PUT IT TOGETHER ONCE I READ THE BRIEF DIRECTIONS IT WAS VERY EASY AND ATTRACTIVE. IT IS ACTUALLY SURPRISINGLY MORE ATTRACTIVE THAN I THOUGHT FROM THE PICTURE.TAKES UP WASTED SPACE,", 
    "Perfect for the space in the front entry", 
    "I received the white laminated shelf and really love it! At first when I received it unassembled I thought it was going to be difficult to assemble but it was actually very easy. It added a nice dimension to my bedroom and I would suspect in any room as well. Highly recommend!", 
    "Don't have alot of room, this shelf fits perfect in any corner. Perfect use of shelf space, and the price was within what I wanted to spend.", 
    "The unit looks great, but came in a small square box. All pieces had to be put together, some holes had to be re-drilled and do not use the wall anchor bolts that are included.", 
    "My shelf are perfect for my corner coming up the steps to the second floor they r very unique that's what I loved about them", 
    "Instructions could be clearer but otherwise a great deal for the price.", 
    "Perfect for corner. Out of the way.", 
    "I put this in my master bedroom to get some of my nic-nacs off my dresser & night stands. I'm seriously considering getting one for the other corner. I'm very happy with it & it was easy to put together.", 
    "I had read reviews before ordering. It made me concerned about putting it together!? My 14 yr old had no problem! Love it!", 
    "My living room is small and I love this corner shelving to display some keepsakes. It does have to be assembled, but it was done easily and all the screws, etc were included that were needed.", 
    "Has caps that go over screws makes the shelf look cheap. The shelf is also laminate.", 
    "Nice design! I like the style of it!", 
    "Easy to assemble very cute", 
    "very nice,like the offset shelves...love it", 
    "I purchased two of these items on which to place figurines and other display items. I've mounted one and have small Obama artifacts on display. I've yet to decide where to mount the other.", 
    "This worked perfectly in our odd corners. however the pieces were not predrilled correctly so we had to redrill in order to have the edges align nicely.", 
    "Easy , fast to assemble. Placed in the landing of my staircase, beautiful accent to display novelties and pictures. Love it!!", 
    "I put them left and right side of my TV console ..look awesome & different.", 
    "Don't put too much weight on them though", 
    "Easy to set up and install, and perfect for my little space.", 
    "Ok, so I was a bit skeptical because I was worried these wouldn't hold or look cheap but it's really great. It adds to the space so the walls are so bare plus it's sturdier than I expected. I purchased 1 more so that I can put it on the adjacent side of the wall. Love them!", 
    "Love this thing! Gets lots of compliments, doesn't hold much but is easy to assemble and seems sturdy.", 
    "I've had this for a while now. I actually ordered an additional one after I got the first one up. My only complaint is that it's not the easiest thing to put together. I have no trouble with this sort of thing, but for average person it may be a little difficult. It's just a bit awkward, I suppose. Once it's together and up on the wall, though, you'll love. It sure do!", 
    "Bought this for my daughter and future son-in-law to \"spruce up\" their apartment, and it looks great! They have candles on the some of the shelves and some nick-knacks on others (it pretty much looks like the one in the photo. I'm actually going to buy them another one it looks that good.", 
    "This shelving is great for decorating to display those objects that you love to view where previously they were behind glass or in a drawer.It is fairly easy to put together. When it is purchased in white rather than a wood color, the objects stand out on a white wall. Thanks Overstock!", 
    "Exactly what I was looking for its beautiful", 
    "Excellent- Worth buying from Overstock", 
    "I really love this shelving -- it strikes a balance in the living room between taller vertical pieces. It's eye catching and looks very nice. My one wish is that it would have been a little larger shelf and would have a little more space between the shelves. I am limited as to what I can put on the shelf - not a lot a room. It was easy for us to put together and It's going to stay where it is because it looks great!", 
    "This shelf add lots of style to home decoration.", 
    "Looks great in my office!", 
    "I had to use washers to get the unit to work since the holes for the screws to go through were too big I should not have to do this but I guess that is what you get for an on line purchase. All else was fine.", 
    "These are the real deal they work well is a corner and let you see what's on them. I have one in my right corner, I'm going to put one on the left side of my bath cabinet also. If you have a 7 3/4\" spot this will fit real easy.If you want solid wood these are not for you...CB", 
    "shelves just don't hold enough", 
    "Looks really nice in my daughter's nursery.", 
    "This was very easy to put together. It fits well in the corner and it does exactly what I wanted it to do.", 
    "Easy to assemble and hang. Looks fabulous and provides a nice show place for nic nacs--in my case a collection of white salt and pepper shakers, sugar bowls, and other white nic nacs.", 
    "love it! must drill holes in the wall to support it.", 
    "POORLY MADE SHELVES WILL NOT HOLD MUCH PICTURE IS DECEIVING LOOKS LLIKE IT HOLDS MORE THAN IT REALLY DOES CHEESY", 
    "If you don't have perfect corners in your room, this shelf will not be usable.", 
    "easy !!! and love it put it in the bathroom", 
    "My living room needed to come into the 21st century without going ultra modern. This bookcase stood out as a simple but striking way to accent the corner behind our grand piano. We redecorated the whole room, but everyone who comes in notices this little corner bookcase and wants to know where we got it. Easy to assemble, about 10-15 minutes, and easy to mount, 2 screws. A neat way to show off some special glassware, but could easily hold other items. I love it!", 
    "Smaller than I anticipated, but useful for small corners. Nicely made.", 
    "I got this for my newly remodeled bathroom - I needed some thing in the corner by the footed tub & this was perfect! I have a number of nicknacks on it and I have gotten a lot of compliments.", 
    "product description was accrue ,delivery was fast ? enjoyed shopping with you and will do so again.", 
    "My daughter loved this shelf for her office", 
    "This shelf is perfect for displaying your items without taking up valuable wall space. Well made.", 
    "I love this easy to assemble & hang corner shelf. I could have bought the unstained wood from a hardware store and a lot of hardware and time and it still would not look as good. Price is great for a beautiful shelf. I am planning on buying another to add to this one. It looks fablous, elegant yet so homey. Thanks overstock for another great product.", 
    "love the corner look of the shelf, easy and fast to put together", 
    "The color matched perfectly for what we were looking for. The shelves are small which keep from too much clutter happening", 
    "I bought this for my daughter's school apartment. This is true to color and is VERY heavy. It is sort of awkward to handle. I recommend using anchors when mounting to the wall. Once in place, its there until you take it down. She has since found a place for it in the next 2 apartments she's been in.", 
    "Love these shelves and would have bought more if I knew how perfect they were. YES, they are small but I put in flameless candles and it's beautiful.", 
    "Beautiful addition to my living room. Shelf was easy to assemble.", 
    "Just perfect for what I needed. Takes up almost no space and gets lots of items a place to be displayed attractively.", 
    "It turned out to be a perfect corner shelf for our living room and was as shown in the picture. Arrived on time and packaging was good.", 
    "I have this little corner spot in the new apartment I just moved into. This is the perfect 3 dimensional accent piece I needed. I wasn't looking for it, but Overstock just popped this up and I LOVE IT! Easy to assemble, easy to mount on the wall. Perfect.", 
    "Great use of usually wasted space. Can be used at any height.", 
    "The color of this is just beautiful very rich looking", 
    "Bought as a gift. Looks great in my friends new home!", 
    "It look amazing , same color as picture", 
    "Hangs well, good wood, nice for room spaces", 
    "I bought two shelves and added them together. it fits down the whole side of my wall. My family and friends gave me sooooo many compliments on how nice it looks. Very Modern style!!", 
    "perfect for my corner in the basement!", 
    "This is a great corner shelf to give a room a little life!!", 
    "Great shelf for little things that need to be stored.", 
    "Got this as a gift for my son, he ha a small apartment and this perfect. Made well and looks great.", 
    "Takes a little while to put together, however once installed looks great.", 
    "A little smaller than I thought.", 
    "It look very nice ,only price could be a little bit cheaper", 
    "The color is darker than shown in the picture (for Walnut finish)", 
    "This item looks absolutely fantastic in the corner of my family room. The shelves and height are designed for small knick knacks, but it looks great. Easy to assemble and mount. Very sturdy.", 
    "I was satisfied with this purchase, but was a little surprised when I opened the box and saw the size of the shelving unit. SA little smaller than I anticipated, but what I paid, it looks great and was easy to assemble and put on the wall. A welcome accent to the Living Room. Overall I am satisfied with the purchase.", 
    "easy to assemble and install. loved it so much I bought a second one.Price was good and shipping was fast", 
    "It is smaller than you would think. We put this in the bathroom and it is not able to hold very much because the shelves are very small and close together. Other than that it is a nice corner shelf.", 
    "Nice looking shelf and is nice looking for small item", 
    "Looks great and has many possibilities of arranging it. Beautiful for a low price", 
    "Laminate looks well made and was easy to assemble Great addition to my living area might purchase a second for dining room", 
    "This makes a nice, subtle statement in our living room. I am so glad I bought it!", 
    "This is a beautiful shelf. It is true to the pic and it only took my boyfriend 20 mins to put it together. He hung it with the Command Velcro tape and it was perfect! It's tricky to find items that aren't too tall for the shelf but we had some candles and a few other things that fit nicely on it. I would recommend this item!", 
    "Not the best made shelf we ever bought, but once it is installed, it is very sturdy. Did not expect more for the price but am not sorry I bought it. It is a unique corner option!", 
    "got mine in white put it by my stove for spices", 
    "I have not had the \"energy\" to put this together as yet. Comes in a 10\"x10\"x10\" box.....so that should give you a good idea of what you'll need to be doing.In my opinion it is very cheap looking, so it is not something that is going to fit into an upscale decorated household. I will probably just give it away.", 
    "Laminated wood, but it's still a cool shelving system.", 
    "I like the idea for this shelf, its unique and places nice trinkets on display. The only problem I have is the the pieces don't lock in edge to edge, which in turn gives some of the pieces that are against the wall a small amount of space between the wood and the wall.", 
    "A little wobbly in the center, added an extra nail, works perfectly.", 
    "If you have a daughter who is a clutter bug, but you have limited space for shelving, this proved to be great for our needs. Easy to assemble too!", 
    "Product was easily assembled and looks great in my usage of it.", 
    "I like these corner shelves. But I've come to find out I don't have enough corners in my house. But I will find a place for them because I love them", 
    "I adore this unit. It hangs in the corner, and it all of my personal stuff that would not otherwise be displayed.", 
    "I love it and is just as described", 
    "It's a perfect addition to maximize space.", 
    "Easy instructions sits beautifully on corner wall.", 
    "Easy to put together and my only complaint is the cheap plastic covers for the screws.", 
    "nice accent could of been made with better quality but for the price its good!", 
    "I had to use superglue on the buttons as I wiped the shelf and they came out. Okay product for the price.", 
    "Put it n a bedroom to soften up a corner and it works well. Easy to put together and mounted easily. Looks good but if u r up close u can tell it's not real wood but who looks that close and who cares, it's a shelf!", 
    "great shelf looks good in our living room", 
    "Quick shipping and as described! A++++", 
    "I bought the white laminate. It adds a little touch to a small blank corner. It was a little tricky to put together, but my man is very handy, so he had it up in no time. Goes well on my grey walls with white trim - ties it all together. Very nice, modern accent shelf.", 
    "I am pleased with my purchase:)", 
    "Horrible instructions, impossible to put up.", 
    "This thing is a breeze to put together and looks wonderful on the wall... Only bad thing I could say is the brown screw covers do not all fit very well.. I was having to super glue over half of them on so the screws would not be exposed.. Other than that it's a solid win", 
    "The shelves arrived on time. It was not as easy to put together as I thought it would be. I tried to do it myself, but needed my husband's help. They look nice in the corner, although they're a little smaller than I thought they would be. I'm only able to put one small or two tiny items on each shelf. Overall, I am satisfied with my purchase.", 
    "Shelf installed with no problems", 
    "nice corner shelf for your little nick nacks", 
    "A new and different way to display things i have collected.", 
    "Easy to put together. Surprised at how nice it looked. Shelf space is a little shallow. I have been redoing a bedroom...neighbors stop in to see what else I have done including some of my personnel art work. The Corner Wall Mount is the eye catcher. Everyone wants to know where did I find them and how much.", 
    "Beautiful piece of workmanship, fast shipping and reasonable price!!", 
    "Excellent shelf for the price. Looks great and easy to install. A definite recommend", 
    "I really love this always wanted it but didn't want to pay the high price the ******** had it on so when I seen it on overstock I had it get it the only thing that I'm disappointed with is that not all my books fit there it only fits a DVD size but other then that I love it I even bout two white one for my girls room", 
    "Very beautiful, I liked it more when fixed it at the living room.", 
    "For the price, this is a very nice shelf. It takes quite a while to assemble and both the floor and I were covered with styrofoam pieces. However it looks nice and was a good purchase.", 
    "Not very sturdy, but I still like the look. I put it in the corner wall of my bathroom to add candles.", 
    "Great addition to an otherwise u useable corner space! Perfect size for what we needed. Good quality and easy to assemble. Worth the money.", 
    "was easy to assemble and looks great in corner of room", 
    "Arrived in a timely manner and was easy to assemble and install. Looks great in my home and gives it that little pop I needed.", 
    "Great for th ed price love it and looks very nice.", 
    "For the price, this is a practical, creative item for a tight corner space that can add some interest and flair to any room.", 
    "Perfect little shelf. Holds quite a lot and is very stable. Looks great, nice and not cheap looking!", 
    "Unique shelf that gives a nice touch to any room. Many compliments on this shelf", 
    "Product was just what I needed to hide a seam at the corner of the wall where the wallpaper with large print didn't show well. This white shelf looks great and due to the white color isn't heavy looking in this basement room. It is heavy in weight and needs to be well anchored.", 
    "Was looking for a sleek yet small decor for our tiny half bath, and this laid perfect on my plan. It fits well in the corner with no space consumption and looks elegant. I also got lots of compliments for it on our housewarming party. Easy to assemble and fit on the wall. My husband had to struggle a bit finding the stud and drilling the wholes but finally we were able to put it up. Would recommend this product for any small space which needs to get a fresh look.", 
    "It's cute and easy to assemble.", 
    "I needed something small and a little extra for kids photos and this was perfect. I was just what I've been looking for.", 
    "I ordered this shelf in white and I love it.. It really looks nice and is very unique .. I'm always getting compliments on the shelf and it was so easy toPut up.. I'm ready to buy more!", 
    "very practical for a small spot that was not going to be used. We really like how it all looks now👍", 
    "Very sturdy product, easy to put together. Looks great on the wall. Just the perfect accent to highlight a corner. Love it!!", 
    "Easy to assemble looks great in kids rooms", 
    "The shelves are really nice and affordable. Although they come in pieces, it is very easy to put together and to install. I bought for my baby granddaughters room, for her cute decorations :) It added a nice touch to match her crib and dresser.", 
    "I have purchased a couple of these shelving units for my bathrooms, they don't take up any space and with a couple of small baskets it is great for extra storage.", 
    "Looks interesting, clean lines, and easy to assemble. Of course it's not made of real wood but a laminate instead. For the price it's great!", 
    "putting this together and attaching to wall was very easy looks good", 
    "Lovely design and perfect for small spaces.", 
    "This looks amazing on the wall. Easy to assemble and hang. Just the perfect amount of unique I was looking for.", 
    "The shelf is very neat and not to big nevertheless it makes a big statement I recieved it and assembled it quickly and easily.", 
    "Easy to assemble. Highly recommended", 
    "It is easy to put together, and comes with screw covers so you dont have unsightly silver screws all over your shelf. It is only screwed into the wall on the top and the bottom, so you dont want to put anything that heavy onto it- or at least I wouldnt. but it is a great addition to our living room- thinking about buying another one for the bedroom!", 
    "Love this piece. Really perks up a bare corner. Unique.", 
    "Loved these shelves. They look great and were so easy to put together", 
    "This is an excellent item and really looks good.", 
    "This accent wall peace was very easy to assemble and screw to the wall. Very pretty", 
    "Simple assembly and a very nice modern look!", 
    "It's a nice little addition for small objects to be displayed. It comes unassembled but is easy to put together. It works well in the townhouse where I live.", 
    "for the price you are getting a decent quality shelf that looks great, it's a lot of style for a fraction of the price. Be prepared to have to vacuum after opening the tiny styrofoam pieces get everywhere. Preferably open outdoors.", 
    "Built for light-medium loads, I would not place heavy items on the shelves but it is sturdy enough.Easy to put together, nice looking on the wall.Each shelf hold about 8-10 DVDs with no problem. If you put the covers over the screws, few of the movies are a tight fit - but it des serve to keep them in snugly.I also purchased the smaller version of this from Overstock and am happy with it - am still in the process of remodeling our apartment so have not hung them up yet, but they are together.The only thing that may be a concern for me in the future (not now, it seems sturdy enough for movies) is that there are only 2 screws attaching it to the wall - one in the top square and one in the bottom.", 
    "Great corner piece, takes up very little room yet you can put your smaller pieces on them", 
    "We had an open corner and since taking down our christmas tree it looks really empty. I found this shelf and we got it yesterday, I put it together as soon as I got home and we got it up first thing this morning and I can't stop staring at it. It matches all the original woodwork in our house and completely fills in our empty corner and allows us to display some more beautiful things. I seriously can't stop looking at it or telling ppl about it. It looks really great and it's super unique and cool. LOVE.", 
    "I used it in my store and it is so pretty.", 
    "Fit like a glove and looks great!", 
    "This is a very nice item, really adds to the décor, easily assembled.", 
    "This corner piece was very easy to setup and is a great compliment to my living room! Great purchase!", 
    "Looks Great perfect for the corners", 
    "Quality and color as mentioned in the listing. We use it for display as well as utility.", 
    "Very unique shelf and very easy to put together!", 
    "Love this. It looks great!", 
    "This looks so amazing in my bedroom that I don't have to put anything else on either adjacent walls!!", 
    "Love the shelving...looks great and adds to the room a nice design!", 
    "Suits needs but wish I would have bought some that had a little more width.", 
    "Cute and easy to put together! Using it in the guest room with little trinkets on it. Cute!!", 
    "it brings out all the hidden beauty in my living room . I love it greatly", 
    "I like this shelf very much however it is laminate and should be used in an area where you don't get too close to see the laminate. It serves a great purpose and is unique.", 
    "Easily assembled and perfect for the room. I would recommend to a friend who is looking to dress up a corner wall.", 
    "Fits in corner like it was made just for it; holds heavy items", 
    "Lots of laminate here folks.", 
    "nice accessory and furniture", 
    "The look matches the visual online presentation. You must put it together, but it is very easy and the tools are included. Each piece fit perfectly. The only drawback is that some of the pieces used to hide the screws do not fit snug - a drop of crazy glue will remedy that situation though. It was easy to affix to the wall and it looks fantastic.Great value!!!", 
    "Hung them in my granddaugthers room. So cute with all her little special nick-knacks on them.", 
    "Guest are always ask where did I get it", 
    "Looks great in my sons room. We use it as a book shelf and it holds lots of books. Great buy for the price!", 
    "perfect corner shelf. If I had designed my own, the space between shelves would have been a little larger, but other than that, I think it is a wonderful addition to my home.", 
    "The corner wall shelves add a great addition to the room. They were quite easy to assemble and fix to the walls.", 
    "Great Product for little money", 
    "Daughter loves it! Shes has a lot of little things that shes wants to display. This corner piece takes up little room & looks nice.", 
    "looks great, user friendly, highly recommend this item", 
    "I should have read dominions but it was easy to install and looks great in our model!", 
    "Pretty shelf, quality is not the best, but this is what I expected, so I was not disappointed. Quite design though, goes good with the rest of my furniture.", 
    "We needed a small cabinet for the master bathroom to hold wipes, Kleenex, etc. This is just perfect and is very decorative too.", 
    "I combined two of these to make floor to ceiling. It looks really nice and I have gotten many compliments. The individual shelves are quite small and only about 7\" between shelves. So only good for small items.", 
    "I ordered this shelf in white for my daughter's bedroom which is a small room. I'd hoped to put her Little Golden Book collection on it, but the shelves are too small. The measurements provided are correct, but I guess I just imagined it would be large enough for children's books - it's not. My brother installed it in about 20 minutes and it shipped quickly with no damage. We've ended up using it for smaller books and few stuffed toys. Overall its a nice looking shelf and a space saver, just really small.", 
    "I am very pleased with the quality & priceVery nice shelf", 
    "When I remodeled my bathroom with a grey and white color scheme, I wanted to add this shelf to the corner so I could display some items safely and keep the color. This white shelf did the trick. It gives me a safe place to display fragile items and adds a punch to the room. I love it. It was relatively easy for me to put together and was shipped and arrived with good timing and packaging. I would recommend that you get this if you want to have a nice wall shelf and display items you love.", 
    "I really like this little shelf. Just what I was looking for. Thinking about ordering another one.", 
    "Very happy about my purchase. Inexpensive, nice, uncommon corner shelf. I like the design, quality is adequate to price, very easy to assemble and looks really good in the corner. I wish the higt of each shelf would be little bit bigger, but I knew what I ordered and I can't lower the product rate.", 
    "Would be an excellent product were it not for the numerous chipped out pieces of the veneer laminate. I don't know if this is a result of shipping or, poor quality control by the manufacturer. Either way it makes an otherwise quaint product look shabby and cheap.", 
    "perfect for my kitchen. unique design has decorating appeal. I love it because my friends and family have nothing like this shelf so I feel happy I have found it. Holds my collection beautifully.", 
    "Needed no tools to assemble. Look beautiful and not cheap looking. I absolutely love it.", 
    "This is my third shelf like this. I have two that are small and one that is larger. I love them! They take about 15 minutes to put together and look really nice in the corner. Great way to clean up the Knicks knacks, store your DVDs, etc.", 
    "The best thing to do is lay out all of the pieces before you screw the sides. It is very sturdy once you tighten everything up.", 
    "Very nice corner wall self. The only negative would be if the shelf could be just a little be larger. You can't put much on it. Looks very nice in my office.", 
    "Neat product, so-so quality, great idea. I wish they had color options.", 
    "I ordered two of these book shelves and they arrived quickly, in perfect condition and with all the necessary information to put it together. I highly recommend this website and this product!", 
    "Great product! Easy assemble and easy to hang. Looks great behind our sectional couch. Now I can display some of my favorite knik knacks.", 
    "Attractive attractive corner unit that I installed in my dining room. Multiple items that can be placed on its shelves.", 
    "Adds interest to my corner for small items to display. Good for 1 item per shelf although I guess you could display a few really small items. Very pleased.", 
    "I'm pretty handy so I did not find it hard to put together. Just a lot of pieces and screws, but simple once you do the first one.I was surprised that it was so small. It will work where I was planning to use it, however.", 
    "Not precisely built, so that it isn't completely square with walls. However, once hung, the small differences are not noticeable. It is easily assembled and easily hung on the wall; Rehires only a small drill and screwdriver to put up.", 
    "Got this for my daughter's room to display art pieces. She loves it and the corner design makes for a great space saver!", 
    "Exactly what I wanted. Went together easily. Feel it's a great buy for what you get.", 
    "This shelf is made well and very easy to install. I would recommend this to anyone that needs a place to show small decorative items and utilize an empty corner where I had no floor space for a traditional shelf.", 
    "So far I have purchased 3 of these shelving units. That are invaluable for small spaces where utilizing corner space is important. Also good for adding extra shelving/storage for photos and art. Installation of the first one took my husband a little time to figure out, but subsequent installations were a breeze!", 
    "Looks gorgeous in my bedroom corner , have a all white wall corner in bedroom it truly dresses up the room . Shelves pretty wide enough to put nice things on it to display .", 
    "little smaller than I expected it to be, but I love it.", 
    "I like the look of this piece, and may like it more once I have it styled a little better. I bought it as a cheaper way to take up some space in our guest bedroom. My main problem is that it doesn't fit perfectly on the wall, which may be due to our older house. I like it enough to keep it but it's not a piece I'm in love with.", 
    "Just as you see in the picture. Very easy to put together, and it looks very cool \"floating\" on the wall.", 
    "Fills the corner with some color nicely. Shelves are smaller than expected but hold a small picture frame or candle. Color matches other furniture. Happy with this purchase.", 
    "Good value for the low cost. Went together easily, came with all the necessary tools.", 
    "This shelf is not real wood, but it looks good over all. It's a nice piece in an empty corner where you don't want something sitting on the floor. I use it to showcase knick-knacks in the dining room. Family and guests have commented that it matches all the rest of my espresso wood furniture nicely. It arrived in a small box and was easy to assemble in the front while watching television. Total assembly time was about 15 minutes.", 
    "Lovely corner shelves, easy to hang. Great for nick nacks or phots...Excellent", 
    "This piece took about 10 minutes to assemble, and 10 minutes to hang. I never imagined it would be so easy-to-use!", 
    "This mount shelf is nice looking in distance. some of the nails covers do stay in place to cover the nails. yet, it's ok. It's worth for its price and holds and displays the items pretty well.", 
    "The pieces of this shelf were very poor quality. They were very small, and the veneer was coming off them. Sent it back. Great idea, poorly executed.", 
    "These shelves brightened up a rather boring wall above the toilet! Easy to put together and hang. Now they are decorated with cute sea stuff. Love 'em!!", 
    "Came quickly. Surprise is that it comes in such a small package. I thought it would come assembled.But, it was so easily assembled following directions-no problem at all. Attaches to walls easily enough.Strong enough to hold just about any knick-knacks, looks great. For the money, thoroughly recommend.", 
    "The shelving unit isn't too bad. It looks nice. My only complaint is that it doesn't come with the necessary hardware to mount it to the wall. Had to buy washers to go along with the screws otherwise the screw would just pass right through the hole and into the wall.", 
    "Ordering and processing were easy and well done. Shipping was prompt and arrived in good condition. Installing was not difficult but unfortunately I did not plan correctly as light fixtures and and an electrical outlet were in the way. I wish that it had worked out as I liked the product and would have solved some needed storing space.in a very small bathroom in a pleasing way.", 
    "Easy to assemble if you don't mind lots of pieces. Easy to hang with a helper. Cheesy stickers to cover the holes but really .. I'm not complaining .. it worked well for me and it's interesting.", 
    "This shelf is great, and looks very cute; but it was missing one panel. I improvised by drilling holes into the top one and hanging it as is. There was no place to request missing parts, which is frustrating.", 
    "Easy to assemble. Quality fine for laminate. looks good.", 
    "I put these in the corners of our window seat in our bedroom and was able to put several small plants and other nick nacks on the shelves. Very pleased with the uniqueness and versatility.", 
    "We bought this for our daughter's room. It is stylish and functional. She LOVES it.", 
    "I had ordered for white but got black. It is a good product ut the color is not fit for me", 
    "I gave this 5 stars for quality not bc I think it's amazing but bc it's what you'd expect. It's laminated so that was no surprise but as a shelf, it looks like nice quality and it's got a unique fun style. I have had no problems with the shelving but I have found it difficult to find items to place on the shelf. I wanted to put books on the shelf but the opens are too short for books and most frames. There are plenty of things that could be cute on it though-just need to be a little creative.", 
    "This looks really nice and adds a very stylish decorative accent to a room.", 
    "easy to assemble, 9 minutes alone. good wood not particle board", 
    "Everyone that sees the shelves had nothing but compliments about them. Simple yet innovative and plenty of room to place some treasures that otherwise would have been lost on a larger shelf. Great way to fill a corner with beautiful pieces.", 
    "Looks cheaply built but I glues all the joints with monster wood glue and assembly was easy and all parts fit well. I then sprayed the entire shelf with a paint that mimicked a stone look . Looks fantastic.", 
    "This is the perfect corner shelf for a few things. I got two for each corner. Very easy to install. I would recommend these easily.", 
    "The design is great nice for corner easy to assemble, but the veneer look kind of cheap.", 
    "Very easy to assemble and hang. Satisfied with this purchase.", 
    "Overstock initially sent the wrong shelf- I called to let them know and they immediately sent this correct one. Their customer service is great! This shelf is exactly as described and easy to put together- it took me 15 min. tops. Have not hung it yet- but held it up to the corner and it fit against the wall nicely! Looks great!", 
    "I think the description of these shelves are accurate. I think the picture should show the shelves with something on them that really show how small the shelves are. For example, we all know the size of a CD so had I seen CD's on the shelf I would have realized just how small they are. Others have commented on the finish of the shelves. They are not wood...it's veneer. That was in the title and description so I wasn't expecting a fine wood. They were the quality that I expected, just not the size. They arrived in excellent condition earlier than the quoted date. I would recommend these shelves as a nic nac shelf or maybe a cool place for spices. Not a good book shelf", 
    "I really like this corner bookshelf. It is very different! It was very easy to put together and looks really great in the corner i chose!", 
    "These shelves are sturdy and useful if you want to store/display small items. Make sure to look at the dimensions before you make the purchase. They are smaller than they appear in the pictures. A good product though.", 
    "Ordered this and received it quite quickly. My husband was a bit confused by the box it came in because he didn't realize he'd have to assemble so much of it. But it was really easy to assemble. The quality of the shelf is just fine. It's a nice corner shelf. It doesn't sit flush against both walls, but we're unsure if it's because the shelf might be a bit warped or if the wall in our house isn't perfectly straight. I'm very happy with how it looks, though.", 
    "I spotted these shelves haphazardly after moving into my house. I was looking for something different and there they were online at Overstock. They look great in my living room with another shelf I bought from Overstock. These are a great buy.", 
    "Item arrived and requires wall mount so now I will have to wait for the handy man to come back, when my correct overstock curtains arrive in the correct color and get dry cleaned as they are a wrinkled mess. It should take a week to decorate a single bedroom this one, thanks to NOverstock will take me a month and 4 lunch hours.", 
    "I ordered 2 of these corner shelves for my bedroom. They are a little difficult to put together and hang, but they look great! Only small things fit on the shelves but it adds a nice touch!", 
    "Too small for books, It's really for looks, not practical.", 
    "These shelves are perfect for any corner of the room. we love them.so nice.good QC and easy to fix ,good tool. and good price than ****.", 
    "These shelves are great for a corner and look very stylish. May order more for another corner. Happy with my purchase!", 
    "Love,Love, Love this product! Perfect for both sides of my gas fireplace!! Thank so much:)", 
    "I bought this for my office wall because I have limited wall space...looks perfect! Had a lot of compliments on it.", 
    "I love the color becuase it matches everything in my living room.......BUT it is not very sturdy. It would be great if I was able to fasten it against a stud, instead of using the anchors. I feel that one of these mornings I will wake up to it on the floor.", 
    "This is my the third purchase of this product. I was very pleased with it and when my son saw it he wanted one so I got him one for Christmas and also a second for me. The shelf allows me to display family keepsakes in a small amount of space. It is easy to assemble and install. It is good quality veneer.", 
    "I got the dark wood veneer. It really does look like inexpensive wood, but it works as an interesting room accessory. It went together very smoothly. Edges fit together well, and i was even able to hang it on my own! Very satisfied!", 
    "This product was shipped to me just as advertised. What I saw on the website, which obviously I liked, is what I got. It was shipped promptly and without damage. What more can you want when you buy online?", 
    "The corner shelf is very attractive and really adds a good look to my room. It is a good quality piece and was easy to assemble. I would recommend it.", 
    "Very interesting bookcase. Using it for some books and display items in a guest room. Great for a small space and looks unique. Not it is not real wood, but it still looks great. It is a very dark brown with some black mixed in. I really like it and would recommend it.", 
    "Really like these shelves. Would recommend them. Nice when u have small children. They can't reach them. Much longer than I expected but serve the purpose.", 
    "Make sure you look at the size of the shelf if it even says it. I have this shelf but in the normal size not the elf size. Total rip off. The only reason I still have it, is because I forgot to return the piece of crap before the 30 days. Garbage!", 
    "This is perfect for the office, uses an unused corner and takes up very little space. It took me about 10 minutes to put it together,by myself. I got the white one because it goes with all of the woodwork in the office and since dark objects are displayed on it, they stand out great. My husband put his prized Megalodon teeth up there and they show up nicely.", 
    "Luv it!! It's what I was looking for. Laminated make it look been classy.", 
    "these shelves are different - took some time to put together - i bought 2 of them for the dining room. The white is an off color. think about what you are going to put in them first.", 
    "Easy to assemble. Looks really great matches with my furniture.", 
    "I absolutely love this shelf. I bought it and painted it aqua for an extra color accent to our living room. It was a great price especially since it is so unique BUT its really heavy.", 
    "Couldn't figure out what was in the little box on our porch.......smaller shelves than expected, looks better online. Easy to assemble and mount.....kids love it", 
    "I love the design. Shelves are short....but my biggest issue is that the White really looks light pink.", 
    "The description said laminated veneer, but the material was pressed wood. Thought these would be perfect for our guest bedroom. The quality was poor and they had to be assembled. You get what you pay for!", 
    "This was a simple item to put-together. I had it up in an hour. Everything you need is in the package except the drill to hang it to the wall.", 
    "I had read the reviews and was a little nervous about ordering it in the wood finish, but now very glad I did. It looks great on the wall, everyone who's seen it loves it. Easy to assemble and hand- I did it all by myself.", 
    "I love this shelf it works perfect for what I needed it for.", 
    "Laminate veneer corner shelf wall mount is very ideal.", 
    "When I saw these I immediately fell in love with them. Reading the reviews reinforced my desire to purchase them. They are everything I expected. They are great corner wall shelves. They are very long (although I anticipated this based on another review and by reading the specifications) I put 2 5x7 photos frames on the top and bottom shelf and they fit perfectly. The horizontal 5x7 frame fits the length of the bottom shelf (or any other shelf for that matter) but the vertical 5x7 frame is too high to fit on any shelf other than the top. The only bad thing I can say about this product is that it didn't come with assembly instructions. Maybe some people are more handy than I am but if I did it myself it would have took my a while to figure out, luckily I had my bf do it and it didn't take that long. Also, if you're looking to get this product in brown, it is a dark brown. I like this so much I'm going to purchase it in white too for my bathroom. I definitely recommend this product to anyone looking for a corner shelf.", 
    "The product was well packaged and easy to assemble. I ordered three and all were complete and make a great addition to our study and a good way to display our collectables.", 
    "I bought the corner desk this is perfect over it! You can put pics. What knots what ever you need to look at when you clear your mind!", 
    "So the picture itself can be deceiving, but that's why you read customer reviews and ESPECIALLY the item description, right? So when I read about how big the item was, I took a yard stick and used it to picture about how big it was, so I was not surprised when I assembled the product. Yes, it's small, but it's nice for small decorations or books. The other reviews said stuff like the screw caps were not flush with the shelves, and this I found also to be true, but I don't think it hinders the overall look and feel. It holds in my paper-thin walls pretty well, is bearing the load of several heavy-ish items, and looks relatively nice for a laminate. I am not at all dissatisfied with my shelves, although that could be because I knew what to expect. Either way, I'm super happy with the overall look of my room, and these shelves add a really nice touch to it all.", 
    "The shelving unit is Nice looking, sturdy and has easy assembly.", 
    "I have gotten quite a few compliments on this shelf. I purchased 2, one in each corner on a wall that has a built in fire place. Looks awesome. I keep our DVD movies, Blu Ray and Wii games on them. Very handy and hold quite a few movies and games. Very glad I purchased these.", 
    "JUNK - plain and simple - this is junk. DO NOT BUY! Thought this would be a cute corner unit and style wise it is nice - but made of junk.", 
    "This is a lminated shelf unit. this is not beautful handcarved woods. I got what i expected. I have it in an area where people dont get real close to it. If you do you can tell its not a high end looking shelf. I like the style a lot tho. Only thing to keep in mind is that there is not a lot of space between the shelves so dont expect to be anything large on the shelves.", 
    "I just moved out on my own and needed some sort of wall decor to brighten up the place. I was super excited when I came across this item. It's functional, cute and draws everyone's attention upon arrival. It was definitely easy to put together but note the structure may be a little warped at the ends (may depend on how your corner wall is structured) when screwing in. My only qualm is that I wished the space between each shelf is a little bit wider so that you can add a vase or an item that's bigger than a 4\"x6\" picture frame. Other than that I definitely recommend.", 
    "We installed this in the corner above our sectional sofa. I agree with the other reviewers that installing this shelf is a 2-man job and can be somewhat cumbersome - but the results are stunning! The laminate seems hard and durable with a rich brown color. We will use the bottom shelf for holding drinks/cups and the top shelf for a small reading lamp, and use the middle 3 shelves for some photos & knick knacks. This is a perfect addition to our new sectional sofa and I am 100% satisfied.", 
    "It is rather larger than it appears. Nice shelf but remember it is laminate.", 
    "I like this shelf so much: I am going to order two more. It's perfect!", 
    "I have it already for 2-3 years, looks nice and it is strong. I'm very happy with this purchase.", 
    "I loved the style of the shelves but they are totally partical board looking and not walnut color. I have a real walnut table in the area I wanted to hang the shelves and it it not even near the correct walnut color. I am very disappointed in the qualtity of this item. Not usual with my purchases from Overstock. I have been totally satisfied in the past.", 
    "This product was packaged extremely well and was easy to put together. It looks great in our living room :)", 
    "Helps to create a different and cute touch in a room. Perfect to put nick nacks in a way that grabs the eye but doesn't get in the way.", 
    "I have lots of family photos and we just moved. I needed something to have more photos displayed, this was great. I like the design, and people have to really look to see it is not real wood.", 
    "This shelf arrives in about 12 pieces. No problem, it's very easy to put together. After putting the entire thing together, I noticed that 1 of the10 screws is not in all the way. So I tighten it. Only problem is it keeps turning and turning and turning. So, because of this 1 screw the item is basically useless. The screw did not grip the particle board and now the whole shelf is wobbly and unusable! Not the quality I expect from overstock! I would love another one provided it all works.", 
    "Love the shelf; I was a bit nervous at first if I could put it together myself, but I laid out the shelves as the picture showed and then just started screwing in the screws. It went together without a hitch! It looks awesome in my dining room and it displays those nick-naks that were hiding in the hutch - the cool ones from my grandmother!", 
    "The shelf had to be assembled. It is quite unusual and unique. I use it for some of my salt and pepper shaker collection.", 
    "I don't usually buy much that I have to put together but this wasn't too hard. It's bigger than I expected and it works in a child's room.", 
    "I bought this corner shelf so I could safely display gifts my daughters had made for me. I didn't want them locked away in a china cabinet but didn't want them somewhere where they could be broken. It is a nice, solid piece - easy assembly, easy to hang. Great quality! It fits nicely in the corner of our bedroom and is exactly what I was looking for.", 
    "This shelf was so easy to put together and hang. I have it in my nail salon displaying retail product. I get so many compliments on it. I'm quite happy with this purchase.", 
    "Love it so much I bought another one! Way cool for small knick-knacks, pictures or air plants!", 
    "Great corner shelf. I assembled it in the corner; if doing it again I'd assemble before mounting in the corner. Just as it appears.", 
    "I love this corner unit, it really made our living room cozy. For the price, it's a great little shelf.", 
    "Nice looking shelf, easy to put together, looks great in the corner. I noticed though that it had space where it attached to the wall with one of the two connecting points. I may have to place a small plank of wood there, however, it is not that big of a deal.. It's pretty sturdy, haven't weighed it down with items yet, nonetheless, it should hold up fine with reasonably appropriate items placed on it. I don't regret buying it.", 
    "Lots of pieces to put together but this is one sturdy shelf! Very happy with both of them (don't buy just one!!). This was an amazing purchase for the price. Thanks Overstock!", 
    "My only issue with this piece are the wall anchors, screws, and holes for the mounting screws. In my opinion, the anchors that come with this piece are not strong enough. I used my own. Secondly, the mounting holes are too big for the screws and they go through the entire section of wood. In other words, if you're not careful, you might screw the fastener in too close to the wall (which is what you would expect you'd have to do), causing the whole shelf to come crashing down. The shelf \"sits\" on the screws more than it's screwed to the wall. This thing looks fantastic, but it's poorly designed. You can make it work, but not everyone's willing to do that.", 
    "Nice corner shelf that was easy to put together. Price was right!!", 
    "I expected a little more out of this shelf. It is easy to put together, but it was difficult to install because of the cheap, terrible wall anchors packaged with the shelf. (Get your own wall anchors so it doesn't fall out of the wall!) I wouldn't put more than about a pound total of stuff on these shelves. Just not great quality.", 
    "I looks great on the wall. I am glad I got it, it's different from other shelves.", 
    "Great Product ... reason I give 3 star.. most of the corners are slightly chipped.. I have have to do some polishing.", 
    "This such a great shelf unit. I had seen it @ another site but they were out of stock and it was a bit more expensive. Good thing cause I got it here for a better value. Totally worth every penny and then some. I will always compare and most likely end up getting anything and all from overstock.", 
    "I love the style, and it was a great way of seeing that my living room corners really are pretty square. Easy as pie to put together, but I found that wood glue was necessary--not all the screws fit super tightly, but that's as it should be--it needs to fit in out-of-square corners, so it's good that it's a bit flexible. They provide little plastic caps to cover the holes, and these I also glued in since they didn't fit tightly. That said, the design is fabulous, and from far away, in a little-used corner of a big living room, tucked behind a chair, it's superb. But if you get up close, you see what it is--it has a slight veneer \"sheen\" to it, which I hate, but after all, that's my budget. Still, I don't regret the purchase one bit and I'd buy another. They give a room character, and I'd recommend them highly as long as they're not in a featured, highly scrutinized corner.", 
    "Looks better in the picture than in real life. Assembly is straight forward. The supplied wall mounting screws slide completely through mounting hole.so they are either too small or two washers are missing.", 
    "This unit will give the front of my living-room with the very large picture window the POP it needs to make it stand out. It was a tad darker than I expected, but for the price I can not complain.", 
    "Love the shelf looks great, very sturdy and simple to put together. The only thing that would make it better would be if shelf was solid wood not laminate.", 
    "Very good corner for my living room to increase some good looks", 
    "It looks okay, the screws that come with it to put it on the wall are totally wrong for it, and I had to open an extra hole in it, only 2 screws are not enough, since you don't even have a choice of looking for a stud.", 
    "Easy to put together. Looks great and serves as a great display/book shelf. Have one in each corner of our master bedroom for extra storage.", 
    "I really like this piece. My only issue was I discovered the corner I was hanging it in wasn't square so I had to make some minor adjustments so it would hang correctly.", 
    "love it, fits perfectly and looks good.Always gets comments from visitors as to how good it looks", 
    "easy to assamble, fits and looks great, shelves are a bit small, but overall looks great. the price was right, we may get a second one for the bedroom...", 
    "This was a bit of a challenge to assemble. However, once it's on the wall, it looks really neat. The corner aspect allows for a variety of display options, but I wouldn't put anything too heavy on it if you don't anchor it well to the wall.", 
    "I bought this to showcase all those small objets d'art you never know where to put, and it works well for that purpose. Easy to put together. I actually bought 2, one for each corner of a wall. Just remember to put the second one together backwards in that scenario. As mentioned by others, this really only fits small picture frames, plates etc. I'm happy with my purchase. It was inexpensive and works well with my modern decor.", 
    "I absolutely love this shelf. It's modern and unique. It was very easy to put together. Every part was labeled and there were no tools needed.", 
    "I put this piece up in my office at work. It breaks up the traditional boxy office furniture look. It was super simple to assemble and very easy for one person to put up by themselves. One thing the mention, the screws that they give you to put it on the wall are too small for the pre-drilled holes. You will need to use 2 washers to keep them from going through.", 
    "LOVE this. I assembled it easily and it's perfect for the corner. Highly recommend for a bland corner that is too small for a table, etc..", 
    "I put in our bedroom in the corner and people always comment on it.", 
    "Great storage unit if you need space without cluttering any room. Since the unit is of a unique design you ned to make sure you assemble the pieces correctly. otherwise you may assemble the top/bottom shelves in the middle.", 
    "I love the shelves. I pit them up in my bedroom and the 35 shelves gave me a lot of opportunity to brng in some more accent colors!", 
    "NICE CORNER SHELF..PERFECT FOR SMALL PICTURE FRAMES. THANK YOU OVERSTOCK", 
    "very easy to assemble and easy to hang as long as your walls are straight", 
    "This shelf is unique and modern that would make any wall corner looks eye-catching. It does take some time to get it up.", 
    "Assembly was difficult. I was short a screw, but was able to improvise. The plastic caps fell off after mounting and are nowhere to be found. The mounting screws were useless. The head went right through the pre-drilled holes in the sides. Still it is unique looking now that it's up.", 
    "solid and works well in a corner... though 6\" shelves are surprisingly small... definitely for small things. the finish is cheap looking.", 
    "I ordered and shipped to my son for his apt. He called and told me he assembled it and hung it up. Said he likes it a lot.", 
    "I am so happy with these corner shelves! I received them 5 days after I ordered and they look beautiful! Very pleased!!", 
    "Great corner shelf and stylish, so much so I've ordered another", 
    "The atcual shelf is much smaller in size than what is shown in the picture. In the picture each shelf compartment looks big enough to fit three decorative items, but in reality it fits just 2. The color is also darker than what is shown but looks good.", 
    "I bought this for a few knick knacks and small pictures that I didnt want on the wall. It looks great. Easy to assemble. I have received compliments on it.", 
    "The shelf is good. Fits a need for my coener. Seems a little small. the screw cover caps are a joke and you may need to glue them.", 
    "Nice product! Easy to assemble and looks nice on my wall", 
    "love it, it matched my enterment center's color and look good and make my living room look good", 
    "I just love these shelves (bought 2 and put them in two corners of my living room, next to my bay window. I wanted to capture a comfortable, contemporary room with a mix of mid-century modern, current contemporary and a little bit of whimsy, and these shelves helped me capture that.", 
    "The piece went together quickly and smoothly. It's a nice size and it a great addition to a corner for displaying small items. Very pleased with quality of construction and overall appearance!", 
    "I ordered the shelf for a small bathroom to add some storage. It is perfect for the job. It was easy to assemble install, and is very sturdy. I get a lot of compliments on the shelf", 
    "The quality is very poor. The holes to mount to the wall were cut too large. The shelf fell right off the screws before I ever placed anything on it. Sending back.", 
    "This shelf is very cute!! It's smaller than I expected but still very unique. The quality is great for the price and it does NOT look cheap. I love it and would recommend it to anyone.", 
    "I absolutely love this shelf. I wish we could have ordered 2 of them. This is a pretty hefty piece and is secure when mounted. The veneer is easy to clean (I have small plants on it) and it doesn't show any discoloration. It also has some faux wood grain which makes it stand out. Everyone who's seen it loves it. Great purchase in my book", 
    "Great addition to my \"man cave\" to hold my trinkets. Requires patience to assemble", 
    "Great looking help for a small bedroom for all those shelf sitting items, instructions were clear and this project did not take long at all. Great addition to this room!", 
    "Delivered very promptly. Shelves are reasonable quality as expected. Only negative was slightly smaller than expected, but that's probably my fault.", 
    "For the price of these items, the product is pretty good. It is not extremely durable, so I have not put anything too heavy on it. It has made the corner in my room quite festive. The installation is easy, and only took me about 10minutes. I would recommend this for someone looking for something simple, cheap, and easy!", 
    "The shelf looks great in the corner. It is easy to assemble and install.", 
    "I love these shelves. They look great in the corner of the room especially when you just need something in an odd space to bring the room together. I've had a handful of inquiries as to where to get them.", 
    "I love the look it gave to my living room . I wished I would have order one more after I hung it up. Putting it together was very simple and everyone just love the look it added to my room. I am now looking to add one more to my space.", 
    "Some difficulty putting.together,but son helped. I'm not adept at assembling items.", 
    "This item is exactly as the picture & online description ststed", 
    "I loved the product it was exactly what I wanted. It fits perfectly in the corner and gives what I was looking for in that corner", 
    "I expected the shelves to be larger. However, it was just the right touch for the area. I really like it.", 
    "I'M PRETTY PLEASE OF THE OUTCOME OF THE MY ORDER, AND WOULD RECOMMEND IT TO FRIENDS.", 
    "Great corner shelf, and each shelf fits more than you would expect it to.", 
    "I am not one to write reviews but I love this shelf. Very sturdy and looks great!", 
    "This very fun shelf looks great in the corner, but I suggest you use your own screws/wall anchors to attach it to the wall. The screws that come with it aren't very long, so unless you have very strong drywall or happen to be screwing into 2 studs, you might want to consider longer screws and most likely anchors (especially if you're putting anything somewhat heavy on it). This is important to note if you know your corner isn't a perfect 90 degree angle. Also, the screw heads of the hardware that came with it aren't much bigger than the holes they go through on the shelf, so it sort of started pulling through the top hole when I initially hung it and let it sit for a day or two. Because of this, I had to use washers in addition to longer screws to make sure everything stayed tight to the walls. Besides these small installation issues, which really aren't that difficult to overcome, the shelf is really nice and we've already received a few compliments on it.", 
    "Heavy, large gorgeous display shelves make any corner look amazing. The shelves aren't very tall, but they do a great job of framing your favorite items.", 
    "I liked this shelving unit. After I had received mine I thought to myself the shelves were a bit smaller than I had expected. They will still work well where I need them though.", 
    "Ordered this cute and modern shelf for my daughter, and she gave all items away. This item was given to my mom and she loved it. My sister also said it was a great design and corner shelf. O really, order this item to fill the voided space.", 
    "I am extrememly happy with this purchase - item arrived on time, product is great, was easy to assemble, sturdy and was shipped in protective packaging.", 
    "I had a shelf in the corner already, but I need something to take control of that corner and display a few items I had and this corner shelf was perfect", 
    "Took a few tried to get it together correctly. Looks great in the corner, really brightens it up.", 
    "These shelves are gorgeous and I ordered 4 and they look amazing in the rooms we put them in. I was very happy with this purchase.", 
    "Love the shelf. It was so easy to put together and looks great. I have a corner toilet in my bath and I placed it over that. Makes a great place for extra storage and is somewhat \"a piece of art\"!! love it!!", 
    "I would have liked to have a larger corner unit. 12\" X 12\" but this will work fine. I have already recommended it to a friend.", 
    "please with product and now have several friends that shop O stock.com. The service has always been good, except received a damaged box. The product wasn't damaged though.. Will continue to recommend your service to others. thank you", 
    "This came in so many pieces it was daunting but it was fairly simple to put together and looks pretty. Nice focal piece in the room", 
    "Easy to assemble and easy to mount except that the wall anchors require you to drill a larger hole than is necessary for the screws. Recommend that you downsize to smaller anchors. Otherwise everything was perfect.", 
    "Very easy to assemble. Looks great as accent decoration on a corner wall.", 
    "Awesome shelf. It was a gift for my fiance, he likes it. Only problem is where to put it! Lol", 
    "Very pleased with this purchase with nice comments from all my friends as well", 
    "Great Christmas present! My niece was thrilled and immediately had a spot for it. I didn't get it before Christmas, but that was my own fault. Package was very compact and easily put together.", 
    "The corner wall shelf arrived in the mail today. I couldnt wait for it to get here, and put it together shortly after it arrived. At first I COULD NOT FIND the directions and actually thought they were not included/in the box but later realized they were hidden under the order slip. (Such a flimsy, lightweight piece of paper I would have missed it. So check the box thoroughly for the directions before you freak out.) I actually came back to overstock.com to find the instructions on putting this together because I couldn't find the directions! It took me an hour to put it together and put it up (i was watching a movie so I wasn't totally focused). It took about 15 minutes to put it on the wall, 45 minutes to assemble. It was simple, yes, but it took some work. It does not line up directly with the wall, but the 1/2\" or so is not really noticeable. I honestly don't believe this was made to align perfectly with the wall, because even while I was putting the boards of the shelf together I noticed as I screwed in the nails that not all shelves were perfectly aligned. This did, of course, affect how it displayed on the wall, but not drastically. My mother saw it after I put it up and was pretty impressed with it. Overall, it is a pretty nice looking shelf. But don't expect to use it for storage. I have a small bedroom in my apartment and was looking to make use of all the bare space on my wall, so I opted for wall shelves/cubbies and thought I'd stick this in the corner near my bed. A standard box of tissues (not the horizontal box, the vertical box) can fit, but the tissue paper doesn't \"sit up\" out of the box. So that should give you some kind of idea of how much space there is between each shelf. I thought I could stick a tiny lamp I have on one of the shelves, but it doesn't fit by at least 2-3\" because it is too tall. (disappointing. I thought it would be convenient to have right next to my bed. And more lighting. I guess not.) That being said, this corner shelf is more for decorative purposes, not utilitarian ones. I have a whole bunch of stuff I wanted to stick on floating shelves. (For the record, DVDs----you can sit them up or lay them flat and small books do fit on this shelf) Now I have to either put my candles on these shelves (not because I need to, but thats one of the few little knick knacks that would fit. And I actually don't know if thats safe), or go and buy picture frames, that sort of thing, to put on these shelves. So yeah, this is a pretty good buy if you know what you're getting in to. It does add some style to the room and takes up empty space. But its not ideal for fulfilling storage duties.", 
    "Honestly, this was a good buy. My wife & I love the design element that it presents in the room installed. The most arduous part of the whole install was cleaning each. frickin'. shelf of the styrofoam bits used in packaging. Nonetheless, it was a cinch to put together. A couple of the pre-drilled holes didn't match up perfectly, but it did not cause structural/aesthetic compromises. Of course, each individual installation will be just that, individual. I found my install to be quite easy with a cordless driver, appropriate bits, and my wife for all of about 5 seconds. Had the holes lined up perfectly; not had to deal with styrofoam bits; and paid less, I would have rated it 5 STARS.", 
    "I had been eyeing this shelf but when I finally got ready to buy it, it had sold out, twice! I still really like it for its uniqueness factor. It's eye catching. The only thing is I wish it was a little bit bigger to hold bigger items on each shelf. However I would still highly recommend it. I love the way it looks in my living room corner, especially because I want thins on my walls vs my floors so my toddler can't grab them.", 
    "unless you don't need instructions don't buy this no directions def not something for single mom", 
    "This is a real nice decorative shelving, and useful too. It doesn't take a lot of space and it looks awesome!!!", 
    "I was very pleased with this shelf it was very acurate to what i saw on line just a little smaller but i am not complaining. It really gave my living room a beautiful look ! It is really odd and i only had it a few days but i have been getting wonderful comments, i made a great choice thanks overstock u've done it again i am a very pleased customer!", 
    "These are biggerthen they look ....i like it.....They are so easy to put together.", 
    "The shelf works perfect in a very odd conor of the family room! Nothingelse would look right there. it was a little difficult to hang, but OK once we decided how to put hangers in.", 
    "I love the corner shelf, it looks great on the wall in my corner. the wood was dark just as I needed, it was very simple to put together and hang. I'm thinking about ordering another.", 
    "Not a good buy. I would not buy this product again.", 
    "I bought this product because I liked the size and appearance of this product. This shelf looks great in a place where not many items would. I have to be completely honest about the product; it is cheaply made but I knew this when I bought the product. Word of advice, if you do plan to buy it, don't use the the plastic anchors included to hang the shelf...mine fell right through the wall and I had to go to the hardware store and buy replacements. The plastic screw type anchors worked much better.", 
    "Was surprised to see how small and compact the box was. I ordered two so was very happy to see both packed in same box with fast shipping. Very easy to put together and very happy with how it looks on wall and end result. It really spruces up the room decor. Would buy again.", 
    "This shelf is very nice looking up on the wall! Assembly was pretty simple and shipping was quick. I read others reviews and the description prior to ordering, so I knew to expect these things, but keep in mind: the shelves are small, so don't plan on putting large items on them, and they are just laminated shelves, not solid wood. All in all, if you have some small items to display, order this shelf! It's very well priced and looks cool, we may get another one :)", 
    "It was easy to put together but poorly made. Do not trust to put anything heavy on it. It is good enough for the room I put it in.", 
    "I bought this product because it was different, had never seen a shelf like this. I needed extra shelves for pictures and knick knacks.... The only thing I was disappointed by was the shelves will not hold a 5 x 7 frame. It was very easy to put together. I even bought another one.", 
    "actually used it to make four shelves for my surround sound speakers. good deal.", 
    "The shelf is alright, if you want to put very small knick knacks on it. It goes together easily and looks nice on the wall, but it isn't made from the best materials and you cannot even fit a small book on it since the space between shelves is so short.", 
    "I have gotten soooo many compliments on this item! Definitely brings life to the corner wall.", 
    "These corner shelves are longer than I imagined, but brings a whole new dimension to the room! I love them!", 
    "I LOOOOOOVVVEEEE this wall mount shelf! It looks so nice in me and my husband's living room. He even wanted to order another one, which says a lot because furniture usually doesn't light his fire...lol. BUT, I would highly recommend this shelf!", 
    "This item arrived in a timely manner. It was packed well. Instructions were good. While it was not difficult to put together, it was a bit awkward. I would have preferred phillip-head screws to hex-head but that's me. Overall, I am really happy with the product. It looks great in my living room.", 
    "We use these shelves for my husbands wood turnings. Makes a very decorate and nice display without taking up valuable space on furniture pieces.", 
    "I like a cool shape of the shelf. Easy to assemble. Good product.", 
    "I had never seen a corner mount shelf before. This shelf was perfect. Looks lovely; I put mini-collector plates on it. It did take me about 1 hour to put each shelf together; but I am stupid at putting things together. I have the 2 shelfs on the opposite corners of the wall, with a large china cabintet in between. The room now looks very elegant. Price very reasonable.", 
    "As my niece said, \"What a great use of space!\" They are sturdy, look great and are easy to put togetherl. I have had my pottery from Costa Rica packed away for 8 years. It looks beautiful on the corner shelving and I finally get to enjoy the pieces. Brings back great memories. I bought 2 units and connected them from ceiling to floor. Great product.", 
    "This product is so small I'm not even sure what anyone would be able to display or fit on the shelves.", 
    "This is a great little corner shelving unit. Mailed here quick and it was easy to assemble and install by myself.", 
    "I've even gotten someone to order this product, SHE loved it.", 
    "This corner is gorgeous, it is a great accent to any corner. Everytime I pass by it I will smile. However, it cannot stand heavy weight, it is just for slight objects", 
    "The shelves look great. My only complaint is the hole diameter for the mounting screws is too large and the screws can easily pull through. I had one that mounted fine. The other screw pulled though the hole and I had to find my own anchor and mounting screw that the provided screw cap did not fit on. Otherwise assembly is a breeze.", 
    "What a great piece for a tiny wall space to showcase all your goodies. It's perfect, and for a tiny price. Also the assembly was a snap, but since it was going in an outside location, I glued the pieces along with the standard screw fittings, just in case :D)", 
    "very goodxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx", 
    "Like other products here it was a pretty deeply discounted item. The item description was extremely accurate so there were no surprises when I received the package. The instructions were reasonable and easy to follow, although it is mostly pictures and very little text. I put this together in maybe 15 minutes because I take a bit of extra care to make sure I don't damage it while putting it together. There were a couple minor corner dings after I unpacked everything, but you get the ability to move and rotate the pieces around to hide the dings. Nothing major to worry about, but a good idea is to lay everything out first like I did so you can hide what you don't want seen first, before assembly. I had this together in maybe 15 minutes. I was not in a hurry and I did not use a power drill to drive the screws because I did not want to split the wood. The wall anchors are molly's, which I am not a major fan of, but there really isn't anything else you can do. Installation was easy as I got put the piece on the wall where I wanted it, held it, and used a pencil to mark the molly spots. Then I installed the molly's and then mounted the piece. It is a unique piece and it looks nice. If you want something a little different I would recommend this. It looks exactly on your wall as the picture indicates. I am very happy with the purchase.", 
    "HUSBAND ANXIOUS BECAUSE IT IS VERY HEAVY FOR JUST 2 SCREWS.", 
    "The assembly was diffucult and the regular consumer would have trouble putting it together. The allen wrench screws were difficult and would strip out. I have been doing handy man work for 30 years and I had some problems.", 
    "We just moved and I have been redoing the place with E-coupons we got from change at the Coinstar machine for Overstock.com. I liked this shelf from the beginning and ordered it. Very fast delivery, in a very well packed box. Easy to put together, and my husband hung it very easily to the wall using only a drill. We love it, a lot larger than I thought, looks very high quality and just brings the room together.", 
    "I received this beautiful corner shelf today. I already put it together, didn't took long, about 10 minutes. Love the color, love the look, love the price! It looks great on the wall. I couldn't decide for long witch corner I should hang this shelf because it looks great everywhere and I can use it for so many different things. I am definitely getting 2nd shelf!", 
    "it took 10 days to come and I was quite disappointed, normally things from you arrive in 2-3 days", 
    "I like the modern look of the shelf. It adds character to a room and I am happy with this purchase. I'm awful with instructions and this was so easy to put together! The instructions are user friendly and anyone can do it. The color is very rich and it looks great high up on the wall. One glitch I have run into is there are limited items that will fit on the shelf. The shelf space is very small and the cube size does not help the situation. Another thing I was unhappy with is the chips I found on the side of some of the shelfs; it's very fragile and must be handled with care. I can only notice them up close but from a distance you can't tell. I would recommend this shelf to someone looking to make their room a little more modern and up-beat. I've never owned anything like this before but I know I will use it in every home I come to own.", 
    "I put it in a small bathroom. I liked it so much I got a second one for my walk way to the laundry room.", 
    "It is definitely a piece that is noticed when people come in and it tied my whole room together. I may buy another for another room. Easy to put together only problem I had was one of the screws did not fit I had to use one of my own I had. I love it", 
    "This object works well in terms of making a borning wall corner look like a decorative space with functionality to hold various items that take up dresser top and nightstand top space.", 
    "For the price, this is a great little piece. We use ours in a corner behind an accent chair and side table which is placed at an angle. It brings some nice height to the space and really makes that area. We put picture frames on ours - it's a nice, modern way to display family photos without having frames strewn all over the living room end tables. I really like how it turned out! It was easy to put together and easy to mount. I did not like the type of wall anchors that came with the product. We used different ones. No big deal.", 
    "This product was easy to assemble and mount on the wall. It holds up great and I've received many compliments on it! Great buy!", 
    ". Pleased with the purchase, easy to assemble, space saving. When I purchase some thing from Over Stock, I take it for granted and has NEVER been disappointed. I have been a loyal customer for about 6 years. Good products, reasonable price, helpful customer service, prompt and courteous. I am happy.", 
    "This shelf was easy to put together and is exactly what I thought it would be! I love it!", 
    "An adorable piece, I love the way it looks. The perfect addition to a difficult corner. Not the same old run of the mill shelving!", 
    "I purchased this to match the veneer wall corner shelves. They are a a perfect match and highlight any room decor. Great value and product.", 
    "Its a great idea to put decoration in the corner and great looking. The only thing it has to be smaller decoration to fit it on the shelf", 
    "Putting it together was the worst part...it was more complicated than it looks.", 
    "I really like how it looks, it is very contemporary, and feels strong.", 
    "I love it! I recently took out a large entertainment center from my living room and bought this shelf to put all my decorations on. I completely love it.", 
    "I searched alot of sites, and this price was the very best I found !", 
    "I like this first oder 1, than I oder 2nd one fore my other coner of my house.", 
    "This was the easiest thing to put together and looks great. Can't beat it for the price. Yes, you could probably find something that is solid wood for hundreds of dollars but trust me, no one would know the difference but you.", 
    "When I saw this on Overstock I knew I wanted it. Totally my style and a cool space saving idea. I knew it would look good when I bought it and after putting it together and hanging it up it was even better then I had imagined. You can easily use other hardware for your walls if you need to (i.e. concrete) which is what I need to do on one side. The other thing that's ideal is it only requires 2 screws and anchors so you don't have to worry about excessive holes in the walls. As for the laminate, like stated in another review, unless you make a point of getting within inches of it, it's not even obvious and even then it's manufactured good and doesn't even matter. There's nothing negative I can say, I highly recommend this shelf especially if you like the style.", 
    "This is a good buy and a unique enough it always gets the attention of visitors to my place. They all want to know where I got it.", 
    "The unique design attracts attention - and thus displyed items enjoy attention. It also enables good use of typically wasted corner space. You should NOT put customers through the extra steps of SIGNING IN to present YOU with a critique than ONLY BENEFITS YOU!", 
    "Item arrived, and from the picture (which was a little difficult to follow) assembled as the designers hoped. It holds stuff not heavy, and after only a few slight \"not on the paper maneuverings\", stripped the fastening screws, and I had to eventually put it on the wall up-side down, so the frail part would not be too stressed. If you just look at it, don't touch it much... it's quite lovely. Wish it came in other variable colors than offered, though, as it sticks out like a sore thumb in my \"color scheme\".", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Laminated-Veneer-Corner-Wall-Mount-Shelf/6294214/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=0", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6294214/Walnut-Laminate-Corner-Wall-Mount-Shelf-Laminated-Veneer-Corner-Wall-Mount-Shelf-75aaa917-a94d-46d9-baab-49de62111666_600.jpg"
  ], 
  "description": "Featuring a stylish design, this laminated veneer corner wall-mount\nshelf has an exciting, modern appearance. Use the five shelves to\nstore family photos or small furnishings to give your home an\ninviting look. Available with a walnut or white finish, this\ndurable MDF corner wall-mount shelf looks excellent with any decor.\nColors: Walnut or whiteFrame materials: Laminated MDFFinish: LaminateDesigned to hang on a wall cornerNumber of shelves: Five (5)Dimensions: 48.5 inches high x 7.75 inches wide x 7.75 inches\n  deepMaterials: MDF and LaminateStyleContemporaryMaterialLaminate, MDF, VeneerFinishWalnut Finish, White FinishShelf TypeFloatingAssemblyAssembly RequiredColorBrown, WhiteNumber of Shelf5"
}