{
  "name": "Laminate_'Live,_Love,_Laugh'_Inspirational_Wall_Shelves_(Set_of_3)", 
  "price": "EUR 41.14", 
  "reviews": [
    "I would not have paid $10 for this in a department store. The pictures make it look so much nicer than it really is. Its made of cheap plastic and i had to use super glue to hold the letters on the shelves. Ended up throwing it all away in the trash., A big waste of money.", 
    "I was expecting the shelves to be made of wood or \"wood-like\" material but it is more like a sturdy plastic. I was willing to overlook the material in which is was made but was disappointed when I saw they forgot to send the letter \"G\" for the word \"Laugh\". Instead, I got a total of four \"L's\". I will be returning product -:(", 
    "These are made of a very cheap plastic-y material, very poor quality and not worth the money. Shelves were all scratched up, edges were not well finished. I returned mine and was very disappointed with this item.", 
    "Pretty handy and working on projects all the time. Hardware that comes with unit is not good. Letters are also missing. Really upset. I would like replacement but do knot know id the is option.", 
    "came in broke studs to hold letters in place where broke", 
    "I didn't like that the letters are fragile and do not fit snuggly in the holes provided to hold them.", 
    "The shelves are stylish and in pretty good quality. My only complain are the hardwares that come with the shelves. Those are complete disasters and drywall destroyer!!! Don't use them!!!! Use your own if you have any. And measure them twice before you drill. The measurement needs to be very accurate in order to put up the shelves. It took my husband a few tries. But I definitely love them and how they make my bedroom accent wall!", 
    "The letters are individual and you insert the pegs into holes on the shelf boards...but they are not snug and they move very easily. And there are no slots to hold anything upright...just flat boards so things move easily on them.", 
    "These were a good conversation piece.", 
    "Quality not good ....cannot hold anything over 1 lb", 
    "Nice. A little hard to put up at first", 
    "the pegs are easily broken", 
    "I bought this item to hang in my bathroom cause I did a remodel on that room well to my surprise my order came with out the screws now I am having to found some that fit so this item is still in the box", 
    "I cant wait to hang on my wall, with my grandkids pictures", 
    "I was broken on the corner. Called Overstock and they replaced no hassle. I love them.", 
    "The product looks great but the hardware they give you is trash. Went out and bought hardware that would hold the boards to the wall", 
    "Received the items and one of the letters was broken from the peg that allows it to go into the hole. Small thing that can be fixed, but disappointed to not have it in perfect condition so I could just put it on the wall and use it.", 
    "Look great and I reallllllly love them!!!", 
    "One of the letters was broken. The other letters were wobbly when you stuck them into the shelves. Poor quality.", 
    "Did arrive in great condition, they were damage.", 
    "letters come separate, very cheap plastic does not go into dry wall well without breaking", 
    "I absolutely love this product. It always seems to be the center of attention when I have guest over. I paired this product with electric candles. It's gorgeous.", 
    "im a big advocate for displaying positive decor in your home, i love the pieces, , just remember to not put anything heavy on these shelves", 
    "Not satisfied, the directions are not good at all", 
    "Beautiful and simple to put up.", 
    "Set this in a cascade format in a section of my living room and placed family pictures on each shelf and love the different look it gave the room.", 
    "These are a beautiful way to display pictures of the family.", 
    "They long nice but had to glue the letters in and use my own dry wall anchors to hang them. They don't support any weight.", 
    "These PLASTIC and cheap looking!", 
    "It was easy to set-up. One issue was one of the letters came broken. but it was okay.", 
    "Not too crazy with the mounting screws and ankers", 
    "Zdded a nice look to my living room.", 
    "Very satisfied with purchase", 
    "MY WIFE REALLY LOVED IT!!!!!", 
    "This is the absolute expression defining my newly chosen relationship status with my former girl friend whom I recently made my wife this May 2015", 
    "This was ok. There were some very, very small chipped pieces in the laminate that appeared to be colored over with a black marker. I usually don't care so much about that type of stuff but th price should've been more reflective. You would've thought it was a used piece", 
    "A nice decorative item to add to your living space", 
    "This gave a new look to my bathroom", 
    "Overall it was nice, but one letter was broken when it arrived. The letters all have a stick on the end that goes into a hole to keep it in place. Some of the letters are very Wobbly in the hole. I only had one letter to glue on, so i didn't send it back. It looks just like the picture when i put it on my wall. I like it, but not worth the price.", 
    "Nice item for the money. Hangs well.", 
    "Given as a gift and it was very happily received.", 
    "it was okay for the bedroom could be better", 
    "this was a gift. she was okay with it other than dimensions", 
    "Gives the extra umph I was looking for in my Living Room.", 
    "too hard to hang and some letters were broke", 
    "The negatives are that these are hard to mount and the letters dont stay in place. The positives is that they really looked beautiful after I glued the letters to them and they stayed better with our own hardware.", 
    "The wood is very nice and they look nice up, however I had to reinforce the letters so they wouldn't fall out!", 
    "I gave this as a gift to my godchild she is so happy with them.", 
    "Brought these for my fiancee for Christmas an she loved them.", 
    "The plastic wall anchors broke when I was trying to put them in the wall, so I put the shelves up without them. They look great and I've received many compliments on them.", 
    "mach perfect with the decoration on my living room", 
    "These shelves are perfect.", 
    "Is perfect in my daughter room", 
    "After multiple attempts to get the letters to stay in (they were to be secured with pegs - however peg hole too big and peg on letter too skinny). Physically the nail holes cannot support the shelf, as well as hold it straight. Finally, had to return as a lost cause. Save your money - poor quality materials and poorly made.", 
    "The greeting gives a good atmosphere", 
    "They come as three shelves and the letters fit into corresponding holes. Although I can see how the packaging would be simpler, I used a bit of gorilla glue to make them sit solid and permanently. I decorated the shelves with a bit of silk foliage. These are a great guest room wall filler. I love them.", 
    "Adds a little something extra to a room. Very nice.", 
    "Very well put together product. I would order it again", 
    "Letters are on pegs and one if the pegs broke....", 
    "It's exactly what I expected for the most part, but the pegs on the letters are kinda cheap. I accidently dropped a few letters on the floor and the pegs broke off....should have metal pegs in my opinion. Be careful not to drop them.", 
    "no good----------------------------------", 
    "I place it in our kitchen area & it was perfect! Easy to install in the wall. Did it in less than 20 mins.by myself.", 
    "Simple wall decor to put on our dining room wall", 
    "Very nice but a little fragile", 
    "Looks exactly as in the picture I love how it make my white wall pop", 
    "Looks awesome in our room", 
    "Dont buy it. The shelf comes off. There is no way it stays intact on the wall. The screws are weirdly shaped and its difficult to hang planks", 
    "Cute but small and two of the letters came broken, bought glue and fix it but disappointed I had to put in extra work. Very easy to put up and works well for small spaces", 
    "Loved my item, easy to put up. Looks great!", 
    "When your upset, or annoyed, just look at your wall..my family loves it!!!", 
    "Love it and truly a nice accent.", 
    "Doesn't hope it well on the wall! And looks cheaper!", 
    "This are so beautiful and are so easy to install.", 
    "Don't ever bother buying this piece of crap!", 
    "I am very disappointed with this item since it arrived here in damaged condition. The edges were chipped due to inadequate packing. I strongly suggest that you review your packing procedure.", 
    "i love them but one of the shelves fell of and everything broke the letters did too so I had to paste them back on with glue . They're really cheap but they're pretty .", 
    "Exactly what I expected! Great quality and perfect for my living room!", 
    "Very nice art work and easy to install.", 
    "I rec'd all the letters and they looks good on the wall.", 
    "I love these three words and think they should be in every household. However we did receive one of the letters with a broken dowel and are going to have to super-glue it together. I only hope the glue works and does not show.", 
    "Got some broken letters but glued it back together.", 
    "I like this item, but i wish letters were bigger size!", 
    "I was very pleased with these shelves. They look nice up, are good quality and sturdy. The letters have pegs on them that fit into pre-drilled holes on each shelf and were easy to hang!", 
    "We have put these shelves in our kitchen. They look beautiful. I am happy that I decided to but this product.", 
    "Perfect design!! Perfect size !!! Really good material.", 
    "This as a gift for a person who just began their recovery process and needed reassurance to begin living a prosperous life. She was ever so grateful to have a daily reminder as to why she decided to live instead of exist.", 
    "I love my wall sheleves, I am going to put in the hall way.", 
    "The letters are removable for easy dusting. I hung the shelves over my bed's headboard as a daily reminder to appreciate life.", 
    "Placed them in breakfast room and they look very classy and modern at the same time.", 
    "Looks good in my family room. I also got the believe sign and combined them together with my family sign Hung them together in my family room and love the look around my pictures on my wall. I get lots of compliments from visitors"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Laminate-Live-Love-Laugh-Inspirational-Wall-Shelves-Set-of-3/7752380/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=6", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7752380/Laminate-Live-Love-Laugh-Inspirational-Wall-Shelves-Set-of-3-3d70b633-979e-43fe-8ed5-86050f1b1ae5_600.jpg"
  ], 
  "description": "Make your surroundings stylish and inspiring with these chic wall\nshelves showcasing three bold words. These beautiful wall shelves\nfeature a black finish that blends easily into a wide array of\nsettings. Both decorative and functional, these painted shelves are\nideal for displaying your favorite framed photos and ornaments\nwhile showcasing your unique sense of style and positive attitude. Colors: BlackFrame materials: Laminated MDF, woodFinish: Laminate, painted lettersNo visible hanging hardware, hardware includedNumber of shelves: Three (3)Dimensions: 3.25 inches high x 15 inches wide x 4.5 inches\n  deep eachStyleContemporaryMaterialWoodTypeWallAccent TypeDecorative ShelvesShelf TypeOtherAssemblyAssembly RequiredColorBlackFinish StylePaintedNumber of Shelf3"
}