{
  "name": "Large_Beech_Veneer_Zig_Zag_Corner_Wall_Shelf", 
  "price": "EUR 44.39", 
  "reviews": [
    "This product arrived very quickly. It's hard to get a feel for exactly what it will look like based on the picture and measurements, however this shelf was very small. I intended to use this in a very open, spacious corner, hoping it would take up a significant portion of the wall. It certainly did not. The space between the shelves would only fit very small items/books. More for decoration than function.", 
    "This wall piece actually comes in pieces, however, it is very easy to put together. It is exactly as described!", 
    "You can see that it is veneer so if you want a real wood look this it not for you. I use it for my seashell collection. It seems strong enough for books too though", 
    "We have a new addition.I ordered this to fill this empty corner (does not get any sun) instead of a plant. Price is good too.", 
    "Perfect shelf for a small space - helped get a few items off tables", 
    "While these type shelves have been around forever--bet you can't go find one for sale. Easy to assemble and install--looks perfect in my daughter's room. She loves it for displaying some of her \"treasures\". Can't beat if for the money.", 
    "This is the nicest corner shelf I've ever had and it was real easy to put together.", 
    "Overpriced for cheaply made product.", 
    "this is a great corner shelf for nick nacks in a small space. Easy to put together and mount.", 
    "HaveTo put togetherBut cute piece", 
    "I needed to add décor to a corner in my dining room. I purchased this wall shelf and spray painted it gold to match my room. It turned out beautiful!", 
    "My husband stated these were quite easy to assemble. One of us has technical ability - LOL. The product is very true to photo. They look very nice in a neutral based room. I bought for a small, guest room. It's only about 100 square feet. I was concerned that although there enough was wall space, the pieces would look too big and clunky. On the contrary, the verticality of the pieces make the room look bigger and richer. They add a nice neutral tone to the room. Yea!", 
    "A great corner idea for small items ie. heated blanket dial, clock.", 
    "perfect and easy to hang in my bathroom", 
    "a little bit to put together but looks very nice in the corner", 
    "I have a number of these shelves in my house - I ordered the light Beech, not as happy with it, but this is my fault - I should have gotten the white. At any rate I do have the shelf up in a guest room and it looks lovely.", 
    "It's really beautiful and every one of my family members and friends love it! Just beware that the shelves are short and only small items can fit (not actual books, for example).", 
    "Using that generally wasted space in your rooms is always a plus. This sturdy shelf makes use of that space while still be appealing to look at and supporting most items you want to display. I like that I can actually feel safe putting my treasured nick nacks on it and not having them at risk on some shaky standing bookshelf or table. Great idea and I thank whoever came up with the creative idea!", 
    "easy to assemble and hang - looks nice - small shelves - wish it was real wood but since it is up high you can't really tell", 
    "It is all MDF, which is disappointing, but not surprising.The build quality is good, once installed. The hardware is OK. The pieces that are supposed to cover the screw heads are not the right size. A lot of them kept falling.", 
    "We purchased three of these shelf units for a very small 9 ft. x 9.5 ft. guest bedroom. They were easy to assemble and relatively easy to install in three corners of the room.They each came with two large anchor screws but I also used some long slender kitchen cabinet screws to anchor them into studs for additional stability. (You will need to drill pilot holes for these additional screws) They provide valuable shelf space in the small room without blocking the walking space around a queen size bed. They look nice too.", 
    "Very pretty finish, easy to assemble, fits great in he corner, great accent piece."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Large-Beech-Veneer-Zig-Zag-Corner-Wall-Shelf/8670134/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8670134/Large-Beech-Veneer-Zig-Zag-Corner-Wall-Shelf-22f5a277-300e-4fb9-b498-6807a61386a3_600.jpg"
  ], 
  "description": "Make your contemporary decor more aesthetically pleasing with this distinctive corner wall shelf that features an innovative zig-zag design. Showcasing a versatile beech finish, this wall shelf blends well with other lightly colored furniture pieces in your living room or office and creates interesting contrast when set against a dark-colored wall.Laminated MDF wall shelf comes in a beech finish for versatilityMeasures 48.5\"H x 7.75\"W x 7.75\"DAssembly instructions and hardware are included for easy, convenient installationNo visible hanging hardware for a clean, polished lookHangs on a wall corner to make best use of indoor spaceIncludes one wall shelfStyleContemporaryMaterialLaminate, MDF, VeneerFinishLaminateShelf TypeDisplayAssemblyAssembly RequiredColorBrownNumber of Shelf5"
}