{
  "name": "Lincoln_Metal_Open_Shelf_Distressed_Wood_Occasional_Table", 
  "price": "EUR 113.69", 
  "reviews": [
    "The table itself looks like good quality. However, we were not able to assemble because the table top and bottom was very damaged when it arrived.", 
    "Beautiful table but arrived damaged. Replacement was in good condition.", 
    "A bit pricey for the type of \"wood.\" It's a kind of laminate. Really easy to assemble but, be careful. The staples from the packaging made some indents in the top of mine.", 
    "Great looking table and very easy set up!", 
    "I bought this table and it is wonderful. Its exactly what I thought it would be. It arrived in the time frame it said it would.", 
    "Love, love, love this set!! They are gorgeous, makes my room look different but it matches everything and it is very sturdy, good piece of furniture!!", 
    "Great price, great color! Instructions could be better but overall very happy with the purchase. I got the whole set!!!!", 
    "Great product. Looks even nicer in person and a lot more expensive than it was", 
    "Easy to assemble, sturdy finish, and elegant design. Would recommend to anyone considering a new coffee table.", 
    "Needed a coffee table that wasn't expensive. This table was $*. The top of the \"wood\" table is not very attractive. It looks like the top of a card table or something you would find in a school cafeteria. If my husband wouldn't have thrown the box away minutes after he assembled it, I would have returned it.", 
    "easy to assemble and love the slightly industrial feel of the metal sides", 
    "Love this table. goes great with our sectional couch fits perfect with living room", 
    "A friend of mine from out of state had this table and I just fell in love with it! Got mine in perfect condition. Easy to assemble but a little tough which one set of hands. Looks great in my place", 
    "Price is reasonable and assembly was easy.", 
    "This is the perfect coffee table! It was easy to put together and is the perfect fit for our living room!", 
    "My new living room is smaller, so my 3ftx3ft coffee table took up the whole room. This smaller table opened the room up to look much larger, and added a touch of contemporary style. The top looks like real wood, and even has the wood-grain feel, but rings from cups wipe right off without ruining the surface. Very happy with this purchase.", 
    "Never found such a cool, industrial look table in stores. Simple assembly.", 
    "The tabletop looks plastic. The color is more brown.than the grey it is showing. Easy to put together. It's ok for a family room not the best quality", 
    "I am so disappointed. Bought this back in Oct 2015 but my contractor took more time than he quoted and later ran away uncompleted. That pushed my move in date 3 months later and now when I just moved in today, I opened the package, my table was damaged. There was a big hole in the wood in the middle of the table. The bottom piece was chipped. The table is completed unusable. The poor packaging is the cause of this. I would not recommend AT ALL, even though the piece is pretty, it is trash to me now and too bad for me because I opened it months later :("
  ], 
  "link": "http://www.overstock.com/Home-Garden/Lincoln-Metal-Open-Shelf-Distressed-Wood-Occasional-Table/10390623/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=13", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/10390623/Lincoln-Metal-Open-Shelf-Distressed-Wood-Occasional-Table-5f66b570-1b32-4dc8-b742-5a1867da640c_600.jpg"
  ], 
  "description": "Modernize the look of your living room with this Lincoln occasional\ntable. Its open shelf design and clean lines give your home a\ncontemporary look, while the angular metal fretwork enhances the\ntable's aesthetic appeal. Complement your existing wood tones with\nthe table's distressed brown finish. Place a lamp on this side\ntable for added illumination, or use the top surface for displaying\na piece of sculpture.Accent table modernizes your decorDistressed brown finish for a rustic lookMetal frame and melamine board provide strength and\n  durabilityTable top measures 1.19 inches highEnd table open shelf measures 18.38 inches high x 22.06\n  inches deep x 20.5 inches wideOverall end table dimensions are 22.25 inches high x 22.06\n  inches deep x 22.06 inches wideCoffee table dimensions: 47.25 inches long x 23.63 inches\n  wide x 17.75 inches highStyleCasual, Nautical, TransitionalMaterialMDF, MetalTypeAccent Tables, Cocktail Tables, Coffee Tables, End Tables, Side Tables, Table SetsFinishBrown FinishShapeRectangleAssemblyAssembly RequiredColorBrown"
}