{
  "name": "Ramsey_Dark_Brown_Mid-Century_Modern_End_Table", 
  "price": "EUR 97.46", 
  "reviews": [
    "I like modern pieces so I ordered two modern end tables for my living. Initially I ordered them as accessories to the room's design but they are perfect for my books and documents. The frame is solid and the unique table top brings fresh look and unique design spot in the room. Quick shipment and fair price.", 
    "Got these for our 1962 lake cabin bedroom side tables and they look perfect with the Vanda 7-drawer dresser that Overstock sells. Great size, fine quality and love the style!!!", 
    "This table is so unique-looking, that I had to double-check and make sure it was actually an end table. One of my favorite things about this table is the legs do not scratch my wood floor. I can drag the table around and not have to worry about it messing up the floor. The table looks small, but it is very sturdy. Assembly was simple and easy.", 
    "I really love this table. The price was ridiculously affordable and the look and quality exceptional. With all the space I have enough place for the photos and candles, and on the lower shelf I can put the book I am reading. It is the perfect end table whenever needed.", 
    "Great design and arrived just as I expected. 5 minutes to assemble. The finish is what you would expect of a table at this price point and has some issues that I noticed but a guest wouldn't unless looking close. Overall I am really happy with it and would recommend it to anyone.", 
    "Holes were not fully drilled. Pieces connecting the legs were too long, so legs did not line up with holes, by about 2 inches. Returning it.", 
    "great look but not steady nor does it look finished", 
    "Wish the stands are not that shiny. I will prefer them to be on brassy or pewter like. But design is perfect.", 
    "Great products and outstanding customer service!", 
    "Perfect accent for modern decor", 
    "Not super solid materials, but you get what you pay for.", 
    "We really like this end table, it definitely has the mid century modern feel. The reason why we didn't give it a five star rating is because there are some surface scratches, although not very noticeable, they are there.", 
    "Nice little Mid-Century Modern end table that I'm using as night stands for the master bedroom. Small enough to not appear bulky, yet there's room for everything including the tv remotes. Basically they just look cool and give a very streamlined appearance and you can't beat the price.", 
    "The wood portion of this table is sturdy but the finish is uneven and the stain/varnish is thin. Putting the legs on was difficult because they did not seat properly, and the minimal directions were of little to no help. The table looks good in photos, but it's a fairly shabby product.", 
    "Love the look. and the quality and price. highly recommend!", 
    "I damaged the veneer when I was putting it together. my fault, but the scratches in the veneer were easily fixed with a black sharpie. I put my coffee on it and even put my feet up on it. The table sits on a shag rug so it seems stable and pretty functional as well.", 
    "This interesting table is sturdy and made of wood and chrome. It it true to the description. The box it arrived in was not damaged in any way but when I opened it the wooden table TOP was scratched in 4 places, three of them minor surfaces scratches about 1-2 inches long but the fourth was a series of gouges in a 1 inch by 2 inch area. It looks like assembly line damage. I kept the table, fixed the imperfections with a sharpie and went on with my life.", 
    "I loved the end table, it was exactly what I wanted. The only bummer was the the deep scratch on the top. It was to the back and about 1 inch long, so I just covered it with a sharpie, rather than dealing with the hassle of sending it back.", 
    "I LOVE mid-century styled furniture, and this was mid-century at an affordable price. I really can't complain. Well, except one of the screws was warped a little and made it more difficult to assemble than it would have been otherwise.", 
    "I purchased two of these end tables for my daughter's room. The table has a slot and I'm not sure if that was just for design purposes, but my daughter loves to store her books and papers in that area. It's meant to be an end table, but it's serving another purpose in our home. It keeps her organized and she likes the fact that it matches with the rest of her furniture.", 
    "I love that I can place items on top of the table and put items in the slot. The legs are metal so they don't scratch my floor. The table is very lightweight, but it's sturdy and won't break easy. I bought this end table because it's different from most end tables on the market.", 
    "This is a really excellent table, this is why I ordered a second one also. Our bedroom is really modern and even has a futurist touch, so these modern end tables could not complete the look better. They are stable and solid, really spacey and work perfectly near the bed. I am thinking of buying one into my office also, so that I can have a key and wallet holder table.", 
    "This piece was very difficult to assemble. I ultimately had to hire a handyman to put it together! Although there are only 8 screws, it was difficult to align them over the holes. It was originally delivered without one of the tools and I had to call overstock to ask them to supplement the order. Overstock was very responsive and that process went smoothly - but it delayed assembly as well.", 
    "Nice table works well and good design. The packing however was another matter. Table is shipped disassembled with legs on top of thin styrofoam packing which broke allowing metal table legs to rub against top of table. If I had paid more for the tables I would have filed a claim but decided to live with the scratched tops. If the shipper would have just turned the top of the table down the scratched surface would have been on the bottom of the tables and no concern....oh well, disappointing is probably the best description of my experience.", 
    "Nice table, nice size. I would buy again. Fits well in the space.", 
    "For the price can't beat it! Easy to put together and looks great in my mid-century mod living room.", 
    "Easy to pout together and just the right size for my retro Palm Springs style mid century home. A lot of stuff is pawned off onto the public as \"mid century\" when, in fact, it really isn't. Although this original table design is from the 60s it fits in perfectly with the extreme low and long modern lines of a mid century style couch. It's a great compliment to my Noguchi coffee table by Herman Miller.And it was inexpensive.", 
    "It's easy to assemble, beautiful and distinctive. We've gotten tons of compliments, and I just love it.", 
    "This item assembled very quickly. Looks very modern and matches well with other Wenge items from this website like the Hubbard Brown Oval Coffee Table and the Grimes Round Brown End Table (wenge color, thin chrome legs). Once set up it felt like it needed protection to cover the top - so I temporarily covered the top with a small glass plate from an Ikea Malm chest with 2 drawers (fits nicely). Now I can sit drinks on it without worrying. It is decently sturdy, but not enough so that I'd put a lamp on it while sitting on shag carpet. Try sitting it at an off-angle to your sofa to show off the contours.", 
    "I recently surprised my colleagues. When I saw this great looking table on such an affordable price I ordered a few for my employees into their offices. The tables look so fine in the modern offices and they are perfect for storing small piles of documents and coffee cups on the top. I made a really great deal. Thanks.", 
    "We needed an understated end table to place a showstopping modern lamp on and this was the perfect choice. Pretty easy to put together cleans easily. We left the opening empty and it looks great!", 
    "This table not only gives a fine and fresh look to the living but it provides a great solution for storing my magazines and newspapers. The purchase price was really affordable and shipping was the fastest so far. This is not my first order and I knew I will receive great quality. I highly recommend this small and lovely end table to everyone.", 
    "I ordered this modern and unique table for my son after he moved out from the family house, to have a modern and useful addition in his small living. I knew he likes modern pieces and this end table is perfect for his taste. The price is really affordable, shipping was quick and my son loves it. Thank you Overstock.", 
    "This table is quite unique. I have seen some with similar look but the fine details and the great quality material combination make this table the best I could find. It is simple and minimalist, modern and comfortable, just what a table should always be. Even more, the price is amazing and shipping great. Thanks guys.", 
    "I am not a big fan of modern furniture but this table looks great. I ordered two of it on a great price for my younger daughter as they needed some simple yet modern and unique end tables in their bedroom. They placed the tables near the bed and it really looks modern and sophisticated. The pieces are durable and perfect. I highly recommend this piece."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Ramsey-Dark-Brown-Mid-Century-Modern-End-Table/6593189/product.html?recset=e0d8c64c-2005-475b-b807-a0c9a9aa123c&refccid=WIGRA465A6RKMFKMHZ4GQW6SDA&recalg=828,512&recidx=12", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6593189/Ramsey-Dark-Brown-Mid-Century-Modern-End-Table-e3abe53b-6e4f-47f7-b644-65d377465cb4_600.jpeg"
  ], 
  "description": "The loop design of this mid century-inspired side table not only creates a shelf but also makes a stylish statement in your living room or bedroom. This end table features a durable construction and a beautiful dark brown finish.Modern end tableMaterials: Birch core and steel with solid basswood veneer and wengeFinish: Dark brownNon-marking feetNaturally uneven wood grain in the basswood veneer results in an uneven appearance of brown stain, resulting in some areas being darker than othersDimensions (overall): 21.7 inches high x 21.8 inches wide x 16.8 inches deepStyleContemporary, Mid-Century, TransitionalMaterialIronTypeAccent Tables, End Tables, Side TablesFinishBrown FinishShapeOvalAssemblyAssembly RequiredColorBrownFurniture Frame MaterialWood & Metal"
}