{
  "name": "RiverRidge_Ellsworth_Tall_Corner_Etagere", 
  "price": "EUR 170.02", 
  "reviews": [
    "I had been searching for a CORNER piece which would be useful in a bathroom. As the bathroom is small and lacks storage space. I purchased this for my parents who have a new apartment and needed something that would solve their storage problem, while being pleasant to look at yet fit within the limits of a light switch and towel bar! The price was right, all the pieces, instructions and packages of screws etc were included. The assembly and installation went well and took about at least one hour. This product solved the problem for them! We were able to reposition the towel bar, to allow the cabinet to fit within the space. My only negative review is the lack of padding in the box, which was a very long box and showed many dents from the shipping. I was afraid that the pieces inside would have been damaged, but only one or two tiny corners suffered and those were on the back, so unseen. I would suggest stronger packing material be used to protect all the pieces INSIDE as this box traveled over many stations before arriving at its destination.", 
    "Do not purchase this product. It is incredibly cheap and flimsy. It is difficult to put together and the end product is ridiculously inferior. You are wasting your money with this item. In the past I have been satisfied with Overstock products, so I was surprised that this cabinet was so misrepresented. I probably will not trust any Overstock furniture again.", 
    "I needed storage for cleaning supplies, tp, etc. In my bathroom. My space was limited. This corner cabinet was exactly the right thing. This is not an heirloom! It is a very basic piece. It went together easily and looks ok. My floors are not level so we needed to put shims under the front \"feet\", but that was the only adjustment and wasn't due to any defect on the staters.", 
    "I put this in my kitchen in the corner between 2 windows. It makes the whole kitchen look bright and clean. I use it for all my kitchen towels and I have small teapots on the shelves. I am so glad I bought this.", 
    "It was pretty easy to assemble, but you do need two people. Fits perfectly in the spot I chose and I would recommend it to others!", 
    "bought for our bathroom and its nice, really no complaints", 
    "This corner storage piece fits well behind my bathroom door. It's attractive and well built!", 
    "Pretty easy to assemble, definitely would recommend two people though. Fits perfectly in my small hallway corner, and is very sturdy. Exactly what I was looking for", 
    "I needed this for a small fit in our water closet and it fit perfect. sturdy and adorable!! Love it!", 
    "I had no problem assembling this unit the directions were clear. I am pleased as can be with it as it fits a tight corner in my kitchen and holds a surprising amount of crystal and glassware. Useful and decorative at a very reasonable price", 
    "I ordered this for my kitchen and was impressed with the quality. Very simple and cute and fit into my corner perfectly. I just love it.", 
    "Bought this for our bathroom and am very pleased with it. Has a clean look and design and is a good buy for the price. Be sure to tightly screw the parts together before attached the upper and lower section. once they're attached and you see gaps between some of the parts, there's no way to tighten them unless you're willing to un-assemble everything.", 
    "The cabinet was very strong and made very well. I would recommend this product for anyone who wants something that's strong and has a classy look to it.", 
    "I put it together myself. It did great in my space and it was exactly what I've been searching for", 
    "This corner cabinet that we ordered fit just right, price was great and also great quality. I would recommend this to anyone.", 
    "Definitely not made for storage. I wanted it as a linen closet for my bathroom and I can't even put one towel in the shelf.", 
    "I folded the towels and they do not fit. I had to angle them, which does not look very decorative.", 
    "I have nothing good to say. Small and made with composite wood that was only slightly better than cardboard", 
    "Putting it together was a bit scary, however, when done, it looks terrific.Good quality, nice finish and perfect for a corner.", 
    "Seems to be sturdy and looks good", 
    "It's a little shorter than I thought but it fits perfectly an di a nice piece.", 
    "This cabinet was an excellent choice for my bathroom corner solution", 
    "Cute but very little storage room underneath.", 
    "I have been looking for something like this for our smallee bathroom. This fit our needs. I put it together myself. The instructions was well out together. It's heavy so had to have my husband helo me move it into bathroom. I like thr very top to hide my hairdryer. Glad I found it on here for a reasonable price.", 
    "Nice piece of furniture for the price", 
    "This went together easily and for my space was just right.", 
    "Arrive as expected and thrilled. Its perfect for what I needed, Its as described...great buy!", 
    "This is not a fine piece of furniture, but for the price, it looks just fine in the corner of my bathroom.", 
    "Easy assembly and very nice in the bathroom.", 
    "We have a small half bath with no storage. I held my breath until my husband put it together and placed it in the corner of the bathroom. It fits perfectly, is sturdy and stores exactly what I needed it to store. I love it! I also put a deodorizing disk on the very top where it cannot be seen. Just perfect!", 
    "Excellent corner shelf - easy to put together (I did it almost all myself!).True espresso color.", 
    "It's not super quality material, but for the price, I got what I expected. It's not bad, and it's actually better quality and sturdier than other similiar priced products. However, the doors don't close properly. It may be just a problem with the unit I received, of course, so not a reason not to buy. There's not a lot of room inside.", 
    "VERY cheap material, don't over tighten the screws or you will destroy it.", 
    "This was purchased as a house warming gift. The recipient took the time to acknowledge it with: \"EXCELLENT ITEM, VERY FAST SHIPPING\".", 
    "great for the price and for what I need . Quick and easy to assemble pieces together.", 
    "Very easy to put together & best of all... it fits perfectly in the corner giving space to small bathroom. It's tall enough to neatly store everything that's important. This is not only a \"good buy\" but a \"HELLO!\"", 
    "I'm an author, so keeping my notes and paperwork nearby is crucial. I ordered two corner Etagere's. I love how perfectly they fit in my workspace and the roomy storage area within holds my necessary notebooks and folders - within easy reach, right at my fingertips.", 
    "Adds a nice touch to my powder room!!", 
    "This iten is very bad ,it came with damage ,the box exposed the conten,missing hardware,it should be removed from overstock catalog.", 
    "I ordered 2 of these and both came with different pieces broken in the box. They are smaller then I anticipated and made cheat- however, they are good for the price and will serve their purpose just fine after I fix the broken slat on the door. (The other part that was broken is kind of hidden so it's ok).", 
    "It looks nice but is very very low grade Wood (if you can called wood) on the pic on web page it look great and heavy but sorry it is not ! Will I buy it again no", 
    "It doesn't really fit in the corner of our bathroom but our house is over a hundred years old so nothing is perfect. it works nice and fits a fair amount of stuff. Just be careful not to screw in the screws too tight because they make little bumps on the front side if you do!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/RiverRidge-Ellsworth-Tall-Corner-Etagere/8316257/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8316257/RiverRidge-Ellsworth-Tall-Corner-Etagere-75c1787a-978a-498e-b9e5-d94f2fb553ba_600.jpg"
  ], 
  "description": "Bring a touch of clean, contemporary sophistication to your home or\nworkspace with this corner cupboard from RiverRidge. This white\nstorage cupboard slides effortlessly into any corner, maximizing\nusable space and providing ample storage. Whether you're using this\netagere for storage or display, it blends with virtually any decor,\nand the sturdy construction ensures years of use and enjoyment. Look for other Ellsworth bath items for a matching\n  ensembleIncludes: One (1) corner etagereMaterials: Painted MDF wood compositeFinish: White or espressoDimensions: 68.31 inches high x 17.5 inches long x 11.5\n  inches deepStyleContemporary, Modern, TraditionalMaterialMDFTypeFloor Cabinet, Spacesaver, Storage CabinetFinishPaintedCabinet HeightOver 34 InchesAssemblyAssembly RequiredColorWhite"
}