{
  "name": "Safavieh_California_Cozy_Solid_Dark_Grey_Shag_Rug_", 
  "price": "EUR 56.03", 
  "reviews": [
    "I read review after review on numerous rugs. I was nervous, as it seemed there were an equal amount of reviews that were negative and positive. After a month, I finally jumped in and placed my order. I ordered the 9.6\"x13\" and its exactly what I received. I ordered on a Friday and received it the following Wednesday!! The best way to describe this rug is luxurious and classy. It is super soft, so far does not shed, has no odor whatsoever, and the pile is perfect (about 1.5 inches) and the pile is so thick that you cannot see through to the padding. The padding is woven with tightly weaved thread and does not flake off. Also when you fold the rug, you cannot see through to the padding which is a tell tale sign of a well made rug! The color is exactly as pictured on my screen (my resolution anyways). The rug came folded, so there are a few noticeable fold marks after I laid it out in my space, but none of them major and I expect the fold marks to work themselves out over the next few weeks. I am so happy I finally placed my order! Don't hesitate and order now!", 
    "I am over the moon ticked pink with this rug, and the price didn't cause me heartburn.. I recently painted my family room in a taupe, but it is a grayish brown color, not a warm beige, Found some new furniture; couch in a cream/ivory color and chair and a half in a gray, they actually call the color gun metal. Looked for weeks for a gray rug that would work, Grays are difficult for me to work with, but I ordered this in a 3x5 as a test. When it arrived I couldn't believe my eyes it was one of the most beautiful shades of charcoal gray that I had ever seen. I took the rug to the furniture store to lay beside the fabric I selected for the furniture. The designer/sales thought it was more beautiful than what they had to offer. Some of their rugs were over $****.**. When they asked me where I got it, I was so proud to tell them Overstock.com, and they were flabbergasted! I'll use this smaller rug in the bathroom and I just ordered the 9'6\" x 13 for the family room. Nice and squishy and soft on your feet. It does need a rug pad. I ordered a felt pad for extra cushion. So if you are looking for a gray rug that leans toward cool colors this is the one for you. If you are looking for a gray that is a warmer/brown tone. This is Not the rug to get.", 
    "This carpet arrived less than 5 days after I ordered it! super soft and comfy (my kids were rolling around in it when I placed it on the floor). I order the largest size (9.5x 13) so it came folded in several places. The folds are still visible but I am hoping they will subside. No odors (as mentioned for other rugs I saw), and the color and texture were great. definetly recommend this carpet.", 
    "High quality rug for a great value. Very fast shipping. But Beware!!! I would give it 5 stars but I'm only giving it 3 because the color is not accurate!!!! you are taking a huge risk buying online. I purchased the 11x15 and its not gray.......its blue. I'm so disappointed. (sick) This rug wont work in my living room and clashes with my sofas. A rug this size is too expensive to return, so I'm stuck with it. If you are looking for a blue rug with a gray tint, this is the perfect rug for you. Its a shame my dogs love it more than me. :(", 
    "I am very pleased with this rug. I agree with some of the reviewers that the color has a very subtle blue undertone that's noticeable in some light conditions. Even so, I would not describe the rug as being any other color but grey. I bought a plush pad for it, which I definitely recommend for added comfort.", 
    "I have purchased 3 of these rugs from Overstock in 3 colors (light gray, dark gray and beige). I first purchased the light grey for our nursery and loved it. Although was not previously a shag rug fan, I got tired of endless rug shopping and ordered the rug at 2am on a whim because customer service promised I could return it for free if it had bad fumes (it did not). So glad I did!! After loving it in the baby's room, I ordered the beige for our bedroom and then ordered the dark grey for the playroom. The best thing about these rugs is that they look expensive, they do not shed at all, our regular vacuum works perfectly fine on them, and the colors are blended (dark and lighter tones in each rug) so they \"shimmer\" and help tie together different colors in the same family. Lastly, the fibers are NOT shiny. I was very afraid of the synthetic material, but it has a very nice appearance and does not look synthetic at all.", 
    "The rug arrived quickly...I was surprised it was not rolled like other larger rugs. it was folded. I am returning this rug..the creases are impossible to get out. The color is off...it's more of a metallic silver and blue and less grey. I usually find grey a sophisticated color but this is disappointing.", 
    "This rug goes perfectly in my living room. It is a very dark grey, maybe just a little darker than what is in the picture. Beautiful color, exactly what I wanted. The rug is so comfortable. A little hard to vacuum since it is so think even with my setting all the way to high. I would recommend this to anyone looking. We also bought the same rug in another color for the bedroom. Both are perfect!", 
    "I had pretty high expectations of this rug after reading the reviews but when I took the rug out of the package and laid it on the floor - I was OVERJOYED! This rug just made my house! The color is phenominal!!! It's GRAY and maybe a hint of a very very dark blue. But to me - all I see is gray. It is the thickest shag I have ever felt. And I have 5 shag rugs total and this was is the thickest. My cat was walking on it last night and he was literally sinking into it - it's so comfortable. I would recommend this rug to ANYONE who is on the fence about it. Just get it ... the color is amazing. I got the 5x7", 
    "Excellent quality carpet, doesn't shed ,thick ,luxurious, so soft. Color is dark gray, with hint of stale blue, but not too much, mostly gray, picture is pretty accurate. Can't beat the price plus shipping from Overstock was lighting fast, I got mine in 2 days. Very satisfied with my purchase and I 'd recommended this awesome carpet to anyone. Thanks Overstock :)", 
    "This rug smelled funny and was not as nice as the picture", 
    "Does not look at all like the picture, too dark and different length of shag", 
    "very plush and looks exactly like the picture. been down on floor for 3 days and all the bends are gone.", 
    "Overall I'm happy with this purchase. I read all of the reviews on here, twice, and when an Overstock coupon showed up in my email, I went for it. Here's my take: The color is exactly the same as what I see on my screen. I've purchased many items online over the last year and very rarely has the color been different from what I'm looking at. On the off chance this helps someone, I use a MacBook Air 2012 at the default settings and Safari as my browser. The overall quality of the product is good. Its a rug so there's not a lot to worry about but again, the things different reviewers talked about such as smells or creases are a nonissue. I bought the 6' 7\" square and it came rolled up - so no creases possible, and there was no odor at all. Lastly, the \"shag\" factor. This is where I was a little disappointed. It is a very fluffy rug, but it is not shag. I'm good with it but felt the title of the product to be a bit misleading. Maybe traditional shag rugs aren't made anymore? Bottom line: even though it isn't a true shag carpet, it was an amazing value and it fits well with my decor.", 
    "This shag rug is soft but not the softest I've felt. It seems durable. The color of gray is blue based so matches cool colors better than a warmer gray. There are several strands that makes up this rug, so when the light hits it can give a different look (silver/shiny, dark gray, etc.). This rug is easy to vacuum, but harder to clean up stains (due to the shagginess of it). Also, the depth is about a couple of inches, so things can tend to get buried in there and sometimes the vacuum can't pick it up.", 
    "I was very disappointed about the color. The picture makes it look more grey than it actually looks in person.", 
    "Learned my lesson, read the 1 star reviews FIRST!!! Because this rug really STINKS, it made us sick, literally! We bought this for my daughters bedroom, and it looked great. The next day my daughter complained of a headache. As I ventured down the hall toward her room, I smelled this horrible smell, a mixture between mold and gasoline - YUK! As I opened her door, the stench punched me in the face! I asked her (loudly) why does your room stink, and she pointed to the rug. I got down on my knees and gave it a big whiff, YUP, that's it. It leaves an oily film on your hands and it's definitely the WORST purchase on O.Co. It is defective and I'm returning this item! It is endangering my families health!", 
    "I love the color and texture of this carpet. But it's been months since I bought it and it absolutely reeks! I've never been so sad about a purchase. I needed a large rug for our new hardwood, and I just can't get pass this smell. I understand that you need a special glue for this type of rug, but it shouldn't smell like cat pee.", 
    "The rug itself was nice but it smelled like moldy dirt. it smelled up the entire room and there was nothing I could do to neutraliz it. I went to a professional carpet cleaner and they said there was nothing I could do. I chose to throw it out and not return because it was so heavy it would have cost me too much to ship back to OverStock. it was apparently shipped directly from overseas with damp, mold and dirt fermenting in it over months. I feel like I should get my $200 back but I chose not to go through the effort..", 
    "While this rug did look very nice in my bedroom, the smell was absolutely atrocious. It was impossible to be in the the room for 5 minutes without getting a headache. I tried everything possible to get rid of the smell but it was no use. Shame.", 
    "The rug was not as thick as I expected or as soft. The other reviews had addressed the issue of the ends curling up but I thought I would just anchor them until they flattened. But the most disappointing feature was the poor cut of the rug so that it does not appear to be a straight cut. I have never seen this in a rug.I bought it as a runner in my closet. Very disappointing.", 
    "Great find! Colour is perfect and carpet looks more expensive than it is!!!", 
    "I received this rug within a couple days of ordering it. There was no smell when I opened the packaging, and it looks and feels exactly as I'd hoped: thick and soft. Also, no shedding. The color is a silvery charcoal and goes beautifully with my deep red sofa and black armchair. I've had this rug for three weeks and it's stood up just fine to vaccuuming and foot traffic. This is a fabulous rug and I highly recommend.", 
    "Nice quality, great color and worth the purchase. I would definitely recommend this rug.", 
    "The rug is beautiful, thick, and plush. The color is a true gray, yet I agree with the reviewers who claim this rug reads a bit bluer in person. I wanted a warmer gray but it still works well in certain lights. Great quality.", 
    "Looks beautiful with cream colored furniture and light blue walls.", 
    "Perfect for my needs. Adds a great retro feel to my less than retro furniture!", 
    "Love the color and texture of this rug!", 
    "Exactly as pictured. I bought this for my husband's office/Man cave and he loves it and everyone that sees it compliments us on it. No problems with shedding. It's nice and cozy underfoot, even on his Italian tile floor.", 
    "The carpet is perfect. It looks the same color as the picture. It is thick and plush. Love it for the money!", 
    "very soft to step on right out of bed", 
    "this is the second safavieh carpet i bought. they are a nice solid quality.i call them magic carpets, because the more i use them and vacuum them the thicker they get. i have 3 dogs and these rugs can take a lot without showing it.", 
    "First weekend I laid the rug out a few friends came over and crashed ended up knocking out in the ground. They said sleeping on the ground wasn't so bad because the rug felt great. Carpet is just like the picture and has a nice fluffy but good quality feel to it. Happy with my purchase.", 
    "We shopped around for the best price, even local carpeting warehouses. For the price, this rug can't be beat. It's warm, cozy, and inviting in our living room. It's just that added touch the room needed to bring it together.", 
    "This rug is so plush, comfortable, and great looking.", 
    "Soft carpet, color pictured is exact color we received, in my daughters room and hides the dirt well also. Overall nice carpet for great price,", 
    "Just as described ... Perfect for my style", 
    "Thick and lush, deep and a pretty overall look.", 
    "I knew what I wanted but never thought it would be so affordable much less on Overstock.com. Perfect dark gray shag the looks wonderful in front of my sectional that is light gray! Love love love it! So does everyone else that comes to visit.", 
    "Not as soft as I wanted, but still a great value", 
    "Soft and thick,mi really do like this rug and it came in a timely manner. It is a bluish grey.", 
    "We have this in our walk in closet. Great value", 
    "I bought the giant one and am loving it. Nice and fluffy, my dog loves it too! The gray is pretty dark and works for my living room. I was worried about creases and lumps when i first got it all folded up in the shipping packaging. But it has all settled down nicely. It does have a \"smell\" to it still, a few weeks later- the smell of new, clean carpet! So...So far so good!", 
    "I love this rug sooo much. The color is beautiful and really adds a pop to any room. It's so cozy and comfortable - I even lay on the floor sometimes because it's so nice!", 
    "Vacuums easily. Durable, use in a main traffic area.", 
    "Great quality for the Price!", 
    "We love our new rug. It fits the space beautifully. It's very soft. My kids really love laying on it.", 
    "Best quality at the best price! Soft and luxurious, well made. Make sure to put a non skid pad under it, though it is heavy it still slides on wood/vinyl flooring :)", 
    "I loved loved loved this rug. We got many compliments on it and it never showed any wear. I had it in the basement and we had a flood. We were able to dry it out and it never showed any signs of wear! Beautiful and and variegate colors.", 
    "This rug is a cool gray - we don't see any hint of blue in it (as mentioned in other reviews) and it's very thick and lush. We love, love, love it!", 
    "Love the rich grey color with high and low grey tones as well. Someone said this was blue. I would say more blue grey range undertones but blue does not stand out. It looks awesome in my room. Feels great with bare feet. Backing is pretty rough so order a rug pad when you order this. I am always pleased with overstock prices and merchandise.", 
    "Beautiful and plush. Received within a couple of days and couldn't be happier with it.", 
    "Very durable carpet. I've got 3 labs that lay all over this thing and it does not loose any material or snag.", 
    "Ordered this rug for my bedroom and it is fantastic- not just for the price, but in general. It is so soft and cozy, my kids love rolling around on it. The rug hasn't shed or anything and it seems to be made really well. I used a rug pad underneath of it to keep it in place. Im huge on ordering based off of reviews and this is a product I would recommend to anyone.", 
    "This shag rug is ultra plush.", 
    "Adds a cozy touch to our bedroom. If you're looking for cozy simplicity- this is it. Note rug has a very subtle sheen that doesn't bother me at all. overall very happy with it.", 
    "This is a very nice rug love the color. I got the charcoal color. It feels good. I wish I had measured better I could have gotten a bigger size.", 
    "I love this area rug! It has just enough plush an the color is perfect! I bought this for my bedroom an it adds so much to the room an brought it all together I'm happy with my purchase", 
    "This rug looks and feels nice but the smell is so awful we can't use it! It's been airing out/off-gassing for 2 weeks now and there is no way I'm going to put it back in my bedroom anytime soon. The charcoal color is a perfect cool grey.", 
    "I'm really color savvy. I've been looking for a dark gray rug--a neutral, warm gray. After looking at this one for a while. I finally pulled the trigger. It's soft. It doesn't smell. However, it is NOT gray. It is quite definitely slate blue. I'm going to return it.", 
    "Was sent a musty old rug. Can't get that stank out so gonna have to send me another", 
    "Looks like the 70's and the early 00s married and had an ugly baby, and it was this rug!", 
    "This rug is super soft and well made, however I took away a star because it took more than a week for the new rug smell to fade.", 
    "I ordered 2 of these based on previous posted reviews by others. These rugs are thin and cheap in appearance. Don't be fooled. The pictures makes the rugs look plush, but they are not. So disappointed. Going to keep them and put them in a different part of the house where they will protect the rugs but not be visible by any visitors.", 
    "Hardwood floors are wonderful but when I step out of bed in the morning I want soft cush on my bare feet and this rug solved the problem. This is a dense soft shag that looks and feels GREAT!", 
    "Placed it in guest room under a white bed and it's beautiful. Can't beat the price.", 
    "OMG this is such a plush looking rug, mad at myself for not buying the bigger area size one, but this is a great quality rug!", 
    "Very plush carpet! Adds a lux quality to the room. The color is slightly darker in picture.more black than dark gray. But happy enough not to return it.", 
    "I have now purchased 2 of these rugs. the quality is good. the fibers are soft and comfortable on the feet. they do not show dirt, which is perfect for the kids rooms.", 
    "I love this rug! It is so soft and thick! It makes for a very comfy family game night. The color is perfect...a charcoal with a lighter gray tone mixed in. I definitely recommend it!", 
    "The rug is nice but it is very dark.", 
    "just as you see it... sort of a brown/gray", 
    "I am very happy with the quality if this rug. Very soft and does not shed.Looked for months for the right color and a great price. Best deal for sure!", 
    "I love this rug, it has remained pretty and easy to maintain in our family room. Always looks great and is easy to vacuum and maintain. Doesn't shed. Great product!", 
    "Love it! Soft on the feet and feels and looks great!", 
    "Great rug if you don't want to be able to open and/or close your door. I bought 2 of these rugs to put in front of my double doors in my home...they are too thick for doors.", 
    "This rug is exactly what I was looking for. It has a good length pile just as youd expect and its easy to vacuum as well. The color is perfect as well.", 
    "Beautiful and soft. I have this in my living room and it lays perfectly.", 
    "MUCH DARKER THAN I ANTICIPATED. DECENT QUALITY THOUGH SO I'M STILL VERY HAPPY.", 
    "I read a lot of reviews before making this purchase. We are so pleased with this rug. The rug is very soft and the color is beautiful. It took a few days of walking on it and vacuuming to \"fluff\" up. We've had it for about a month now and it continues to hold up. The dark grey is a really nice charcoal and a good color to hide potential stains. Definitely a good value.", 
    "I am impressed with this rug! You can tell it is not a cheap rug by the plush & thickness of it. It is very soft but durable. I was worried about the carpet getting caught in the vacuum, but it's not a problem. This is one of the better rugs I've purchased. No need for any padding underneath! I would recommend this to anyone!", 
    "Best rug I've ever owned!!!!!", 
    "We bought this on Overstock with some hesitation. We have a similar one that we purchased at a furniture store that we loved, and we were trying to find something similar. The one from Overstock is as beautiful, quite a bit thicker, and was half the price. I can't say enough about how comfy this rug is; people constantly comment about how thick and cushy the rug feels. It's so thick that we have to raise our vacuum setting to properly vacuum the rug--a small inconvenience for a really comfortable, well-made rug! We've had the rug for about 3 years, and it has held up wonderfully.", 
    "I love the feel of this rug, so worth the price. Even though this rug is more Blue than Dark Grey I can still use it because of the colors of my accessories.", 
    "I actually ordered this rug for my nursery, but I accidentally ordered the wrong size (let's blame it on pregnancy brain). It was WAY too big for the nursery, but I loved it so much I didn't want to send it back. So lucky for me, the rug, while gray, does have some hints of blue to it, so it actually matched my master bedroom perfectly. So we put it in there and I am in LOVE! It's so cozy under foot and my dog has now found his new favorite napping spot. I still needed a rug for the nursery and I changed my mind on the color. Since Overstock didn't carry a navy option, I found one from Target in the same brand and ordered it. Even thought it was a smaller size, I think I ended up paying more for it from Target. But I loved the quality of this brand so much I didn't care. I highly recommend this brand and if you buy through Overstock, you'll get a way better deal!", 
    "This rug has deep, \"feel good\" pile. I was not sure it would work, but when I got a second opinion from my BFF (via a photo) I decided to keep it. She loved it with my living room furniture. Another friend who is an artist loved it too! It growing on me more each day.", 
    "I do really like our new rug! And unlike the former posts about it coming folded and leaving fold marks; ours came rolled. They must have seen the posts and done something about it. Very cushioned and made well. Now...lets talk about the color...I read from other people that the rug looked blue-gray. Well...that is why I ended up getting it because I bought a couch that I thought was dark gray and ended up looking bluish gray. So...it works great in our home. But if you are looking for the color on this page you will be disappointed. That looks like one solid gray rug. This has 3 different colors in it and most definitely has a blue-gray look to it. I would honestly think they sent me the wrong rug if I hadn't read former comments. I will still give it 5 stars but they really need to change that picture!", 
    "This rug is better than described. Plush and a beautiful color. The kids all want to sit on it at homework time ( that was not it's intended purpose!).", 
    "Cheap looking with a metallic sheen and sparse. Very disappointed and will now have to pay a steep shipping fee and lug the rug to UPS. I've purchased two things from Overstock and think my relationship with them has come to a quick end with the poor quality products along with a poor return policy. Partially my fault for not checking before I hit submit. Love ***** and ********* for taking excellent care of their clientele. Goodbye Overstock.com.", 
    "ARRIVED WITHIN FIVE DAYS OF ORDERING AND WAS ROLLED AND NOT FOLDED SO THE RUG LOOKS BEAUTIFUL IN JUST A COUPLE OF DAYS WITHOUT CREASES! COLOR AND TEXTURE ARE BEAUTIFUL VERY PLUSH AND SOFT ON BARE FEET!!", 
    "This is a fabulous rug - the color is dark, just as described. It's very comfortable to walk on. I am using it in my bedroom, and it looks great with my dark-colored furniture.", 
    "These rugs are cozy and beautiful for the price you can't beat it! They do have a \"sheen\" in the color. We have them in our bedroom and purchased a rug grip to hold them in place.", 
    "I LOVE THIS RUG!!!!I Had Read Other Reviews That Said That A Carpet They Ordered Came Folded In A Box Causes Creases That Were Hard To Flatten.When FEDEX Arrived And A ROLLED Carpet Was Taken Out Of The Truck I Was Thrilled. It's Beautiful, Meduim Shag, And Feels Great To My Bare Feet!!!!", 
    "We bought this rug for our daughters bedroom. It had to stay rolled up for almost 2 weeks before we were able to install it. When the time came, we couldn't believe how thick the rug was! It took a few days for the folds to lay out, but they did so quite nicely. It is a bit darker than depicted; closer to a charcoal gray. This rig is a great value, especially at Overstock's fabulous price.", 
    "Love, love, love it! This rug is fanstastic and looks so good in the room. Its thick and plush.", 
    "I do love the color & size and feel of thus plush shag rug but when it was delivered it came folded instead of rolled 9'6\" x 13' so it actually buckled the rug & it had many speed bumps in it! My family would trip over them as we walked on it! We tried to weigh it Dow & remove the creases but we just couldn't. Unfortunately I had to return it. But a smaller size that could be rolled for delivery would have been a keeper.", 
    "beautiful rug.. super cozy . very thick and plush . would order more if I had a place to put them . Not loops. Way better quality than the much more expensive ones. no sink . no shedding,, very happy!", 
    "I got an 8x10 for my bedroom to make it cozier. The color is dark gray - almost charcoal. It is more of a plush rug than shag - I really was afraid it would be 70s style shag with really long yarn (they flatten out when you walk on them). But this one is not like that and feels very soft. Adds a cozy feel to the bedroom. It is a nice value for the money (although I paid more than what it is now :/ ). I recommend it.", 
    "This was a gift and he loves it very much.H e said it was sexy so I guess it was a good thing.", 
    "This was the first item I ordered from Overstock, I couldn't be more delighted. I am very particular. The size was right. It is very soft and plush no padding needed. The price was very good I had looked everywhere. The color was slightly darker than my computer screen showed but nothing terrible. I can't say enough I am very pleased.", 
    "I was hesitant to order a rug online, but I am so glad I did. This Rug was delivered rolled up, there were no odors, but it did take 24 hours for it to uncurl completely. I used it in my bedroom and it adds a very luxurious feel. It is very plush and soft, thick fibers, and has a few different shades of gray that give it a lovely color. There are so many shades of gray it is hard to describe it exactly, but I would say charcoal is a good description. With the long fibers, it is harder to vacuum, but mine is under my bed so I only have to vacuum 3' around the bed. It looks amazing! The price is very reasonable. Buy it!", 
    "We are very happy with our rug purchase! The rug is a lovely charcoal gray color, on the darker side of the gray-scale, but with some nice variations in the weave/thread to give it lighter tones depending on how you look at it. Some reviews mention a blue-ish tint, but we didn't notice that personally. I'd say the rug is definitely gray. It is soft and feels good on your feet. We did buy a rug pad to go underneath, which does help with the thickness/plushness. Yes, there are softer/higher quality rugs out there, but not at this price! We were looking for a good price and a good rug, and we found it. There is a slight smell when you first open it up and unroll it, but it smells like a new rug to us! We were not bothered by it at all, and after a few days the smell was completely gone. Overstock's shipping was great, and extremely fast (about 2 days after ordering the rug was on our doorstep!). Very happy with our purchase!", 
    "Seems to be a good rug so far, very soft and fairly thick. The grey isn't really a flat grey (meaning all the fabric isn't one shad of grey), there is almost a sheen look to it. The grey strands of fabric/shag have an even lighter color of grey/off-white color so it has a sheen look to it when the shag is going different directions and the room light hits it. I thought it had almost a green color to it at first, but it may have just been the lighting because of the sheen effect it has. Now when I look at it all I see is grey. I've never owned anything shag so we'll see how fun it is to keep clean, no vacuuming except with a tool or if you can turn off the bristles. The tag warns to keep it away from natural light, so it seems like there may be a risk the color can fade if there is too much prolonged sun light on it...we'll see I guess.", 
    "I have purchase several rugs from Overstock in the past several years and have always been very pleased with my purchases. While this rug arrived quickly and was the rug I ordered, it has a terrible smell. I have not returned as it is expensive to return a fairly large rug. I have now had the rug 5 days and the odor is still very strong. Do not buy!", 
    "This rug shipped exactly as expected and it is a gorgeous dark grey that matched my room perfectly. The Fibers are so soft after rolling it out i immediately laid down on it to test out the comfortability of it. It is nice but if you are putting it on a hard floor, you should really get a nice cozy rug padding to go underneath it to make it more comfortable. Also, I bought this 8 x 10 rug to fit my 8 x 10 nursery so i wouldn't have to redo the flooring... but the rug is definitely NOT 8 x 10. I didn't take the time to measure but it is much closer to 7 X 9 - which is why I gave it only 3 stars. Minus 1/2 star for the lack of comfortability and mnius 1 1/2 starts for not being the right size. I think it would be much more helpful to list this rug by its actual size instead of rounding up.", 
    "I initially saw a similar rug at Home Goods for about $50 more. When I went back to buy it, it was gone so I thought I'd try Overstock. Buying rugs on line can be hit or miss but the reviews on this rug were so good that I took a chance. I'm so glad I did. The rug is beautiful and goes perfectly in my great room. The quality is outstanding. Honestly, it has the feel of a $600 or $700 rug which is what a rug of this quality and size would retail for in stores. It has a nice thick, plush feel and the nap holds up to lots of feet. The color was very true to the charcoal gray I was expecting. The rug arrived in about four days, was packaged nicely and all I did was unroll it. The edges were curled up for about a day but it's perfect now. I highly recommend this as a purchase.", 
    "They need to take better pictures as this looks like one color with shades if you move it, but it is really more salt and pepper if I remember. It did not go with my room so I sent it back. Their returns are so easy which is why I will shop here as if it is a hassle or expensive to return something then I won't shop from them. Pay attention to the small print.This place is great. I am disabled so buy almost everything online.", 
    "I was hesitant to order a rug online in general. After reading one person's comment about it being cheap and blue. I was very turned off. However there were so many good reviews about these rugs I went for it. It was worth it. No smell. No bald spots. It is full and thick. Basically fabulous! It is a cool gray but a far cry from blue. Not sure what that other reviewer was talking about. I highly recommend it.", 
    "Took a chance of this dark grey Shag rug for small living room and sooo happy I did cause it's just perfect! The rug is under my modern coffee table and it looks just gorgeous in my modern living room. The thickness feels very high end and probably pay elsewhere 2 or 3 times the amount. If you're on the fence on this rug, I suggest you purchase before they run out of stock. I know I am very pleased that I purchase my size before they ran out.", 
    "I ordered one rug 5x8 for my living room, liked it so well I ordered a second one. I have dark walnut floors and gray sofas and chairs with yellow accents. I read some reviews that said the rug was blue but I took a chance and ordered it anyway so glad I did, it is a beautifull dark gray with silver mixed in looks really good with my silver lamps.", 
    "Very plush shag yet durable. Nice quality backing and finished edges so it appears it will hold up well in higher traffic areas. Great contemporary steel color,", 
    "We are very happy with this beautiful rug. It is definitely dark, which we wanted. The only thing is that it isn't a true 8x10. It is more like 7'9\" x 9'10\". The rug pad we purchased is exactly 8 x 10 and needs to be trimmed to lie under the rug without being seen. Overall, great product.", 
    "I really like this rug. It is comfortable to sit on and also feels very great to the touch.", 
    "unless you want a blue grey rug I suggest you look at other rugs. I wanted to order exactly what was described on the website.. a dark grey rug. I ended up getting a very blue, silvery grey rug. The cost of shipping it back to overstock doesn't monetarily make sense. I guess its the price you pay for buying things online:(", 
    "I just received the rug, and I really want to love it- if the wrinkles come out of it I will! I got the 8x10 and it has what seem to be severe wrinkles running the width of it, they are very noticeable to the eye and when you walk on it it feels like you could trip. I googled \"wrinkles in my new rug\" and from what I can find online this phenomenon is common to new rugs and should subside in a few weeks if the rug is of good quality. Fingers crossed. The good news is that it DOES seem to be a great quality rug. It is thick and heavy. I bought a thick rug pad with it that I am returning- it does not need it, it is soft and cushy and thick on it's own (though I might get a thin non-skid pad instead). Great pile height. The shade of grey is perfect for me. It is not blue, but dark cool grey. The weave has some light grey mixed in for sort of a heather effect. You can't see it unless you are up close, but it adds depth to the color and I like it. No weird odors, kind of just smells faintly like \"new carpet smell\". This was a great bargain too. I did my research online and looked at similar rugs at the big stores. No one had a deal this good for this quality, not even Ikea. **I will update about the wrinkles and give 5 stars if they come out!!!**", 
    "This rug is gorgeous! Very plush, soft and well made. Others have stated that is had a blue tinge - while that is true to some regard, I do not think it is overwhelming. It is darker than pictured. Works extremely well in the space that I bought it for. I am very satisfied!", 
    "This is a great area rug and so much more opulent than the price would indicate. The lush dense shag looks and feels very inviting. It was well packed for shipment and relaxed its \"carpet curl\" within a day. It is a little difficult to vacuum; you have to strong-arm it, but it wasn't as difficult as I thought it would be. It is well worth the effort, though. My living room is done in camels and this gray rug really dials up the sophistication of the room. I am going to buy another for our master bedroom. Great quality!", 
    "Love this rug. Great quality, would buy this brand again.", 
    "This rug is beautiful and plush. The color is beautiful and it fits perfectly into our newly decorated bedroom. I would highly recommend this comfy, cushy rug!", 
    "Love this rug. Will be ordering a second. Love this rug. Will be ordering a second.", 
    "This rug was a very good surprise and a good buy! Very soft fairly long plush non shed shag. Excellent buy overall. i do recommend a rug pad if you have nice wood floors to prevent scratching from the woven bottom.", 
    "We purchased the 8 x 10 size which fits very well in our living room. We are very pleased with delivery and the quality of this shag rug..", 
    "Love, love, love this rug! It has a very rich look and is soft to the touch. We never know what we're really going to get when buying online....and I admit to being a little nervous.....but I was familiar with the brand and was hoping for the best....after....the price was great! And to my delight.....this rug is gorgeous!", 
    "I love this rug. Was very happy with the color when it was received since I was trying to match it to another carpet. We first purchased another Overstock rug- the Homespun Chevron rug in the cream/charcoal color way and was trying to coordinate with that one. The other reviews that mentioned a slightly blue hue are correct (that's what I was banking on!) but I dont think if you weren't looking for blue you'd see it necessarily. It is a dark charcoal almost slate grey. The fibers are two tone, darker and lighter silvery but it creates so much texture and variety in the overall look. It is just fluffy enough that it's comfortable to sit on over our wood floors, but not too fluffy that it gets things buried in it. I have two labradors and was worried about the amount of hair that would get matted in a shag rug, but this one I can still vacuum just changing my vacuum setting and it cleans up great. The backing is very nicely made and I think it will last for a long time. Mine came rolled up (not folded like some other reviewers mentioned) and it did not stink very much at all after I Febreezed and vacuumed it right away. Very little shedding too. We've had it for a month now and are very happy with the purchase. A super rug for the price considering how expensive large 8x10 size rugs can be elsewhere.", 
    "I love this carpet. It looks so good in the family room downstairs. The walls are light gray and the sofa is medium gray and the rug color is interesting in its mix of grays. It looks perfect in the gray, white, black and red color scheme. It is soft and fluffy and looks well made. My cats love it to cuddle on. I am very pleased.", 
    "Very pleased with the product and how it was delivered. Loved the fact that is matched my room. The quality of the rug was great so soft.", 
    "I'm very happy with my choice of this Safavieh Solid Dark Grey Shag Rug. The rug is truly cozy and soft and feels wonderful under my bare feet. I'm using the rug on my hardwood floor in my guest room, which is decorated in white, light grey, periwinkle blue and a small amount of dark grey. It makes the small amount of dark grey in the bedspread and decorations pop out nicely. I also like the bit of shimmer to the grey color when you move the pile back and forth with your hand/foot. The color is a true dark grey, not an extrememly dark slate color. If this is the color you're looking for in a soft, cozy shag rug....buy it. You won't be dissapointed.", 
    "After reading the other comments that this is blue I hesitated to order, but I did. I love the rug. It is definitely not blue. It is a cool grey, not a warm grey, if you understand that.", 
    "I am so thrilled with this rug. I was very hesitant to buy a rug without seeing it in person but I am so so glad I did. I bought two of these, one large and one smaller round and both are just wonderful. The color is spot on as described, the rug is plush. I have not had any shedding and the folds from shipping flattened out very quickly. I have a baby on the way in 6 weeks and I feel comfortable he will be able to lay and learn to scoot around on these rugs. I really can't say enough good things. Not to mention super fast shipping. I ordered late Friday and received the rug the following Thursday. This is my first Overstock purchase but will certainly not be my last!", 
    "Thick cushy entryway rug; doesn't show tread marks", 
    "i love this rug and i recommend it to my friends to purchase", 
    "This is a very nice rug, and it arrived very quickly. However, after unrolling it, I noticed that it has a blue tint to it. I have grey decorations and furniture in the room with the rug and that makes its blue tint stand out even more. If it weren't such a hassle to return, I would. Maybe I still will ... It was hard enough to get out of packaging I cannot imagine reshipping it. Everything else is great. I knew I was taking a risk with ordering a carpet online.", 
    "The color of this rug is a darker gray than what I was wanting or expecting. It has more colors in it than just all gray it is dark gray, light gray shag almost. I was looking for an all light gray more plush looking rug, but I will keep it. The price was good. The quality is good. The colors just don't quite work.", 
    "Was looking for a gray shag rug for my sons room, found this one and it is perfect! Color is exact, comfort perfect and the price, you can't beat it!! Overstock has not disappointed me yet, and I have made a few purchases, all excellent!!", 
    "This is a very luxurius rug and I love it! I would buy it again.", 
    "It was just what I was loocking for, thanks Overstock.com", 
    "Great rug, thick and nice to lay on. Dog and child love it too.", 
    "BEAUTIFUL RUG. TOOK SOME TIME TO IRON OUT THE FOLDS, BUT NOW IT LOOKS BEAUTIFUL", 
    "This is a beautiful rug. I was hoping it would be as it cost more than many others I was looking at, but totally worth the price.", 
    "Great color compliments the blue on the walls.", 
    "Nice and soft. .perfect for my bathroom without having the regular ole usual bathroom rugs", 
    "I adore this rug and the color is so beautiful! I had to order more.", 
    "Not really dark gray. More blue than gray. But plush.", 
    "This rug is fantastic for the price. It's very plush and comfortable on the feet. I have not experienced any shedding. The rug came rolled and not folded like some of the complaints. The color is pretty spot on to the photos shown. It does have a hint of blue but only in certain light. That doesn't bother me though.", 
    "Not bad for the price the ends curl up. Very pretty color and besides the ends I would recommend.", 
    "Hard to buy a rug without actually seeing/feeling it. Going mostly from reviews we took a chance. I couldn't have picked a better rug. Every time I walk on it I smile! It's very pretty and very soft!", 
    "This rug is beautiful in color. Very true to pic. The pile is nice and tjick. Excellent quality and looks great. I am extremely pleased with this pirchase. I highly recommend this rug.", 
    "I bought this rug for my sons bedroom. I was very pleased when it came. The rug is the perfect size and so comfy. I'm going to buy another one for my living room", 
    "Absolutely gorgeous rug. Added instant warmth and class to my bedroom. Super cozy on the feet and just the right amount of shag. A tad bit darker than how it appears on my browser, which is actually what I was hoping for.", 
    "We bought two of these rugs for our guest room and living room, and we love them both. Please note that there is a strong chemical smell when they are unpacked, and I recommend a thorough vacuuming before you touch any skin to it.", 
    "Today, 03/22/16, I received the rug I ordered. I read the reviews, was concerned about the color as well and I can tell you that I can see why some will see blue in it...it all has to do with what colors are bouncing off of it and the light of day vs lamp light at night. I have bought several rugs from overstock.com and this is, by far, the best one. I have had some \"disappointment in quality\" rugs/carpets from overstock because buying from a picture does not always work out well and I have had to send them back. The prices kept me from not totally giving up on overstock.com and finally, today, a total win! This is a beautiful rug, very rich looking, thick and comfy under the feet. My dad taught me that age old trick to inspecting carpet for quality pile....bend it back....how much of the \"scalp\" can you see? This passed that test because it was so dense!!!! It is in a room with grey and white walls with midnight blue (IKEA) dressers and it looks outstanding and yes, it looks grey. The rug I bought was 9.6 feet x 13 feet and all the folds came out, no problem. The only negative? It was heavy as hell to carry up a flight of stairs, but my husband and I managed....and our marriage survived that Herculean task!", 
    "This is the softest rug and a perfect addition to our little boys nursery.", 
    "Really nice rug, makes our living room look amazing.", 
    "I love my new rug and am totally satisfied with my purchase. It's thick and lays down so beautifully and the color is smoky gray and matches perfectly with my decor. I am a very happy customer of overstock.com!", 
    "Nice rug, just what I wanted. Dark gray with some silverish to it. It's a great quality rug for the price (in my opinion and limited experience with area rugs). The back is a bit rough so I would put a pad down under so it doesn't scratch up the floor over time, and to keep it in place.", 
    "We purchased this rug for our 3 year old daughters room as we moved into our new home. Its really soft and nice to sit / play on. I think we would've preferred it a slightly lighter shad of gray as this is very dark. However it looks really nice, lays flat and very comfortable for kids / adults to sit on.", 
    "Love this carpet .. So thick & soft", 
    "This rug did not disappoint. It's so soft and so incredibly plush, I love walking on it. The color is exactly like the picture too. I'm extremely happy with my purchase.", 
    "Great fit even in a smaller bedroom under the bed! If you have a larger bedroom or are using it for the living room be sure to go for a bigger size", 
    "It is nice and soft to step on. Bigger than I thought it would be.", 
    "Love this rug. It is a little darker than I anticipated, but I still love it. There is almost a tinge of purple or blue, at least in our room with our lighting. I would highly recommend it.", 
    "Really plush and soft, no shedding. Would definitely buy again.", 
    "This is definitely more bluer than expected. Great quality, but not as great as expected.", 
    "This rug is so soft and huge for a great price! The color was correct to picture. No complaints", 
    "we are impressed by the quality of material/product compared to price with this rug.", 
    "This is a gorgeous rug. It feels absolutely wonderful. I was a bit nervous, how can I get such a great deal on such a rug. Well I did. It goes well with the furniture. The only downfall was that it was a bit darker than I expected, BUT it's still a winner.", 
    "The color is gorgeous (exactly like the picture). Nice and thick rug! I have it at a beach rental condo that gets a lot of traffic and it is still super fluffy, after 2 years of use.", 
    "This is a great rug. Much thicker than I thought it would be. Great quality.", 
    "This rug is beautiful and so plush! I can't wait to wake up and put my feet on this rug!", 
    "This carpet is perfect for the area that it covers, it looks great and it creates a very comfortable area for small children to play for those who have wood floors.", 
    "I bought this rug in gray to bring together the bolder colors I am using in my living room. It is a charcoal gray, which is what I wanted. The real treat is walking on it -- it is so soft! Great foot feel! I have also been pleased with quality. After several vacuum cleanings, there has not been any pulled out weaving. Great choice.", 
    "I was worried about the thickness and feel when I purchased this carpet but when I unrolled it all worries went away. This is a very thick shag carpet. The feel is luxurious, it was square cut on corners and backing is heavy duty jute. It was delivered Ina rain storm and when I saw it leaning against my house, I was worried about dampness. However, it was thoroughly wrapped in plastic and was dry as could be. I would buy another of these. My daughter came over and took her shoes off and immediately asked where I got it. Good recommendation.", 
    "Love rhis rug. It's a great value for the price", 
    "This rug was purchased for a college dorm room it was purchased in grey. The quality is very good , the kids love it!", 
    "Love the look and feel of this rug. Fits perfectly in our all seasons room. Instantly changed the ambiance of the room, very homey feel. We have recieved many compliments.", 
    "Love the fullness- great, comfy rug", 
    "Great value, really soft and fluffy and comfortable under your get when paired with a good rug pad. Using it in our upstairs playroom wither hardwood floors.", 
    "color looks blue and not grey", 
    "Fit perfect in the spare bedroom. Feels Great.", 
    "The pile on this rug is very deep. This makes it a little tough to vacuum, but so far I've not had any problems keeping it clean. That could be an issue for high traffic areas or people with pets, I suppose. It looks really nice and seems well made. I have it in the living room and get compliments from my guests on it all the time. It really is cozy and feels great on cold winter days.", 
    "Very plush and feels great under my feet. Every person that has seen it has complimented. Even my husband says it was worth every penny!", 
    "Awesome rug, exactly what I wanted. Some others said it was blue, but mine-not at all. It really is perfect, thinking of getting a runner and maybe another the same size.", 
    "Very soft and plush, good quality", 
    "The rug looks blue! Ruins my decor. Very disappointing seeing that I watch this rug for weeks and it was blue. The picture is very deceiving.", 
    "Good quality rug, very happy with it. It's a darker gray put not too dark, more like a pewter.", 
    "Much nicer than I anticipated. Good quality", 
    "This is a good purchase. This rug is so thick and plush. The gray color looks better in person..The light strands of gray make the rug shimmer. The seems very sturdy, there were no strands of rug fibers in the packaging, which is sometimes a dead give-away that a rug is poorly constructed, and will lead to fibers falling out over time. I feel this rug will last a life-time.", 
    "Love the color and the feel to this rug, great purchase.", 
    "I love this rug- we actually ordered 3 of them, in two different colors so I am going to post the same review for each. They are heavy duty enough so they don't slide around a lot... but I am sure most will put a pad under it (and we did too after a bit). They are so soft, and thick. It's like you could sleep on it! I have not tried vacuuming it yet but I really love it!!!", 
    "The pile on this area rug is very nice and deep and feels great between the toes. Worth the money.", 
    "The rug is really dark grey with blue hues. It is too dark for my room. More disappointed that I have to pay for the return - will have to think really hard before I order another item from Overstock.", 
    "great rug, thick and soft. I got the gray and it is a pretty dark gray.", 
    "This product is very good quality and so plush!", 
    "Very nice rug. Color matched website. It came folded but within days, rug lays flat. Soft and the entire family loves it. No odor other than new rug smell.", 
    "I placed this in front of my very modern free standing slipper tub.It's plush, it's comfy to step onto to and the quality seems excellent", 
    "Plush.. Have returned for another!", 
    "Love it goes perfect in my dining room. Color is great", 
    "Great quality, super plush, soft and beautiful! This carpet just made my living room look so much better. I feel like an adult. ;)", 
    "Thick and soft. Very nice.", 
    "It is a beautiful rug! Mine came rolled, so I did not have any creases. The color is gorgeous and looks more expensive than it costs. I have received so many compliments on it. Everyone loves to walk on it or lay on it, and I mean everyone. My dogs can't get enough of it. So far, it doesn't fray easily either. I'm SO happy with my purchase!", 
    "First off, this rug is very soft and the pile is nice and high. My dog lays on these rugs more than she does on her bed. However, you should be aware that there is a blue hue to the rug. Its not enough for me to send the rug back, but I do wish it was a more true grey like in the picture.", 
    "Like the thickness, good quality", 
    "Great rug, does not shed, color better in person and very comfortable.", 
    "Needed something comfortable underfoot, under the bed in master bedroom. Very attractive and soft. Looks great. I have spilled coffee and tea on my side of the bed on this rug with no visible ill effects.", 
    "Other reviews had me thinking it would not be as plush as it is. I was expecting to need a cushion/pad underneath it. I've only vacuumed it once but doesn't seem like it will shed much.", 
    "Fuzzy, warm and comfortable. What else would you want from a rug?", 
    "This is a great rug and a value for the price. Love it!!!", 
    "Just wonderful. Soft, easy to clean....nice grey color.", 
    "This run is thick and exactly what I was looking for. The color is so rich - it is so pretty. It does have a distinct odor and I hope will dissipate soon, as I am not sure how to get the smell out except perhaps leave it in the sun outside for a day or two.", 
    "Love this rug! True color and quality. Love it.", 
    "What a deal! Very pleased with the quality. The carpet we received didnt have any smell reported by others.", 
    "At first I wasn't sure if I would like the rug but I needed a new one in the family room and this time I wanted a softer plusher rug so I decided to order this particular rug. I do love the plushness of it under foot it did NOT have any weird odors like some others have said what I did notice was an oily residue on it while I was positioning it under my sofa not to mention I could feel it on my socks as I walked on it. I didn't do the review right away because I was waiting to see if the oily residue would go away and within a few days it did. As far as vacuuming it that is another story since the rug is so plush, if you have a real powerful vacuum (a dyson) as I do it is difficult to vacuum I can't use the upright dyson I have, I have to use my dyson canister vacuum to vacuum rug but if I'm not careful it stops the vacuum so I'll be the only person able to vacuum this rug because my hubby and kids wouldn't take the care I would. But overall I love this rug it just took a little time decade I was used to having a patterned rug in family room but now I absolutely love it so does my husband and I thought he'd hate it due to the fact it's so plush to him that usually means girly", 
    "It's a nice tough, but the color doesn't seem to be as it appears in the website pictures. To me it has more of a bluish tint. I wish it looked more charcoal, like the pictures.", 
    "looks great in my sun room done in yellow and grays", 
    "I love this rug, the color is the perfect gray and is a great addition to our living room. The shag looks and feels very soft and comfortable, I often lay on it instead of the couch! I was a little afraid with a shag that my dog's nails would get caught in it but they don't at all and he loves laying on it. Well worth the money!", 
    "You can compare this rug to what you can get in IKEA. But this is cheaper and looks like it is made of better materials. The backing is not non skid, so you need to buy a non skid backing separately. I have had this down for about 3 months, and I like it.", 
    "so I don't usually write comments, but I do love reading them, so I figured it was my turn.after reading mostly great reviews, I decided to purchase this rug. lets start with the color. its a mix of dark and light gray, meaning that for every 10 strands of dark gray yarn, there is 1 light gray giving it a kind of marbled effect. next is the smell that a few people have mentioned. I would say that the smell I encountered was the chemical smell that new wall to wall carpet has. the smell has dissipated after a couple hours. now for the rug itself. it has more of a look of wall to wall shag carpet then an area rug. there is a synthetic sheen to it which kind of disappointed me. the shag is somewhat close together, so there aren't big gaps of space , which is good. I'm using it in my sons gaming area, so I'm sure there will be spillsI think I'll keep it only because the size I chose is perfect and I'm sure returning it would cost too much.", 
    "I've had this rug for about 3 weeks now; and love it! It's very soft, my 7 month old and two dogs love it. The color is dark grey! Not sure why people were saying blue. To me and everyone that comes over to my house it's grey. I would totally recommend it! Only issue I have is its a work out to vacuum. Other than that it's great!", 
    "Beautiful rug, very thick and cozy.", 
    "So, first I will say that this is an amazing rug at a great price. It is a soft and thick pile and feels so good to walk on. It FEELS expensive. I didn't notice any sort of smell when we opened it, other than just a slight rug-y smell. It went away within the day. I purchased the 10x13 rug, so it was folded when it arrived. The fold lines went away quickly after we put it down and walked around on it for a couple days. Honestly, this rug was so great, that I bought another one in a different color for another room. It DOES have a blue hue to it. I have held off writing this for a few weeks, so I could really see it in all lights because the opinions on the \"blue issue\" have been all over the place and I wanted to give the most accurate description that I could. My walls are a medium taupe color, the couches are a sage green color and tables are dark brown wood. The room this is in gets a decent amount of natural light with the blinds open, and all non-natural lighting is from various lamps and one wall light that shines down on this at an angle (so not from the ceiling). I notice the blue tint more at night and when the blinds are closed. The light bulbs that I have currently are a warm tone, and I think that changing to a cool tone will make a difference in how much blue I notice when they are on. That said, the blueish hue does not really bother me, I have gotten used to it, but is definitely there. The lighting of the room does make a difference, so if this is going to go someplace that sees a lot of natural light then you won't see it so much, but if it is going in room that requires lamps, be aware the blue will be noticeable.", 
    "Flattened out in a couple days. Looks great in my son's nursery. Great quality for the price.", 
    "Material is awesome and comfty", 
    "Fast shipping and such a great buy. Thick and lush.", 
    "Color was really dark more charcoal with a lot of black, really disappointed.", 
    "The material feels like rope, so unless I was shipped a different carpet. this rug felt like plastic rope, not soft or plush at all, the 1 star is for the picture, as the picture is the right color.", 
    "The rug is soft and comfortable, but I'm returning it. Like previous reviews have said, it's much darker than the picture. They really should retake the picture so that the rug actually matches the dark grey description. That's why I gave it a 3-star rating.", 
    "Plush dark gray rug I used in my bathroom. Vacuumes well and feels great on the feet!", 
    "Love it, it feels really nice to walk on", 
    "Love the color and the thickness of the carpet. It doesn't shed at all.", 
    "Based on others reviews, packaging depends on the size you choose. i choose the 4x6 and it came rolled, as it would've if you went into the store and purchased it. It is true to size and very sturdy. there was a slight smell upon the removal of packaging but nothing excessive or even to complain about. This is a rug more so on the cooler side of dark grey with a touch of silver, great if you have like a light grey silvery type theme, not so much if your going for the modern/ tan-ish theme.", 
    "Lovely and soft rug for our living room. Perfect underfoot by the sofa, and perfect for our kids to sit and play on.", 
    "The color is as described, but it is not as plush as it appears.", 
    "I ordered four of these carpets in different sizes, and just love them! They have a very nice backing, are a nice plush shag, and the color is beautiful! They look very nice on both hard wood and carpet. Wish I had a use for more!", 
    "So comfortable on the feet. Nice material.", 
    "Perfect choice for the bedroom.", 
    "Love, love, love this rug....", 
    "Perfect color and very soft. Love it!", 
    "I ordered this item because of its color. After looking for a few months, I decided on the dark gray as it fit well in the space. It is actually blue. Completely different than advertised/described. I would not have purchased this color.", 
    "I love it! It's cozy and the perfect shade of charcoal grey!", 
    "All I can say is LOVE LOVE LOVE it !! Better then I had hope it would be. Came right on time,If you order one you will not be sorry,very thick and soft.I would order another one.", 
    "my rugs arrived well packaged in good time. they match in color and are of a nice quality. they are true to size . I've been shopping for rugs for awhile and simply didn't want to spend what they typically cost at full price in the stores. I budgeted a certain amount and had to exceed it by a small amount as a compromise but am pleased with the product and customer service.", 
    "This rug feels like a cloud under your feet! I bought the Mohawk Home supreme felted dual surface ru pad to put under it and it all works together wonderfully in my space!", 
    "Nice rug, the color is perfect!", 
    "Looks better than it feels, but a pretty good value for us.", 
    "Great feeling on your bare feet, very easy on the eye its stunning", 
    "Wonderful, Beautiful, Cozy!!!!! Everything I expected ad more!! Easy to order and prompt delivery!!! Love it!!!!!", 
    "We accidentally bought this rug and were disappointed because we thought we were getting the same quality and feel as the Silken Paris Shag rug. It is not. This one feels much more like the shag rugs I grew up with in the 1970s and the quality doesn't seem as nice as the Paris shag.", 
    "Looks great! Very plush and looks really good with red accents in the room.", 
    "This rug is beautiful. very soft, very happy with it.", 
    "This rug is ABSOLUTELY wonderfulSo plush so soft! A rich pewter color. This rug has surpassed my expectations, my livingroom is now warm and cozy.And the quality is super! Thanks to my friends who reccomended overstock.com😊", 
    "Excellent quality, very thick and no pad needed.", 
    "cheaply made and not the same size (bought two). I had bought a couple runners from OS and loved them. These not so much.", 
    "Very thick and great color. I bought one for the great room and one for the foyer. I am a thinking about purchasing another one for the dining room. The 3x5 tends to slide so I will need to put a pad under it. I would highly recommend this rug.", 
    "This rug is fantastic. Lots of depth to the color.", 
    "This rug is super soft. I was skeptical at first but gave it a try after reading the reviews. This rug adds a cozy look and feel to a my laminate floor. It feels great.", 
    "My husband and I love this rug", 
    "The carpet is thick and cozy feeling and goes well in my sun room. This is truly a wonderful carpet.", 
    "This rug does not lay flat and rolls up at both ends.", 
    "Great color, nice texture, seems well-made.", 
    "I was hesitant to order a rug online, because I love soft things, which of course is very difficult to tell when you don't feel the product before you buy. However, the high reviews on this rug convinced me. When we got the rug, I was pleased with the color: a mix of different shades of silver/grey, which beautifully complemented my furniture, and better than the look I was hoping for. The texture is soft, but not as soft as a fuzzy blanket, more like a soft mop texture. The rug is definitely plush & thick to your feet & cushions baby falls well. My mom has been looking for a rug for a year, and after trying mine, she was ready to buy in a different color. Lol it passed her \"butt test\", meaning that her behind did not go numb after sitting on it for a while. Overstock was also having a great sale, so I certainly paid a great price compared to what I've seen in brick & mortar & other online stores. Hope you have found this review helpful!", 
    "feels nice on the toes..............................", 
    "I've got to get more!!! I have love it.", 
    "I love this rug. It's soft on your feet, thick and well made, and it's really good looking. It's a nice neutral dark gray, goes with everything but doesn't show anything. This was a terrific purchase for the money.", 
    "It's the perfect neutral color and very cozy. My cat's new favorite place to sprawl out. Pretty easy to vaccum with the high pile setting.", 
    "Wonderful carpet, the colour was better then I thought, has not come apart and the shag is great! Would buy another if needed", 
    "Exceeded expectations. Needs to have a fan blasted on it for a few days with windows open to get rid of chemical fumes. Typical when getting a new rug. It goes away.", 
    "Got this rug when designing our nursery almost two years ago. Since day one, it's been very soft and durable surviving a newborn, two dogs and a move! We still use it in our girl's bedroom who is now fourteen months old.", 
    "I got this rug on sale and it was substantially less than most others of the same style and because of this, I was worried. After receiving the rug and having a few weeks to see it in my apartment, I absolutely love it. For the money, it is undoubtably 5 star. Exactly sad it looks in the picture and incredible comfortable on your feet", 
    "Love this rug. It's perfect in my room!!", 
    "Beautiful and plush.. Just what I wanted and expected. It fit perfectly in my home office.", 
    "Been looking for a decently priced shag rug for the longest and i love this rug!", 
    "This is a very thick, soft rug. Was even bigger than the stated dimension. Nice soft gray color exactly as pictured. Arrived very quickly.", 
    "The rug was a shade or two darker than how it looked on my computer, but i wouldn't call the difference significant. It's soft, fluffy, and thick. The quality seems top notch for the price, and it was delivered extremely fast. There was a chemical smell during the first few hours after I unpackaged it. I have a 800 sqft loft; the smell dissipated quickly and wasn't really overwhelming. Solid buy.", 
    "It is smaller than pictured. Be sure you measure first so you can seebhow much space it actually takes up.It is darker as well. Soft and easy to vaccum.", 
    "I have this rug in my dining room and it is very plush. Goes well with my decor as gray is the new beige and matches EVERYTHING! Highly recommend!", 
    "The rug is soft and luxurious, very pretty silver color.", 
    "Great purchase. Thick, soft and comfy on your feet. Color is true to advertisement.", 
    "Great purchase. Good quality", 
    "Perfect fit and exactly as described. Great quality and price.", 
    "This rug came fast and it is beautiful. It's a bit darker in person then in this image, but it's really rich looking and vacuums beautifully. I have had no shedding and no smell", 
    "I love this rug, it is beautiful and is soft and durable.", 
    "Heavy and thick weave and very soft", 
    "just got my rug and cant say enough about it. super soft. color just as described . you wont go wrong buying this rug. .going to buy another in different color for bedroom", 
    "I have been looking for a rug for my living room for months. I needed an extra large rug that other home goods stores didn't offer and/or were priced super high. This rug is reasonably priced and a perfect addition to my living room! I'm planning on ordering more!!", 
    "This is the second Safavieh rug we have purchased from Overstock.com. The rug arrived early, and rolled out/flattened nicely. Highly recommended, super soft rug!", 
    "Very snug rug. Worth the money!!", 
    "AWESOME QUALITY AND LOOKS PERFECT", 
    "I love everything about this rug - EXCEPT THE COLOR! It is not a dark grey. Closer to black with grey mix. I hope Overstock accepts returns or we are stuck with a rug I absolutely do not like.", 
    "Using it in my closet. Love the feel under my feel while I getting dressed.", 
    "This is the forth rug like this I purchased! They are a great rug for the price. Soft on the feet, easy to vacuum and always look great. The dark grey is beautiful. Nice foundation to my master bedroom!!!", 
    "Very nice color, texture, and comfort. Vacuums nicely, would defintely buy this brand again. I have received many complements from family and friends.", 
    "WOW what a nice rug, looks georgeous.", 
    "Great \"cozy\" rug. This rug is grey as shown, not blue at all.", 
    "We get compliments on the rug everytime someone new comes over, it's super soft and very durable.", 
    "I use this rug at the foot of my bed as an accent rug and I love it.", 
    "Exact description. Would recommend this.", 
    "Nice rug........ wasn't as soft as I expected.", 
    "I was nervous about buying a rug online, but just received this and it is beautiful! It has light and dark gray shags stands in it which gives it more depth. The thick shag is very soft to walk on.", 
    "Great quality, little more of a dark blue tint but I LOVE IT", 
    "I have purchased several Safavieh products from Overstock.Products arrived in timely manner appropriately packaged. Both rugs are true to color and compliment my bedroom décor. Highly recommend this product. Overstock never disappoints!", 
    "Edges were finished poorly. Color is much darker than pictured.", 
    "The shag on this rug feels fantastic underfoot and it's clearly made very well. So much so that after only a few months, I'm buying another one for another room in my house. Couldn't recommend enough (and a GREAT price through OS)!", 
    "I read the reviews on this and for the most part they were pretty positive. In fact the only downside I think was some of the rugs seemed to be seconds. But I decided I'd take a chance because it was just what l wanted. It was delivered in a few days. But unfortunately It was not perfect. You could see where it was spliced together. But the upside is that Overstock sent me a replacement in less than a week!!! If there hadn't been a problem I would have given 5 stars for sure. I just love my new rug and you can't beat the price.", 
    "Overall I really like this rug!! My only \"complaint\" is that it isn't as soft as I hoped it would be, it's definitely got the thickness I was hoping (its definitely not a thin rug) but the texture is a little rougher than I thought - but I did just get it yesterday and it was sitting out in the cold for awhile, so maybe it'll soften as it settles. Also, it definitely needs something under it to hold it in place - we have wood floors and it slides all over - but all in all, I love it! The color is a deep shade - it kind of seems like it has a little blue tone to it, but it's perfect for what I needed it for :)", 
    "It is always a bit dicey ordering a big item online. This rug had great reviews and one of the bad reviews said it had a silvery sheen to it. It is a dark grey, between medium and charcoal. Perfect. That was a plus for me. The rug is gorgeous, plush and perfect for my space.", 
    "Plush and nice color. Perfect for a bed-side rug when you have hard-wood floors.", 
    "Very pretty and love this rug", 
    "Great Product - SOFT and worked well in the Master Bedroom", 
    "This rug is extra thick, and super soft. Hard to vacuum because it is so thick, but totally worth it! Great rug, excellent price! Just like the picture.", 
    "Beautiful and comfortable I have a one year old boy who loves to toss and turn, which can lead to him to fall but with this carpet has made a huge difference now he can toss himself and get up and not a single tear or cry. Its so fluffy it breaks his fall. I love it this is one of the main reason we decided to make this purchase.", 
    "I purchased this rug for my dining room and am very pleased. The color is true to the picture. The shag almost has a shiny sheen to it. It's very flush and nice to walk on. It's difficult to vacuum, but possible if you are very careful. Great rug for the price!", 
    "The price wasn't good enough for the rug to be so unattractive.", 
    "Rug came quickly and was very nice, however it looked more blue then the grey it shows in the picture so it didn't go with our decor and we returned it. These sites should work on their colors as there are many variations between the websites we've searched on.", 
    "Great quality and very nice. My only complaint is that the color is a bit different. It has a blue hue, or least it seems like it. Still a great buy.", 
    "Reminds me of the 60's shag rage. Feels great underfoot.", 
    "Very nice rug. Lays down well", 
    "Great grey color, soft, warm, & cozy. A little new odor but only lasted a couple weeks. Air filters helped. Purchased in the winter & couldn't open windows. Very pleased.", 
    "Nice quality rug, accented my grey futon beautifully.", 
    "Quality product, great price.", 
    "We love this rug. It's soft stylish and the perfect size for our living room. We purchased a 1/2'' all natural rug pad to put under it which makes it all the more plush. 5stars!", 
    "The rug was as expected, nothing amazing, just average", 
    "This is the 2nd of this rug that I have purchased. The first one my dog got sick on so I had to throw it out but I loved it so much I just reordered the same one. Very good quality.", 
    "Very nice quality at a good price.Deep gray color, thick,feels wonderful with a pad under it. I plan to purchase this rug again in a different color for another room!", 
    "As many, when buying something online I go through the bad reviews before deciding if I should purchase. So although I had minor concerns from this, I am ultimately thrilled with this purchase!! This rug is gorgeous. It's so soft & the pile is perfect. Beautiful variances of dark grey & silver. There is a very faint \"new carpet\" smell, which is to be expected. Not a strong chemical smell that others have experienced. Very happy with this purchase.", 
    "I think it looks great! to me it looks grey and not bluish. It does not shed at all and keeps its fluffiness after vacuuming it. I do recommend cleaning it/vacuuming it once a week to keep the fibers soft and fluffy.", 
    "Fiber quality is good, nice and comfortable, dogs love it.", 
    "The rug is exactly as pictured. After I purchase I found the same type of rug and color at another (retail) store for half of the price.", 
    "Looks better in photo. Looks like nylon", 
    "beautiful rug . . . bought grey for my pink and white bathroom . . . folks always comment on how beautiful it is", 
    "Nice color, good quality, no shedding. But, not as soft as I would like it to be", 
    "This rug is awesome - soft and plush and the color is beautiful. I want to find a place to put another one in my house.", 
    "Beautiful color...excellent quality.", 
    "Quick delivery arrived within a few days after order was placed. Very nice rug.", 
    "The color is very dark gray which is great for hiding the dirt, but best of all it is super cozy and soft. We bought for our daughter's room and she loves how it feels on her feet.", 
    "This rug exceeded my expectations. Very soft, beautiful color and high quality. Definitely recommend.", 
    "its a great rug , it looks great feels great, love it!", 
    "Very thick shag rug. Was exactly as pictured.", 
    "great purchase for the price, look just as the picture", 
    "Really nice rug. I have seen the same one for twice the amount. It has a very high end looks and feels really soft to the touch.", 
    "Received my rug very quickly...was wrapped in a cylinder so no creases. After reading a few reviews that said there were chemical fumes...that was my greatest concern. To my great relief the rug had an extremely faint chemical odor that dissipated within a few days. Color is a deep pewter grey and the shag is nice though not super dense. I will probably purchase another one of these in another shade for my kids playroom.", 
    "It's hard to buy something like a rug when you haven't seen it in person, but I went out on a limb with this, and I am SO glad I did! The quality is amazing, it's soft, lush, and looks like I spent twice what I did! The grey is a nice dark grey, but can look almost silvery depending on which way the shag is facing/brushed. I would recommend this to anyone!", 
    "Looks great in my living room.", 
    "I was pleasantly surprised at the quality and thickness. Assumed I'd need to vacuum the heck out of it before using but VERY little came up. Of course, it's brand new and hasn't seen much action yet, but I am getting one more in a different color.", 
    "We love this rug - it's exactly grey as described, it has a high pile and is perfect on our tile floors - it's comfortable and so fluffy that it doesn't hurt to lay on it (seeing as how the floors underneath are so hard!) we love it, and it is very easy to vacuum and clean - we've had no issues with it. It's such a great price considering the size - you can't get this price anywhere else! We don't have space for another big one, but eventually we'll get another for another tiled room we have in the house. LOVE IT :)", 
    "It is so hard purchasing rugs online. This rug is a very cool gray, no taupe in it like other gray rugs and not blue, but a true gray. Thick, nice quality.", 
    "Got this to replace a similar rug from Safavieh in white. The gray is perfect, modern and clean. Doesn't shed.", 
    "Excellent quality....love these rugs!", 
    "Great price on a fantastic rug! Rolled out perfectly, so soft and no odor. Really the most comfy soft rug and the gray color is fantastic!", 
    "I ordered several of the safavieh shag rugs from overstock. they are great quality, we really like them, you can buy area rugs elsewhere, not for this price or quality.", 
    "This rug looks great in my living room. The kids all like to sit on the floor because it is so soft. It didn't loose any fibers and still looks good after 3 months. My only complaint is that it is difficult to vacuum because you can only vacuum with the air on...no beater bars. The fibers are very long and they would get caught as well as ruin the texture. However, it's worth it for as much as everyone likes it! The color is beautiful.", 
    "Thick and luxurious and exactly what I expected!", 
    "You can't beat the Overstock's price for a really comfortable, good looking rug. Strongly recommend.", 
    "I love this rug!!!! It the perfect shade of gray (exactly as pictured) for our bedroom in which we have the Aurora home thermal curtains in gray also purchased on Overstock. The rug is so soft. It is thick and very well made. It makes the bedroom so nice and cozy. I am very happy with this purchase. I have not tired to vaccum it yet but I dont see a problems with that as long as I have it on high carpet setting.", 
    "I previously ordered a 5ft round for $160 from a competitors site, which was beautiful, thick and plush. I decided to take a chance at returning that one to downsize a foot for this 4ft round at only $60. The rug has no smell and is decently plush but not as soft as it looks. The edges are not perfectly round (as some other reviews have pointed out) and because of this, the value is not more than purchasing from my favorite local home store where the return process is less cumbersome. I will keep the rug as it's fine for my guest bedroom.", 
    "Couldn't be happier with this purchase. Needed a rug for under the bed to help keep the chill from the garage from leaking into our bedroom. Rug is plush and soft. Super comfortable to walk on barefoot. Color is nearly identical to the pictures. \"New rug smell\" dissipated after the first 24 hours. Received the rug in under 24 hours. Simply an amazing job by Overstock.", 
    "very good quality will buy again", 
    "It feels like high quality, very plush and deep. Color is true charcoal. It could appear different colored as some people mentioned but it might be due to the light bulbs they have in the area.", 
    "Holds up well, looks nice. We used this rug for our office and it has been fine thus far.", 
    "Lovely shade of gray. On the darker side of gray. Wears well. Vacuums easily. Very comfortable for bare feet. Would definitely recommend.", 
    "Love the rug. Nice quality and looks great in our family room.", 
    "Love this rug, the color is perfect, we have a black dog that sheds and you never see any of her hair. Soft and pile had stayed just as it was when we bought it. We have had it over a year.", 
    "Very plush rug. High quality, a very good deal for the price", 
    "Thick pile, more bluish gray,very plush", 
    "I think this is a great rug! It is a good grey for me. I might buy the matching runner because it is a great rug!!", 
    "Very plush, very soft, true to the color you see, and well worth the price!", 
    "It seems whenever I suggest something to a friend or family member, I have the worst luck. That being said, this was ordered for my sister and after seeing it, we are disappointed in the quality and some of the reviewers who stated it was soft and squishy under the feet. Not So! It is coarse and the tufts are bare, the edges very bare and unfinished looking - so light at the corners they turn up. Sending back.", 
    "I love this rug in gray. It is high quality, it laid flat after a few hours and looks great. I have it in my entryway. Just placed another order with Overstock for throw pillows and a ceiling light. Happy with all my purchases thus far.", 
    "I really liked the dark true grey color! It is a good quality too.", 
    "The color is as pictured and the rug is very comfortable to walk on. My dog (who is used to sleeping in a bed) has taken to lying on it if that's an indication of plushiness.", 
    "No pattern, just grey softness. Still trying to iron out one crease. I'd also recommend a non-slip rug underneath. Even the giant one I bought slips around a bit on our wood floors.", 
    "I love this area rug. It arrived fast! Looks beautiful. And does not smell. I hope it remains on the market for awhile, because I definitely would like to purchase another one!", 
    "Absolutely love this rug. Even though fedex delivered it to the wrong address and a friend and I had to carry it a couple blocks back to my apartment. Was mad it got delivered to the wrong address but happy the lady who lived there was nice enough to called me to let me know she had it.", 
    "This rug is so soft! We use it in the bedroom so our feet don't touch the cold wood floor in the morning and we love it! It's nice and thick and the color is very neutral.", 
    "Another winner from Overstock this is our second of this carpet love it..", 
    "I have had this rug for a while now and it is very soft and durable. It has held up through the rigors of two small children!!!", 
    "It was shipped quickly and is nicer than I expected. Very pleased with it. I may buy in other sizes for other rooms.", 
    "We love our new Safavieh Shag Rug....It is so soft and dense and is easy to vacuum and it does not pill.....we also bought a runner to match and a runner in a different color for our daughter who just moved close to us in North Carolina....Also our 7 year old granddaughter loves to lay on it and read her books.......", 
    "Can't bet better for this price and I love it", 
    "Plush, beautiful very nice quality.", 
    "This is such a tthick luxurious rug. I bought it in Ivory and I couldn't believe the quality when I unwrapped it. It exceeded my expectations.. I put it with my white couch and everyone comments on how beautiful my living room looks. You won't be disappointed.", 
    "Bluer than I imagined. But still worked in my space", 
    "Very high quality and the color is perfect.", 
    "Plush and comfortable to walk on or sit on. The long pile is difficult to vacume.", 
    "Love the look and feel matches another one I purchased a year ago perfectly.", 
    "Feels great and looks great!!", 
    "Perfect ! great for the price !", 
    "Looks a lot thicker and lighter in the photo. On the whole it is a nice rug but not really what I wanted", 
    "Well worth it for the money.", 
    "I can't say enough good things about Safavieh Rugs! They are priced right, look beautiful, and easy to clean...... overstock has me hooked on these rugs....... recommend highly - buy one and see for your self...", 
    "Feel and look great color stands out", 
    "This rug is durable and thick- great for the money", 
    "Very soft, Nice and thick.", 
    "Love the color, size and feel. Exactly what we were hoping for. Was a bit concerned about ordering it online but it worked out great!", 
    "This plush and perfectly colored rug was the perfect addition to our room! Just as described!! Perfect!", 
    "Thick, comfortable, cozy.", 
    "Just received this carpet. I got it in 8x10 and it looks great. Color is exactly as posted. I was afraid it was going to be to dark but it is perfect. The soft feeling you get when you walk on it is great. I also purchased the hard surface pad which also went down without a problem. It does not look solid in color which I also like. Really brings my room together. The weave is also very good. You don't see any spaces when you bend it. I have had other Safavieh rugs before. Never disappointed.", 
    "Love this rug, have it under my bed keeps my feet warm!!!!!!!!!", 
    "Rich color, heavy so there's no curled edges and vacuums up nicely", 
    "These rugs are waaaaay under reviewed / rated. I'm co poetry amazed. Bought a new house so needed new rugs and these are just stunning!!!", 
    "I purchased this rug to use under my small, glass top dining room table. The beauty of the rug definitely accented the table. The shag is thick in texture and the color is very deep and rich looking. I highly recommend this product.", 
    "This rug is beautiful and a great value. It is very well made and has a beautiful rich color. The only thing you need to be aware of is that in certain lighting it can almost look navy. But if there is a problem here, changing bedding color and curtains is worth it to solve this problem.", 
    "Soft and very pretty neutral", 
    "Great quality and worth the price. I had no issues with smell.. it's a rug. New rugs have a rug smell like when you first install in your house. It's minor. It's a little bit of a pain to get all the lumps out of but will eventually flatten. I would buy again!", 
    "It's a steel blue with gray undertone. It's pretty, but the picture doesn't capture the true blue tone you will see with this rug.", 
    "It is beautiful and filled my room. True to color. Very thigh and full . I just love it. It is more then I Expected", 
    "The rug doesn't exactly look like the picture. It's extremely dark in color in fact almost black. The loom is also not as it appears but for the price, it's ok.", 
    "Perfect for grounding and adding rich textural interest to our medium-sized room with gray/white walls and white furniture. Vacuums beautifully.", 
    "We love this rug! Its beautiful and soft on the feet, the color is true to the pictures here and of good quality. It arrived folded up with some creases in it but they soon flattened out after a few days. We would highly recommend this rug to all A+", 
    "The rug is very comfortable to stand on, but the backing is pretty rough. It definitely needs a rug pad underneath. The color is a bit darker than the picture shows. It is good for the price, but it's not high quality.", 
    "a little darker than in the photo, but its great.", 
    "Not as thick as I wanted, however it looks good for the price", 
    "So happy with my new rug. It's pretty and fits perfectly in my new living room. Perfect color and all. Two thumbs up. The only reason it didn't get 5 stars is because it was packed poorly and it took me a while to flatten out all the creases.", 
    "looks good, definitely want to sink your toes into this one", 
    "Beautiful rug, good quality and soft", 
    "The color is nothing like the picture. Instead of dark grey, it's more of a blue. It didnt match in the room I had intended to keep it in.", 
    "Shaggy and grey, squishy and soft, all around nifty rug", 
    "We've had this rug for a few years now and it's held up quite well.", 
    "Beautiful heather color, so soft on bare feet. My problem is with the backing. The rug slips and the edges needed to be taped down. I'm using the furniture as anchors so it works for me. The runner I bought to match is a problem with the slipping. If it wasn't so soft and matching, it would be going back.", 
    "The material is flawless and the color goes well with my tile floor The rug gives my room a warm and cozy feel.", 
    "Beautiful color! Deep shag, which we do have difficulty thoroughly vacuuming even with vac on highest setting for plush carpeting.", 
    "I was concerned about blue undertones many people mentioned in their reviews, but I loved this rug so I ordered it anyway. It's true, in direct light it looks bluish, but in the dark side of my living room under the coffee table, it's perfectly charcoal grey. That's the only reason I'm rating it 4/5. I put some cushiony rug padding under it and I love it! It looks and feels great underfoot.", 
    "It is absolutely lush, I love it!", 
    "Color is spot on, pile is very nice and they are very comfy under the naked foot. I would highly recommend and we are considering buying more. Love this rug!!!", 
    "I love this rug. It is plush and thick. The grey color does have shading that is different from some of the other greys in my room. My grandchildren love to lay on it!", 
    "After I redid our bedroom in a more modern finish, my partner complained that it felt \"sterile\" and hated walking on wood floors barefoot. I relented and get this rug after looking for weeks, because it was the right price and color, and had terrific reviews. I've been delighted with it ever since! It's incredibly plush (even without a mat) and feels welcoming on bare feet. The color variations are rich and give it a more interesting and luxurious appearance (and, with a white-haired dog, it masks any shedding so I don't have to vacuum every day!) We've had it over a year now and it looks as beautiful and new as the day we got it, and it warms the room beautifully. The only \"downside\" is that it's extremely thick ... which feels great, but don't drop anything small on it! I literally had to feel around on my hands and knees for an earring because it can get buried in the nap! And my super-suctioning vacuuming is hard to push because of the depth, but overall I wouldn't sacrifice the luxurious feel for the inconveniences (though my housekeeper may feel otherwise, LOL!)", 
    "This is a beautiful rug that is so comfortable to walk on. The color is nice and rich and it compliments my grey walls well. Great purchase!", 
    "We have the beige runner in the same style/brand. LOVE it. But when we got this one, it didn't seem as plush- more stiff and plastic-y, and it has an awful residue. When you touch it or walk on it, it leaves a strange chemical like feel. It IS a gorgeous color and the smell that some report is there but can easily go away with open windows and some Lysol. But because of the residue, I will probably return it. So disappointed.", 
    "This is a very thick, luxurious shag rug. It's more on the blue side of grey for those of you looking for a brown grey.", 
    "My daughter loves this rug.", 
    "Great color! Thick shag style that is wonderful!", 
    "A little darker than I'd hoped and feels very synthetic but it serves the purpose for a teenage boy's room.", 
    "Much much darker than the photo. Almost black. Also definitely not a shag. It has loops! I got the 4'round. Smaller than I thought. Over all, not at all what I thought I was getting but to expensive to ship back.", 
    "Love it! Exactly what was pictured.", 
    "Feels good on my feet the Colorado is great.", 
    "Love love love this rug. Very plush and soft. Great buy!", 
    "Color and thickens as pictured ! Very nice, great price.", 
    "Love the rug! Perfect for my daughters room!", 
    "Love it. Perfect color and appears to be of good quality.", 
    "This rug is great. It's thick and plush, and the grey is kind of silvery. It's pretty dark though, so if you're looking for something light grey, this isn't the rug for you. I have the 4' round, and I really wish I had gotten the bigger one. And I also want to find it in other colors.", 
    "Works great looks great. With thick rug pad is now somersault ready - my daughter loves it", 
    "Wasn't sure what to expect but is a good thickness, true to color and cozy in my daughters room.", 
    "very soft, no smell, nice color", 
    "Love this carpet and will be buying more.", 
    "It works and looks great.", 
    "Exactillay what I wanted! Perfect! Great quality and the color was right on. Added pad for more comfort. Super deal.....", 
    "We are really happy with this purchase and would buy it again. The material does not come out and it is very thick for an inexpensive rug. It has worn nicely.", 
    "I love this rug! Comfy and cozy and the color was perfect!", 
    "Nice, durable, holds up to babies and dogs. Have owned it for about a year", 
    "Love this rug. Very soft and full. Not cheap feeling at all.", 
    "Beautiful rug! Well made and very soft and plush. Great deal. The rug is darker than pictured.", 
    "Beautiful ! Well worth the money !", 
    "Feels rough...Will accomplish its task.", 
    "Great quality and has a luxurious feel", 
    "I purchased two of these rugs for my liv/din rooms. The color blend was perfect. I am so pleased with this purchase, and have had many compliments. Would choose this brand again.", 
    "I wish it were a little bigger (the round size was harder to picture than I thought), but it works as a \"hockey puck\" rug in my son's hockey room. Will have to get something larger at some point, probably, but it works for now. It's a nice looking rug", 
    "As expected. Suggestion, make sure you scotch guard the rug.", 
    "This was actually picked for our spare room and did nothing for it. I then put it in my husband's office and it worked out great.", 
    "Good quality. Very comfortable", 
    "I love this rug and so does anyone who walks into the room!", 
    "This is the best program ever bought from overstock.com serious pie was very nice and very thick.", 
    "The rug had almost a metallic blue sheen on it when taken out of the box. Material is soft for the price. Definitely not the color I was expecting, but still nice.", 
    "You will need a rug gripper underneath to prevent it from sliding, but it is thick and looks great on the floor.", 
    "Really great quality and soft feel. The only disappointment was in the color. In the picture it looks true grey but in person it is definitely more of a blue-grey. It still works fine in my bedroom but I would have a preferred a less blue hue.", 
    "Color was spot on. Quality is great! You definitely need a non-stick rug under it because it will slide all over the floor. It's very thick! Almost too thick to vacumn.", 
    "Really nice thick rug. Color is as pictured..rich grey color. I got a round rug to go under a rocker...I would imagine a room size would be great for kids (or anyone) to play on / sit on.", 
    "My grandaughter wanted a soft rug for her room. She absolutely loves the gray color and how soft it is. A good purchase.", 
    "I ordered this for our living room. It is so soft and comfortable. We have 3 dogs and it doesn't show any hair. Everyone comments on how great it feels. I couldn't be more pleased. I plan on buying another size in this same rug. Be sure to get a rug pad for all rugs.", 
    "very happy with this purchase, I can't complain", 
    "This rug exceeded all my expectations. It is thick and tightly woven. It feels like a much more expensive rug. I bought an 8x12 size and it fills the bedroom nicely. It is my favorite purchase for this bedroom.", 
    "Only gave it 4 stars due to a few imperfections, but it still looks great and we get a lot of compliments.", 
    "This rug is a little more on the slate blue side in color than the in picture - so I have to take away a star. Other than that, this rug is amazing! Super soft, no strong,weird smell out of package, delivered quickly, super plush and really made my livingroom feel warm and cozy. Cannot go wrong for the price!", 
    "Have had this for about a year now. Has held up very well, even despite two dogs who like to \"dig\" into rugs, and a cross-country move. The size fit well in both my living room and in a bedroom. Very flexible dimensions and well-made. Definitely a good purchase.", 
    "I am very happy with this rug. The color is a very nice dark grey and it feels nice under foot. A high quality pad for underneath is highly recommended, especially if it is going on hardwood floors.", 
    "best comfort rug I've purchased and the look is awesome.", 
    "I ordered the rug for my college aged daughter's redecorated bedroom. The rug came rolled and with a little fluffing with my feet, the folds were gone and the nap stood up. The nap was not as shaggy as I was expecting from the description, but I was fine with that. The color is grey, pretty much as pictured, and went well with the purple, black, and grey decor in the room. It matched perfectly with the curtains and bed ensemble that I also purchased at Overstock.com. This is the 4th rug that I have purchased through Overstock.com and I have been pleased each time. I placed the rug on a wood floor. I would go with the recommendation of using rug backing or carpet tape to prevent slippage. Another satisfied purchase!", 
    "This item has proven to be durable and we constantly get compliments on it.", 
    "Loved it so much I bought it again for my moms house. So comfy!!", 
    "Nice rug but the dark grey is more of a dark grey with a blue hue to it. Love the shagginess of it and have gotten a lot of compliments.", 
    "Looks a little darker than it does in pictures. Its pretty fluffy and decent for the price!", 
    "I was nervous making such a big purchase online (what if I didn't like it? It would be cost prohibitive to return!) But I did a lot of research and decided to go for it. Glad I did, the color is exactly as pictured, it's a great quality rug and totally what we were looking for! Easy to vacuum and doesn't show stains either.", 
    "I think u could get a better rug from ******. It is that bad. I'd send it back but it would be hard to roll it up and re package it. Don't waste ur money. :(", 
    "This rug is not grey but blue. Be careful!", 
    "This rug adds the perfect touch in our bedroom!", 
    "Great Quality. Looks just like the picture. Ordering another one for another room in our home.", 
    "Simple. Round. Exactly what I needed.", 
    "Excellent quality - perfect in every way! Highly recommend!", 
    "this rug looks good and still looks good months after I purchased it. it is soft and just looks great.", 
    "It's a beautiful, cozy rug. Color was not gray, the best description is a midnight blue. I thought the pile was as stated but my husband thought it was going to be thicker and cushier. I ordered the 8x10 but it was too small for my space. Instead of sending it back to Overstock I sold it to a friend and got my money back. Price was right and it was really good quality. Just beware of the color difference.", 
    "perfect , great poly shag rug for our outdoor covered living room", 
    "We're building a new house with all hardwood floors, which I, and my dogs, are not used to. I have been looking for weeks for a large sized rug that will not break the bank. I ordered this in a 3 x 5 so that I could see if I liked it, and I LOVE it! It came rolled, well wrapped, and didn't have any discernible odor that I could tell. I unrolled it and left it sit in the spare bedroom with heavy objects on the corners for a few days and brought it out to the living room last night. It didn't take any time at all for all the dogs and the cats to crowd on it. It's very soft and plush, and as far as I can tell, the color is a true dark gray. I will probably add a rug pad for added squishiness and to make sure it doesn't slide on my hardwoods, but I don't think it's necessary. I'll be using the 3 x 5 I ordered in the entryway, and ordering a 9 x 13 for my living room, and possibly a runner for my hallway. Overall, very pleased. My family owns a furniture store, which means that I have access to various name brand rug companies that I could order at cost, but this still seemed like a better deal to me.", 
    "This is a great deal on a nice rug. The shag is thick and very soft. My kid loves to play on the rug. I am very happy with my purchase.", 
    "Made very well love it will by again", 
    "Love the thickness of this rug, just beautiful.", 
    "Based upon all the positive reviews, I purchased this area rug for my master bathroom. It is soft under foot, and very plush looking. I don't see any \"blue\" in the grey color at all. It is very close to the grey that my computer screen shows. While it is dark grey, there is some lighter grey mixed in. It gives the carpet color a lot of life. I am very happy with this purchase.I only wish they had smaller sizes (bath mat size) as well. I would put one outside the shower.", 
    "Love this rug, it's perfect for my bedroom doesn't shed and beautiful color", 
    "Nice and plush for the price. Took a bit to unroll and lay flat.", 
    "And I mean every word. Wonderfully made, deep and ultra plush, this carpet is ,by far, the best me (and my toes) have ever come across!", 
    "This rug is beyond what I was expecting especially because it was such a great price!", 
    "Exactly what we wanted - great size & color - feels wonderful on bare feet and comfortable to lay on - very satisfied!", 
    "Color is exact as shown with shag that is not too long. The rug always looks freshly vacuumed. We have three in our bedroom, one on each bedside and one at my vanity. An excellent purchase as they feel wonderful to walk on and are so easy to maintain. On hardwood flooring they do slide easy and require a rug pad. We are very pleased with the quality.", 
    "We were very pleased with our purchase. It was a little darker than portrayed in the picture but fit what we needed exactly. It fits the measurements and we would definitely recommend it.", 
    "it is possible to vacuum this, tho", 
    "I am only giving this 2 stars because it was not what I had in mind. It was really just a piece of thick carpet fibers, not a \"cozy grey shag rug\". I wanted polyester shag, which is much thicker and much softer!they do sell but the pictures look very similar. I figured if I wanted carpet I would have installed carpet but I wanted a shag rug in my cozy living room. customer service was amazing and let me return the rug and order the polyester pop corn shag rug instead. Once I returned this one and received the popcorn shag I was so glad I did! Such a world if difference but the photos online look the same! If you want carpet this is for you, I'd you want cozy soft shag that your toes sink into go for the polyester pop corn shag!", 
    "Great accent in our home and absolutely LOVE the thickness!", 
    "The rug is definitely more blue than grey, but it's subtle enough that it actually works in our living space. Still would've preferred a charcoal vs a bluish grey, but all and all it feels pretty good and the price works.", 
    "Nice grey color good quality", 
    "High quality thick deep plush. Very comfortable and insulating", 
    "Perfect round grey rug! Excellent quality and color is dark gray! I love it and feels great on the feet!!!! Happy....Happy", 
    "I was impressed by the quality of this rug. However, the picture displays the rug as more dark grey when in reality it leans more toward bluish gray.", 
    "Easy to vacuum and super soft", 
    "Bought this rug for my son's room and he loves it! The color is great and it is so soft on the feet. Would definitely recommend this rug! Really great quality for the price!", 
    "This rug is great. Soft and cozy. It was much darker than I expected. Looks gun metal grey. It still works fine with my decor of grey walls and white slip covered furniture. It was delivered in 2 days!!!", 
    "I love this rug and it is just what I was looking for. It is a darker grey but also shows a lighter grey depending how you rub your hand or foot across the shag. At times it even looks like a deep steel blue but that could be because the room is blue. The feel of this rug is so soft and comfy. If I had some place to put them, I'd get others in different colors!", 
    "We have a modern theme in our living room and I wanted a nice rug for the hardwood. I have never spent this much on a rug so I was hesitant but I am very happy with my purchase. The rug has a great pile and it is VERY soft. Shipping was quick and it came in perfect condition. I vacuumed it right away to relieve the fibers. It laid flat after about 3 days. I did not put anything on the corners like some people, I just let it do its thing. I purchase the large piece (6.7 X 9.6) it does not move much or slide. Happy customer and would recommend this rug to any one looking for a massive rug, and remember to measure first and get an idea of how big this rug can be.", 
    "Exactly what I wanted. The shag is so thick and plush.", 
    "This rug is soft and better than I hope. I want one in every room!", 
    "I absolutely love this rug. I ordered it on a tuesday and got it on that same Friday. It is soft and plush and doesnt feel like one of those cheap waxy overpriced rugs from the store. I bought the square 6x7 and its the perfect size. I get so many compliments on it. I would most definitely recommend this rug to anyone as well as purchasing another one in the future.", 
    "haven't opened it yet but the cost for the size was great....", 
    "this is a thick and comfortable rug! love the color too!", 
    "I love the look and feel of this", 
    "I didn't want to review immediately until I knew this rig could stand the test of times and hold its own. I have three kids and two dogs and the rug is still holding its own and looking great. If you're considering purchasing it, don't hold back. You won't be disappointed.", 
    "It is a very comfy, cozy rug. You never know what you are going to receive from looking at photos, but I am very satisfied.", 
    "I love this rug! Everyone we have over gives us the best compliments on it, it's very comfortable and soft under your feet, and the color is a rich silvery gray. I would say the pictures are true to the color - this is not a light colored rug. The only thing I don't care for is that one of the edges isn't cut evenly - not enough to tell - we just arranged that part of the rug under the furniture. We also purchased the Supreme Felted Dual Surface Rug Pad (6x9) which makes it feel very soft and helps it not to slip on our wooden floors. Great purchase, would definitely recommend it, and happy with our product.", 
    "The color is a little darker than what it's shown on the picture but not by much. It is a perfect rug which feels well made and durable. It is not necessarily the softest material but for the price and quality of the product it is perfect. Truly recommend that you get one if you were still undecided.", 
    "I purchased this rug for my den. I got the round and I love it. Nice color and it is plush. This is my second rug and I love it.", 
    "This rug is so soft - I just love the way it feels and I'm sure it will wear well as the construction is great.", 
    "Gave this 4 stars because I have no idea how it looks or how it's holding up. My son likes it.", 
    "Plush, comfortable. The gray has a slight bluish gray tone that I like.", 
    "The wife & I needed an area rug for a guest room located in our basement...the color was true to the description & the feel to barefeet exceeded our expectations !!!!", 
    "Love the rug so soft and color is true to what you see online. Absolutely beautiful !!", 
    "Pretty grey and comfy. Bought it for my sons bedroom. Great buy.", 
    "I'm absolutely in love with this rug. It is so thick and plush. I love how it feels under my feet. The color is gorgeous. A very nice shade of charcoal. Everyone who comes in says, \"I love that rug\" Excellent choice!", 
    "I bought this for my bathroom but it's too thick to fit under the door. My daughter is going to take it to college with her, she loves it, it's a great rug!", 
    "Only suggestion would be to roll it so the shag is out. Takes many days to lay flat. Otherwise feels and looks good.", 
    "Nice rug, true to the picture.", 
    "I a cat that suffers from hairballs, regardless of the medicine. She has thrown up on this rug a few times and I am amazed how it cleans right out, no fading, the piles don't come undone. The rug is amazing!", 
    "This is a thick shag rug - not sure I will use my regular vacuum on it as I'm afraid it may 'eat' the long pile. My shop vac will work. The color does have a slight blue undertone more like slate, but it works beautifully in my space. I did use a carpet pad underneath which gives it more comfort under foot.", 
    "The color wasn't right....had a blue cast to it. Had to return it unfortunately....", 
    "Color much darker and much more blue than reflected in photo. Would have preferred a more grey color rug. Quality seems good. Very plush.", 
    "Thick and plush. this rug was way more than I expected. Definately worth the price.", 
    "Other reviews had mentioned the rug had a bluish appearance- I disagree. Mine is charcoal gray & so soft! Love it!", 
    "Soft rug for a good price. Looks exactly like picture. Very happy with the purchase.", 
    "I bought this for my bedroom! I love waking up in the morning and stepping on softness and warmth? Very nice rug!", 
    "We love this rug. Perfect dark grey color and so soft. Everyone who stops on it comments how soft it is. No shedding or scent either.", 
    "My wife and I love our new living room rug. The pile is thick and delivery didn't fold or crease the rug. Awesome grey color, fibers don't look fake.", 
    "I was a bit hesitant to order as I had read some reviews saying the rug was not the color described; however, I was quite pleased. It's a rich grey, no hint of blue to me. The quality is good, it's thick (so comfortable to walk on), and is a nice addition to our nursery. If you want grey, it's grey, and again what I was hoping for.", 
    "Very large. Good price. Very comfortable.", 
    "very beautiful rug! my son loves it!", 
    "Great rug, good pile height, color is true to description, doesn't shed and feels very plush with a rug pad.", 
    "Great quality, perfect color, amazing bargain. This is my second Safavieh shag rug. I also bought the Cozy Silver rug. Love them both.", 
    "is soft and the color has some gay tones that I absolutely love", 
    "My son loves this carpet and it still looks new after all the wear and tear of probably over a year. It is so plush legos get lost in it! Very good quality and value, especially for the great price", 
    "nice rug very soft great color and qulaity", 
    "True to color, soft, and true to size", 
    "Looks expensive and feels expensive! Very lush and thick. Color is exactly as photo depicts.", 
    "Absolutely love it! So soft and cushy on your bare feet. My dogs love laying on it. High quality at a decent price. You will not be disappointed.", 
    "This a great rug and I would recommend.", 
    "Love the color. It is definately a blue grey which is what I wanted. But the pile is not 1.5 inches like the description. It is about 1 inch. The rug is ok not as plush as I had hoped. The Allen & Roth shag I bought at Lowes for the living room is really soft and plush. I'd send this back but too expensive to do for a 9x12 rug. Also the rug is not symmetrical. Its out of kilter so after an hour of trying to get it to look straight and even we measured it. Its off a couple of inches.", 
    "Cozy, well made. I love it", 
    "Didn't realize the size of the material which was a total turnoff for me. Not my intent to discourage anyone else, but this was not for me.", 
    "In stark contrast to the 'nuLOOM Soft and Plush Modern Solid Shag Grey Rug' (called \"easy shag\"on the tag), this rug is plush and thick, and feels good to the touch. It is a poly fiber rug, colored as advertised, and feels quite soft, thick, and comfortable over a hardwood floor. I've now owned this rug for almost a year, it's been in my teenage child's room, and it has held up wonderfully. I would recommend this rug to anyone looking for a shag rug that feels plush but is also durable.", 
    "It arrived quickly. Some of the other reviews said that they noticed a blue tone to it. I don't know if there is a mixed batch or something, but this is a nice, dark grey mixed with lighter grey tones that makes is just beautiful. Great value. When I opened it, I was concerned about being able to vacuum it. I ran my vacuum over it, and it seems just fine. The plushness of it masks any creases, which really irritate me in area rugs. It is also substantial enough for it not to slide around when the kids are playing on it (I have it on another carpet in an apartment, not a wood floor). I am very happy with this purchase.", 
    "Beautiful, very well made and plush. I loved this rug! Unfortunately the color did not work for me. But I would've kept it if I'd had another place in my home for it!", 
    "This shag rug pulled my room together, so easy to do that with this truly beautiful shades of gray.", 
    "The rug arrived VERY quickly but I was a bit dismayed to find the color to be VERY dark. It's got hints of grey but is really almost black, especially under evening lighting. I would have returned it but I'd already destroyed the packaging before I unrolled it. Live and learn. Quality seems quite good although the backing is rather slick on a wooden floor. Definitely needs a non-skid pad or you'll break your neck.", 
    "This rug is great quality and beautiful. It's super thick and plush and the color is true to what you see online. We came back for a second one.", 
    "love my new rug, feels great, nice and thick", 
    "I ordered dark grey but it looks almost charcoal with hints of dark blue. The color was so off I thought they sent me the wrong rug. Otherwise I would give it 5 stars, it's super soft and cozy.", 
    "Super thick, beautiful. Kids love to roll around it in. Great purchase", 
    "Love this Rug! It is so shaggy and cozy. My kids love to lay on it and just hang out. It is pile pretty high so a little hard to vacuum but so comfy so it made up for the difference.", 
    "looks grey not blue to me", 
    "really nice every one loves it a throw back to the 70's thick and plush get it", 
    "Wanted a charcoal color carpet in my living room - this fit the bill perfectly. Lays well, color is a little darker than the picture, thank goodness! It's soft and beautiful. I LOVE IT!", 
    "Darker than I expected but otherwise has held up pretty well.", 
    "I thought this was going to be a dark grey rug - but its more of a middle-grey color. it also has lighter specks throughout. I didn't keep the rug because I really wanted a darker color, but they were great about returning the rug.", 
    "Thick and great looking for the price!", 
    "This rug is very well made! I would recommend.", 
    "Very nice, soft and plush.I also bought it for my son forFor Christmas", 
    "The color is perfect, and the quality of the rug is excellent. I love it", 
    "Plush and soft under your feet!! Very happy with this purchase.", 
    "soft, great color. I use it at work where it gets high traffic and no stains after 1 year", 
    "Very soft and great color!", 
    "This rug is fine. It is not as \"cozy\" as I was hoping and the quality is lacking. It will be fine under the bed as it was intended but very disappointed in the quality for the price. I would have done better with a *** rug.", 
    "I was happy over the rug, size and price. The only thing I was surprised by was the color. It is not a dark grey (slate) it is more of a dark battle ship grey (has some blue to it). My furniture is arriving tomorrow. If it doesn't match, I will keep the rug and still it in my bedroom.", 
    "I ordered this for my living room to add some warmth. The beautiful gray colors and thick, piled plush do the trick. The color is just as it is in the picture and the corners and edges are finished beautifully. Walking on this rug is like walking on marshmallows! Soooooo plush! I loved it so much that I ordered one for a spare bedroom in my home.", 
    "Great rug... well worth the $.", 
    "Grand Daughter & Her Roommate are enjoying it in Their Dorm @ Stephen F Austin State University. Looks Great!!", 
    "Carpet is great. Very nice quality and really soft.", 
    "so nice and plush. Use a rug pad so it won't scratch wood floors, the backing is rough.", 
    "So soft but wished it were a bit lighter in color.. Very much dark dark grey.", 
    "I'm using the rug to stage a home I have for sale. It adds color and gives a cozy feel to room.", 
    "Good looking and decent quality, worth for the price", 
    "Just what I wanted. The color is spot on.", 
    "Love this rug. It's so soft and great quality.", 
    "Great rug! love the color!", 
    "These are the most comfortable rugs I've ever had. They are so nice and thick. The color match was perfect.", 
    "Color darker than pictured. Other than that it is very nice", 
    "But still great - very plush and stands up to lots of dog and toddler traffic.", 
    "works perfect for grand childrens room", 
    "Beautiful rug which looks fabulous on our new floor. One side isn't sitting properly on the floor yet, and I'm hoping to avoid using tape so I'm giving it a bit more time to drop. Otherwise this is perfect for our space. The colour is spot on and the texture is fabulous. Both our child and the dog love it!", 
    "I absolutely LOVE this area rug! It is slightly over sized, which makes it extra comfy and generous. The weave is tight, the fibers are lush, the backing is high quality and supple. The feel is terrific! I'd buy it again!", 
    "Just what I was looking for in a bedroom rug ! Extremely soft", 
    "everyone that walk on this rug feels so soft", 
    "I shopped everywhere for just the right rugs for our new bedroom and kept coming back to these. I ordered two 4ft round ones, a 3x5 and 2x7 and can't tell you how much I like them. They aren't a solid color. It's more two toned grey/black and that's what I love. They haven't shed a fiber and layed flat as soon as I put them down. Now when I get out of bed or sit in my chair to read I just wriggle my bare toes in the plush comfort of the fibers and feel like a Queen. They complement the grey walls and light blue ceiling perfectly.", 
    "This is perhaps my greatest surprise purchase! Initially I had planned to place it in the formal sitting room, however, the hip, somewhat sparkling, shag was perfect for the large hard wood floor in the master bedroom. Cleans well w/a vacuum, just raise the vacuum head to the highest level. Very durable!", 
    "Ordered it in an 8x10! Its very shaggy and nice! It has dark and light tones throughout...and appears charcoal at some angles and almost metallic silver at others. Just the look i was going for! My animals already love it. I am letting it air out and form its shaper before placing around my bed!", 
    "We love this rug, its under our bed and the shag is thick and soft. It feels great on your feet. The color is a bit more of a steely-gray with some blue tones, but not overly blue. We felt like this was a great purchase and really warmed up our bedroom.", 
    "Really like the Safavieh Shag rugs. The color is what I wanted. Only hadfor couple of weeks. Don't know yet how they will wear.", 
    "I love this rug. Beautiful color and super soft", 
    "Super soft and plush. I bought it for my daughter's dorm, then bought it again for a room at home because it was such great quality and so affordable.", 
    "I live in a luxury apartment and this rug is so beautiful and classy. It just adds to the luxury on the outside.", 
    "I was surprised at how heavy it is -- and even though there is no foam layer underneath it is fairly comfortable to lie on as well. Bigger than I thought it would be but I like it! And a great price. ABB in NYC", 
    "Great rug, soft and thick!", 
    "This rug feels great under foot. It's a dark steel gray. The rug doesn't shed and looks great in the room.", 
    "Beautiful rug. Everyone who sees it loves it. Very soft. Darker than appears. More like steel blue.", 
    "This rug is very cute. Is does have a iridescent look to it. Mixing of silver, grey and dark blue hues. It works beautifully for my living room.", 
    "Love the rug. If you want a true grey rug you may not want this one. I wanted true grey and there is a definite blue tone to the rug. Luckily if works perfect in my living room.", 
    "Didn't expect such luxurious rugs for the price. One on each side of the bed, great color, thick (THICK) pile, love putting my bare feet down in the AM. Easy to vacuum, no shedding and very happy with my purchase.", 
    "Exactly like described. Soft and just shaggy enough without any shedding!", 
    "My living room is a greige paint color, so the rug does nothing but complement the color. But, if you're looking for a truly dark grey rug, this is not the rug for you. The quality is fantastic, and it holds up well under weekly vacuuming (I have one dog who sheds a lot).", 
    "Great color, quality and pile height is impressive. You will not be disappointed with this rug.", 
    "The rug is a wonderful dark grey colour. It feels great underfoot, and I will definitely be ordering it again, but in a different size.", 
    "Soft, good quality, well kept.", 
    "Timely delivery, love the rug!", 
    "Item received quickly. Very nice, plush rug.", 
    "looks as pictured. very satisfied. would purchase again.", 
    "Literally. Thanks to overstock for my first time being satisfied with a purchase I have made online, thats anywhere! !, I look forwad to doing more excellent quality business and also I plan to shop on overstock.com more often", 
    "Perfect rug for any area.", 
    "This rug's thickness is so inviting that it's hard for me to pass it up without laying down on it to play with the dogs. The color is true to the website. The edging is done very well.", 
    "A lot smaller than I thought it was going to be. But it a nice size for my bathroom, where I recently moved it to. Love the color", 
    "Very cushon and easy to clean", 
    "Great quality and nice to feel it on your feet. Got one for the bedrrom and one for the closet and I am very satisfied with this purchases.I do recommend this product.", 
    "So glad I ordered this rug. I read all the reviews and was worried about the bluish tint that some had mentioned, but I don't see blue in the rug at all. It is more on the cooler side of grey rather than brownish. But I still don't see anything but grey. Love the plushness of this rug. Excellent quality and great price.", 
    "A good-looking throw rug that's easy care too.", 
    "Excellent quality- very plush grey shag rug!", 
    "I bought this as a replacement for a high priced wool rug. I am very satisfied. Rug wears well and vacuums well. Looks great and soft to the touch. I am pleasantly surprised as I didn't know what to expect at this price point.", 
    "Love the texture and color is as pictured. Rug is very soft and comfortable would def recommend", 
    "Bought this rug to go in a gray toned living room and it looks blue. Beautiful rug but just not the right color.", 
    "Love this rug- very well made!! It looks and feels great. Would definitley buy another!", 
    "This is a beautiful rug. Thick and soft.", 
    "Probably the best deal on a shag rug...Fluffy, comfy and priced right. Very happy with it", 
    "Overstock was very helpful and the carpet is a nice quality. It isn't overly soft which I would have liked but it is soft enough that it is comfortable and enjoyable.", 
    "This rug looked great once it was unrolled and vacuumed. Very durable, had it for a year now with two small kids.", 
    "I love ordering from Overstock, because they have excellent folks helping me redesign my home. This rug is gorgeous, but it doesn't quite resemble the pictures. It has a slightly pale blue undertone that is not evident in the photos. That being said, even though I had to return it, it's a great, great rug for the price point. If a solid, plush grey is your color, I say go for it!", 
    "I have bought a few Safavieh shag rugs on Overstock. This one is not as plush and soft as the aqua one or the off-white one. It's a good rug and a good value....but not my favorite. It is a charcoal gray with a decent pile and good for a game room or anywhere you don't want stains to show. Very masculine. I might get a smaller one for my sons apartment.", 
    "Very nice quality and color. Fluffs up nice after install and smell of new carpet goes away quickly. Used in my kitchen under dinette. Very Nice.", 
    "This rug it's nice and thick but will need rug pad on wood floors.", 
    "Great for my daughters dorm room. Looks like it will last a while. She loves it.", 
    "Have these in 3 rooms now ... :0)", 
    "I've had this rug for about 2 years, so this is a review about how long it lasts. First, I will say the color is not charcoal gray, it's blue with gray in it. If you have furniture you are trying to match, this will look \"off.\" My couch is black, and I think that makes the blue come out even more. I've learned to live with it, but buyer beware.Ok, so this rug is incredibly comfy to sit on. We have it on a hardwood floor with just a non-slip pad underneath, and it continues to be very comfy, even after a couple of years. Our dogs LOVE taking naps on it.It's a shag rug, and therefore is very difficult to vacuum. I'm not sure if it's because I've been running a regular Dyson over it for awhile, but it's definitely starting to show its age. I had a couch over part of it, which I moved, and I can definitely see a difference in what it looked like new, and what it looks like now. The fibers have been coming out of it for awhile (I usually cut them off), and the shag is just starting to look matted. However, at this price for a huge 8x10 rug, it's not a total travesty to replace it. It does not show stains at all, which I do like! We had a few doggy accidents on it, and they are nowhere to be found.Overall, if you have kids or dogs who spend a lot of time on the floor, this is a great rug. I'm only downgrading it because the color was not what I was expecting, and it's looking worn down a bit faster than I had hoped.", 
    "I purchased this rug several months ago for my upstairs loft. As soon as I opened it, I knew I would love it. It's very cozy and plush and the color is rich. Thinking about getting another one soon", 
    "Tons of compliments on this thick, beautiful area rug. I am very satisfied.", 
    "This rug was the perfect touch in our remodeled bedroom- good quality and very plush. There was a slight odor like plastic when first unwrapped but it disappeared in a few days.Great price and great overall purchase.", 
    "I'd been looking for a rug for my bedroom revamp and this rug was surprisingly plush. I love it and the color is amazing! I'll probably buy another one in a different color for another room.", 
    "Nice rug, thick shag but needs backing. Multiple shades of gray (not solid) so blends with everything.", 
    "Beautiful rug! Perfect for my master bedroom!", 
    "I am very pleased with the quality of my rugs.", 
    "I love this rug so much that I just purchased a larger one for a different room. My dog loves laying on it and looking out the sliding glass door-she seems to think it is her new bed :)", 
    "I love to walk barefoot on this awesome rug. My only slightly negative comment is that is has a lot of silver highlights vs solid \"dark grey\" but does not take away the beauty of the rug.", 
    "Bought it for my daughter's college dorm room. She loved it. It is thick and looks great!", 
    "True to picture, nice rug for price", 
    "WE have just redone our living room and this was the final touch to our modern redo. We have a \"mist\" - soft white - leather couch and the color and the feel of the rug is perfect.", 
    "Great neutral color for a room! Texture is great and quality high.", 
    "These rugs are beautiful Thick and plush Highly recommend", 
    "My son just recently moved out and I gave him this shag grey rug, as a gift. He loves it so much, he put it in the living room area by the chair and coffee table. He said its so soft and cozy, he loves a lot! I think I have to order one for myself!", 
    "I was thrilled when I recurred this rug. It is plush and thick and the color is spot on from the website. It is in my daughters bedroom and she loves it.", 
    "I read the reviews on this area rug before purchasing and I can see exactly what the previous reviewers saw in this beautiful rug. I bought it for my office and it stands out perfectly! I especially love the light and dark tones, they almost shimmer!", 
    "We love this shag rug. It is comfortable as well as beautiful. I know that our two dogs would also like to add that they love laying on this rug. (Which is way better than them laying on our sofa).", 
    "Love this rug, it is very dark, but it goes with what Iam doing>.", 
    "Fabulous! True color, nice and thick underfoot. Would definitely purchase again!", 
    "Good quality. It looks exactly like the picture and is very soft on the feet.", 
    "This rug is very plush and came as described Have not had excessive shedding or odd chemical smells. Love that it was available in the size we needed", 
    "Very soft and thick. Looks great on my tile floor.", 
    "Love the color and the softness of the rug. It is in my daughters bedroom and we love it. Always looks the same even after a few days of not vacumning", 
    "It was very good quality it just wasn't the right length for my bedroom", 
    "1st. Item I purchased with Overstock and have been happy with everything from that day on. This rug is true to color that you see it not any darker or lighter. It's a shag rug as shown and very cozy, great for a living room and thats what we bought it for and we are very happy with the quality and texture as it does not shed like other shags.", 
    "Its an average gray rug. Nothing too exciting, not bad for the money.", 
    "I love this rug. It has a thick pile and is so soft to walk on. You don't have to worry about dirt showing on this rug and it looks experience.", 
    "You cannot go wrong here.... everyone will compliment you and nobody would ever guess you didn't pay 5x's that price!!", 
    "Fast delivery dogs love it Well worth the price", 
    "This rug is beautiful and soft to the touch. I am using it in my meditation room which is also my \"empty nest\" (my youngest son's ex bedroom!). The walls are painted sky blue, and this gray rug offsets the color perfectly. Others have complained that there is a bluish cast to the rug, and I have to agree...if someone wants a true gray this might not be the right color for them...it works perfectly for me, but I would call it almost a deep dark blueberry color. I spend about half an hour a day sitting or laying down on this rug, and it's so luxurious...I am delighted with this purchase.", 
    "Beautiful rug!! So soft and a great buy!", 
    "I was pleased with the style of this rug, it's very plush for the price. The style didn't fit in the room I purchased it for, but I switched rugs and it worked well in another room.", 
    "takes awhile for the kinks to come out as it's shipped folded. but worth every penny. love this rug.", 
    "ilove this rug/ carpet But my Vacuum has a hard time with the thickness.", 
    "Very soft. My husband loves walking on it barefoot", 
    "I love this rug. It's probably the nicest rug I own and one of the least expensive", 
    "Be careful of the color choices as the pictures do look bit different than the actual one you'll receive. But close enough imo.", 
    "Glorified carpet, very nice and fluffy", 
    "Color feel look. It has every. Buy it", 
    "I wanted a solid grey rug to coordinate with some existing area rugs. After reading the reviews, I purchased the 11 foot runner. I liked it so much I purchased it in a 4x6 for a transitional area. The color of the rug was true to the pictures and exactly what I wanted. As other reviewers have stated the color is a cool grey. Both rugs are wonderfully soft, lay flat and I feel are good value for the price. I have had no issues with shedding and the rugs have stayed nice and fluffy. I did purchase rug pads to keep the rugs from slipping and to protect the hardwood floors. I am pleased with my purchase and am considering purchasing another for a bedroom.", 
    "This rug is plush soft and absolutely perfect :-)", 
    "The quality of this rug is really good and the price was better than anything we could find elsewhere. I very happy we purchased this area rug.", 
    "The rug arrived on time and rolled up, so it took a while to get the rug to stay flat. It is hard to vacuum because it is so thick. But when the babies, our grandkids come over they love to roll and play on the carpet because it is so soft and thick, love the color too!", 
    "Very nice rug for the price. It is really thick.", 
    "I purchased this for the master bedroom and it's exactly what I wanted. The grey color is not flat or dull. It's more a combination of various shades of grey and has a nice sheen to it without looking cheap or overly synthetic. The slight chemical odor aired out quickly and it relaxed and laid flat within a couple of days. I am extremely pleased with the look and quality of this smartly priced rug and both the Mr. and I love having the soft, shaggy goodness to sink our toes into each morning. I purchased the matching runner for the master bath and it too is perfect. The combination of color and thick pile hides everything. It vacuums nicely and there's been hardly any shedding. An excellent purchase!", 
    "I purchased this rug several times for different projects and it's a great rug. The color is beautiful and it's really soft. Definitely recommend it!", 
    "This is a fashionable addition to the living room. It's soft, fluffy and and a favorite rolling alley per the kids.", 
    "I purchased a lot of things for my redecoration of my house from Overstock. They were all amazing. Great value great products. Great prices!", 
    "The color is a steel or gunmetal color. I would not call it blue. It is very plush and soft.", 
    "I liked the rug, great quality, didn't shed and was able to vacuum it. The only problem was it is more of a blue/grey in color. It didn't go with my living room, so I returned it.", 
    "Holds up well even with 5 dogs and daily vacuuming", 
    "Purchased this to protect my carpet in high traffic areas. Looks very much like dorm room rug. Would not buy for mature room.", 
    "Very plush! Wonderful dark grey color!", 
    "This rug arrived as indicated and in perfect condition. It was not difficult to get any bumps out and flattened quickly. The color has a hint of blue and looks great in my beach house with white chairs and gray and white striped coordinating pillows from ikea. This rug is soft to walk on and the grandchildren live sitting on it just to hang out. Highly recommended.", 
    "Very good quality. I might have to buy another one because our puppy hound dog ripped a hole in it while we were gone. Thick enough to fluff over small hole, but now it's gotten bigger. Darn dog! I would buy another one though.", 
    "Perfect for my studio. Great quality.", 
    "I bought two of these - one for my bedroom & one for my closet. The grey is a beautiful shade and the rug is perfect", 
    "very comfy and shipped fast!", 
    "I was so worried about buying a rug unseen. After reading the great reviews, I decided to purchase. The rug is perfect for my living room. The color is beautiful and cozy.", 
    "I have never bought a rug before that was made from synthetic, only wool or cotton. But my son really was hoping for the comfort of a shag rug in his room and this was the color we needed. It's a nice gray, doesn't shed, didn't smell and seems just perfect. I put a thick dual felted rug pad underneath, also bought on Overstock, and it's a great combo.", 
    "Very good value for the price. Plastic backing and not as densely packed shag as you would get if you bought an authentically woven carpet. But for the money, it is a great purchase. Comfortable, looks great, and much bigger than you can get for this price anywhere - and the dogs love rolling around on it!!", 
    "I love this rug and it is durable.", 
    "Soft, deep, nice to dig your toes into", 
    "The rug is a nice modern grey. It seems to be made very well and it was a perfect addition for my living room", 
    "I was a bit disappointed at first. There was a spot that was wet, possible during shipment, and it smelled a little musty. After I vacuumed it blossomed! Thick nap and really beautiful colors", 
    "I have a love/hate relationship with this rug... the shag material is nice and soft, however I noticed that there is some sort of residue that leaves my hands/feet sticky when I touch it. I'm assuming it's some sort of conditioning chemical they used to treat the material. It has left me baffled and frustrated... I've attempted to get answers from Overstock as well as the manufacturer as to what this could be and if it is harmful, to no avail. I've also noticed that no other purchasers seemed to experience this problem, so maybe I just got a dud. It was such a pain to roll it out under my furniture so I decided to just keep it and steam clean it (multiple times). I still feel some residue, though it is less noticeable after the cleaning. Aside from this, it's a quality rug, although it's a bit darker than I thought it would be.", 
    "This was one of the best purchase for the money. True to size, color was great and the quality was excellent.", 
    "This rug looks and feels luxurious. Thick and soft. So much better than the cheap Ikea rug we had there (ugh). I would definitely recommend this rug.", 
    "Excellent quality, And very soft.. the perfect Dark Grey.. I have recieved many complements on this rug!", 
    "Rug is perfect dark grey color... very soft... vacuums up nicely... had a smell when first came but I sprinkled with baking soda overnight and vacuumed next day and much better... size is great... Overall great value great rug!", 
    "Needed a rug by the bed to cushion tile floor. This tug is perfect. Weight is great, color was true to the picture. Fibers are tight and thick. I would recommend a pad under it as it \"walks\" on tile.", 
    "Loved the feel of the rug - this color didn't work for us - so I returned but intend to purchase another.", 
    "This rug is great. I loved the color. It goes perfect in my master bedroom.", 
    "Amazing! Looked so much better in person. Super soft a fluffy. Was a little darker than the picture but no complaints from me.", 
    "we have this in our family room. With 2 dogs and lots of foot traffic this holds up great. I use a Dyson pet vac on it and it has held up great. No shedding.. love it", 
    "The color is beautiful and the rug is super soft. Would definitely recommend!", 
    "PREFECT FOR THE BATHROOM, MATCHED ANOTHER RUG PURCHASED YEARS AGO. WHO KNEW????", 
    "Used this as an accent rug in my bedroom. I like!", 
    "The rug was gorgeous. Thick and of extreme high quality", 
    "The color and description was very exact. I was hoping a little softer but we will invest in the pad underneath - Otherwise a great purchase for the price - Very quick delivery as well - I expected a week but it was on my front porch rolled neatly and covered in plastic in 3 days", 
    "Great for bedroom! Very cozy and plush. The color does lean towards a blue but it is perfect for my needs!", 
    "This is a high quality rug, really thick and so soft, you can sleep on it. It's that comfortable. Great color and great price you won't be disappointed!", 
    "I like this rug, it's soft and comfy so I chose to keep it. However it is not the rug I thought I was buying from the photo. I wouldn't call it exactly charcoal gray - there's a lot more blue than you see in the photo. If I were to name the color, I would call it \"blue steel\". Luckily even though this wasn't what I wanted, it happens to work in my room.", 
    "Very soft, thick, color of the picture is accurate. Love it. Good value.", 
    "I get tons of compliments on this rug. I actually love it so much that I bought a second one for another room. It's a beautiful grey with blue-ish undertones, and feels really nice on the feet.", 
    "Just received this rug and it is absolutely beautiful. True color, great feel on the feet. It does have a slight new rug smell which I'm sure will go away in a couple of days or less.I just hope it holds up in the long run but for now I'm very satisfied.", 
    "I love this rug. The color is a beautiful dark grey and it's so plush and lovely. I have one in my living room for over two years that has taken a real beating and still looks and feels great (it is in a high traffic area, has had lots of things spilled on it). Someone spilled wine and while I was unable to get all of the wine out before it set in, you actually can't even tell anything happened to it (due to the dark color). Just a heads up--since it's shag you can't PUSH a vacuum cleaner over it. I have to pull mine backwards which is fine, it helps to fluff up any matted down sections from constant walking. I loved it so much I got another one for my master bedroom! It had a little bit of a smell when it first came but that dissipated within a couple of days. And after I rolled it out, the fold marks worked themselves out, also within a couple of days. Honestly, I was so scared to buy the first one sigh unseen but I'm so happy I did.", 
    "Perfect Rug - just as described.", 
    "I love this soft rug but feel it was pricey compared to rugs at homegoods etc.. But was delivered at my door so the convenience was worth it!!", 
    "Best Bang for your buck. The quality is really nice, it doesn't even shed so that's great, and the texture makes you want to just dig your feet in it. Love it.", 
    "Holds its shape very well, nice grayish blue color. Really like it", 
    "Great quality delivered timely very satisfied.", 
    "It's nice and thick. Soft to the touch and seems like it's well-built. Glad I bought it.", 
    "This is a thick, wonderful, soft rug. The color has bits of white flecks in it, which i did not expect, but it works. Dirt will not show on this rug. Vacuums beautifully.", 
    "This rug looks and feels great. My living room furniture set is predominantly navy blue with cream and gray accents and this rug brought the entire room together. Definitely one of my best finds.", 
    "This rug is a nice dark color and very comfortable. Bought it for my kids room to go on top of a hardwood floor and it makes the room much more comfortable for them!", 
    "Shipping was slow for UPS. Ive ordered 5-6 rugs online, most bigger than this 4x6 & this rug had the most bumps/lumps from being rolled up. I had to put heavy object on all corners to hold it down so I don't trip. Hopefuly it will flatten out soon. It smells now, as most of them do when you first unpack them. It isn't as soft as I thought it would be, you can mainly feel the thick backing underneath.", 
    "looks good, feels great on bare feet", 
    "This Safavieh Round Dark Grey Shag Area Rug is beautiful to look at, very soft, and plush. Color is exactly as pictured. HOWEVER, the craftsmanship is quite terrible! The cut of the rug is not even...in fact, not even close! It is not round, it is more like an uneven scalloped rug with chunks of rug missing around the edges. As always, Overstock Customer Service is \"the absolute best\" and arranged for a full money back return and emailed the UPS Return shipping label to us immediately. Since we already purchased the round felt non-skid rug pad, it's back to the drawing board for a new round rug in the same size.", 
    "Very nice rug at a great price, I have another Safavieh and they hold up very well. The color is a platinum gray, with a silvery tint in certain light. It looks great in my place, but is definitely not blue like another shopper stated. The color is very rich looking, and my Chihuahua loves the texture, he jumped on it as soon as I roiled it out.", 
    "I love this rug! I was skeptical about buying online due to not knowing what the quality would be. It's great! This rug is so thick, I can barely get the vacuum across it. Good purchase!", 
    "This rug is nice and plush.Beware, though, because I let it sit in its original packaging a couple days...mistake...there was moisture inside and now it smells. So, unwrap ASAP upon arrival.", 
    "I love that this rug is good quality with plenty of shag yet is not too highly piled. It is comfortable yet objects don't get lost in the shag.I've ordered two of these rugs and my only concern is that they do have a smell (some kind of new carpet scent) for the first week or so, which I hope is not chemical related.Otherwise, the perfect bedroom rug for my kids.", 
    "Great color, really plush.... Kids were rolling on it right out of the package. Great color (gray with lots of life to it).", 
    "The rug is beautiful soft and a great value. The only thing is that it has a blueish to it", 
    "The rug was extremely soft, but the size wasn't completely accurate. It was a little smaller than the 4x6 I ordered. It still fits wonderfully in own living room.", 
    "Great quality rug for a great value. Fast shipping. I was hesitant to buy due to some reviews about the color being bluish tint rather than gray. It depends on the lighting. I do notice a subtle difference when the sun is shining on the rug as opposed to alternate lighting. However, it works with my bedroom decor, and I am very pleased. Very plush for the price, but I did put a carpet pad underneath. That makes a big difference.", 
    "I was very impressed from the moment we rolled this rug out. Thicker and more luxurious than I expected. So far after 2 weeks very little stretch and movement.", 
    "Looks and feels great, love it.", 
    "I bought this rug for my daughter's room. It fits and works perfectly for what she needed. This rug is so soft and comfortable, too!", 
    "Put this in my son's room and he loves it; we all do! It's the softest rug in the house and after a month has had no shedding issues.", 
    "The size we got is great, it covers the area we needed it to. We ordered it after having a bad experience with a scratchy wool rug that shed too much. This rug doesn't shed and it's soft and comfortable. It also doesn't show dirt/debris much so you can get away with vacuuming when you want to. We wanted something soft/plush for our baby to grow and play on - and this works great. It's nothing fancy or special but it does what we need it to.", 
    "Just perfect color and quality! I have it beside my bed, very soft to step onto in the morning. Would recommend this rug hole heatedly", 
    "Color exactly as shown with some silvering. This is an extremely thick plush rug! It's gorgeous!", 
    "So plush my kids live on this rug", 
    "The rug is good quality, well made and it feels plush and cozy underfoot. I am very happy with this purchase.", 
    "Very nice pile on this rug. I loved the color of this gray. It does have a hint of blue, which was perfect to change things up a little.", 
    "This is the second rug of this kind I have purchased. Love the comfortable feel this rug provides for a room. I have tile throughout downstairs, so it is nice to have some carpet for my little ones to play on. Seems like you don't have to worry about stains! Highly recommend this brand/style of rug!", 
    "I purchased this rug based off of excellent reviews. If it wasn't so hard to return it I would have. It's not as much of a \"shag\" rug as I would have liked nor very soft. I also thought the color was going to be more of a dark grey and it isn't, its a lighter grey/silver rug. Not exactly what I was looking for. I ordered a non-slip rug pad and returned it because I didn't need it. This rug is just ok.", 
    "All the reviews were spot on with this rug and the reason I bought it. Super plush, no fraying or unraveling of the fibers in the shag. As for the color like other reviewers it does have a slight blue hue to it but that works perfectly for my needs.", 
    "Rug is beautiful in my Grandaughters pink room, just what we were looking for.", 
    "I bought the solid dark grey shag rug for my bedroom and i am satisfied with my purchase a month later. Shipping was quick, speedy. Packaging was secure, rug unfolded well and lay down very easily no tears, or damage. The rug had no smell. We used it almost immediately. The grey is beautiful, a dark grey with specks of a light concrete grey. This rug looks like it costs a lot more than it actually does. It goes so well with my cream curtains, walls and cream and beige bed. I painted an accent wall alongside it Terra Cotta Urn by Behr and the grey rug coordinates very well. Its pleasant to look at against our light wood floors and the color doesn't make the room look cold which was my biggest fear if it was too light grey or small which was my biggest fear if it was too dark. The lighter specks make it look \"high-end\" and it is pleasant to look at, adds a small, cozy, indulgent look to the bedroom. As for comfort, my boyfriend and I have been watching Sons of Anarchy almost every night to unwind before bed and we are all plopped down on it :) I've also fallen asleep a few times on it. I just bought the beige shag for my living room and i love that it has the same lighter specks mixed in. I love how plush these rugs are. I have seen no tangles, no shedding, no rough patches, no smell. A very good buy.", 
    "Excellent! Just as I hoped.", 
    "The rug is attractive. It seems to be mottled in color (or perhaps that's the way the pile falls) so it is not unremittingly and solidly gray. Dog finds it very comfortable and has given up hogging the sofa for this rug sometimes. And barefeet rejoice.", 
    "The rug was better than the photo and a great price", 
    "I got this rug to add to a living room and it is plush and perfect. I love it.", 
    "Very happy with this purchase....it is a beautiful dark grey!", 
    "We wanted a cozy rug for our bedroom in our new house since we have all hardwood floors throughout. This rug is perfect -- plush and comfortable and really chic at the same time. Plus the dog loves sleeping on it!", 
    "Extremely comfortable to walk on. We ended up buying 2 more, different sizes.", 
    "Bought for my college senior. He says it's perfect for the room and they can take it outside and shake it if they have to! Maybe I should send a vacuum too?", 
    "Color is just as pictured. Doesn't shed and can sink your toes in it!", 
    "So soft and color is exactly as pictured.", 
    "Excellent quality. Plush and very comfortable. We are very happy with this purchase", 
    "Everyone said ti was soft and great color, but it wasn't too soft to me and the color was too shiny. I returned it.", 
    "Beautiful silvery gray color, soft on your feet, exact size described. Couldn't be happier. Overstock does it again!", 
    "love this rug, I added a little pad to go underneath to give it a little more cushion, it is pretty heavy and hard to pick up by myself, it collects A LOT of dirt, no matter how many times you vacuum, if you flip the rug and shake it out all sorts of things come out along with dirt, it its a shag rug so I assume this is to be expected?", 
    "thick, comfortable, very dark, though so be prepared for it to look more black than grey.", 
    "I absolutely love this tug. It's colors are true to the online image. It's dark gray with interspersed lighter gray pieces. Ver nice addition to my living room. Arrived rolled-up lengthwise and wrapped in plastic. We laid it out with no crinkles, wrinkles or dents. Very happy and it's soft underfoot.", 
    "It big and soft and exactly what we needed.", 
    "I purchased this for my basement and it was exactly what I have been looking for. The perfect size and thickness. I love it.", 
    "Rug is very soft, and a beautiful, true dark gray color!", 
    "So soft, perfect size, gorgeous color", 
    "Fluffy, comfy... Texture and color as shown on the picture", 
    "It's nice, very soft and even my big dogs loves to lay on it.", 
    "The rug is nice. Not great and not as soft as I had read in reviews. My favorite thing is the square shape that was not available in other comparable brands. Color is dark silvery gray with blue undertones.", 
    "This rug is cozy and comfy to step on. We also ordered the thick pad for extra comfort. The photo appears to be more of a light gunmetal gray, but color is much darker blue gray. It doesn't exactly go in our room but for the price, I will keep it until I find something better.", 
    "This rug graces my living room and cozies it up. It looks and feels wonderful!!", 
    "I really like this carpet, best purchase", 
    "NICE QUALITY RUG. PERFECT FOR THE PLAYROOM.", 
    "does ave fold marks but seems good enough", 
    "Absolutely gorgeous feel. You'll want to walk around barefoot all the time. Carpet is thick and heavy. This is a worthy purchase. Color is true to advertising.", 
    "The color is actually a beautiful dark rich grey and goes fantastic in a teen boys bedroom with reds. The rug is extremely soft and plush (even without the rug pad) and had no smell.", 
    "nice in room with other product.", 
    "We are absolutely thrilled with this luxurious beautifully textured rug. The color is a true dark grey and so soft. Couldn't beat the price either !", 
    "Love. love. love...this rug is so comfy between my toes. Its better than any rug I would have purchased at any retail store. It goes great with my upscale grey matte palette living room theme!!!", 
    "Love this rug... it's not Roomba friendly, but it's a wonderful rug... very very luxurious...", 
    "LOVE this rug! Buying another one today!", 
    "This rug is great. It's plush and comfortable to walk on. It was such a great deal too compared to shag rugs I looked at from other retailers.", 
    "Love it!! Got delivered on time. Matches so well with my lighter grey couch . Pulls the room together really well.", 
    "This rug was so soft and fluffy. Love it!", 
    "This rug was the right price and color....so pluch....i have to keeps my cat off of it. She loves it just as much as i do...", 
    "beautiful rug and very comfy-true to color and has a very lush feel", 
    "I purchased a beautiful comforter that was grey and coral and needed a accent rug. This rug is a perfect size and love the shag consistency. The color us a dark grey and I love it. Could not be happier.", 
    "AMAZING SAFAVIEH SOLID GRAY SHAG RUG 5 STARS, AMAZING COLOR, THICKNESS, HOLDS UP WITH VACUUMING, LOOKS WAY MORE EXPENSIVE THEN IT WAS. PURCHASING ANOTHER ONE FOR A DIFFERENT ROOM.", 
    "No surprises here. Looks just like it does on the website and feels nice on my feet!", 
    "The quality of the rug was very good. It accented our room nicely. The dog loves to lie down on it.", 
    "I read all the reviews before ordering. True to form. Heavy weight, beautiful color and feels great under foot.", 
    "This rug lives up to the reviews. We have been looking for a Shag rug for several months now. The ones we found in retail stores seemed decent, but the edges were not finished making me fear that at some point they would unravel. They all appeared as if they were just cut to size. This Safavieh rug has great reviews everywhere and the edges are finished. Color was as pictured.", 
    "Feels wonderful underfoot and is a nice, classy touch in our bedroom. Love this rug.", 
    "I was looking for a rug to go under my dining room table. The rug is so plush, and doesn't show lint at all. It vacuums very well. I'm so happy with my purchase.", 
    "I ordered this rug so long ago, I had forgotten where I got it from! We have it down in our living room and it looks great, wears well, it's soft, we sit on the floor all the time, it cleans up well, looks great with a vacuum....Love the rug, dealt with a little shedding in the beginning, but that subsided quickly. The color is just as pictured on my screen which is a medium tone grey, not at all blue, more of a brown/grey if you will. I have it paired with light grey chevron striped curtains, teal sectional and a metal hammered coffee table-looks great!", 
    "Amazing, cozy rug, beautiful color! Can't believe the price!", 
    "Better than expected looks great with high quality.", 
    "For my daughter's room. She wants grey - white theme. This worked very well.", 
    "Safavieh Cozy Solid Dark Grey Shag RugWe just received this shag rug and it is perfect for our living room. It came rolled up and took a few days for it to completely relax and for the lines to even out. Other reviews were critical of the color. Yes, the grey rug does have blue undertones, but it fits fine with our living room color scheme. We had a very high-end rug prior and this rug is much more comfortable and does not \"shed\" like our previous rug. I am going to order a smaller second area rug for our entryway, as this is a great product and value!P.S. I have two dogs. One of which has light hair and sheds quite a bit. The hair is not very noticeable and is easily vacuumed out. The dogs LOVE to sleep and rub on the rug!", 
    "Usually we have hardwood floors throughout and are good but we recently bought a home and I was trying to figure out ways to make the living room feel warmer without cranking up the heat. So we bought insulated curtains and this rug! Boy does it make a difference not to put our feet on the cold floor. It matches the décor and it is very luxurious! Our kids love just plopping down on it and watching tv. This was a great buy.", 
    "I love this rug. It enhances my couch set and is very soft.", 
    "Soft to the step, east to clean, no shedding, great added addition to any home", 
    "Love this rug. Looks exactly like the picture. Everyone who comes over wants to squish their feet into it!", 
    "I purchased this item for my granddaughter's dorm room. It is plush and she says exactly what she was looking for. Will definitely buy more items from overstock.", 
    "Had this rug for a couple years now, and it is worth every penny!", 
    "High pile rug, fits my contemporary living room and my son loves playing on it!!", 
    "nice rug, seems well made, for our daughters room so if its not durable we will find out fast", 
    "Lovely, soft, nice color, easy to vacuum.", 
    "Comfy & stylish!Exc quality.", 
    "Feels well made, but kinda rough, not ultra soft but is holding up great", 
    "I bought this rug for our master bedroom and absolutely love it! It is so soft and plush. Does have a hint of blue undertones but that matched perfectly with our decor. If you're thinking about ordering this rug- do it!! You won't be disappointed.", 
    "And more importantly, it fits in my washer, so plush and comfy in the morning!", 
    "We needed a large rug to cover a wood floor and make a room feel \"warm\". This did the trick. We love it. It's comfortable to walk on or sit on, and really creates a homey room.", 
    "It is thick and looks very nice in my guest bedroom. Once you unwrap it and vacuum it and let it breathe it thickens up and the shag stands up. It is a nice color and it is thick and luxurious. Highly recommend.", 
    "Nice rug for my grandson's room, soft.", 
    "nice rug,very plush and cozy", 
    "Great quality, soft and perfect", 
    "I LOVE this carpet!! For the money its a very well made carpet. Nice and comfy, soft...has new carpet smell but I like that freshness. The color is steel grey there is NO blue in it at all! Would highly recommened", 
    "This rug is great - I love this rug. It's shaggie but very soft on your feet. Everyone who sees it has commented on it. Nice accept to your floor.", 
    "Fits perfectly - very true to description.", 
    "This rug is great- looks like it does in the picture, deep soft pile. We put a pad under it & it's nice & cushy.", 
    "This rug fit the bill for my needs and the color was perfect.", 
    "Soft, thick and nicely made. Love the color.", 
    "This rug is very thick and soft. Much more than I expected. After shopping for rugs in the store I was hesitant about purchasing online. I was looking for something deep and plush and having trouble finding the right one. When I received this I was so happy - it is simply amazing and the price was beyond belief for this size and quality. Highly recommend.", 
    "I put this rug in my basement playroom. The kids find it cozy and inviting. Great value for the price.", 
    "The medium if fairly thick...would rate it a 4 star. The larger one is adequate but not so thick so I gave it a 3 star.", 
    "this rug works perfectly for our living room, very soft and cozy for our 1 year old to play on", 
    "Great rug, came rolled and no odor! Wish I had gotten a bigger size!", 
    "Very thick soft shag - arrived squished & flat but as soon as rolled out & quick vac'd it plumped up & has stayed that way for many weeks. Love it so much have added a matching runner & plan to add more as soon as new hardwood floors go in. The runner gets heavy daily foot traffic & still looks as plush as the 1st day. Color is as shown - very dark grey / blackish w/ hints of silvery highlights. I would buy this in any color offered because the quality & 'look' have outperformed my many previous attempts at 'rug nirvana'. Highly recommend!", 
    "As beautiful as the picture, very plush and soft too.", 
    "Looks perfect in my nursery. Good quality and color.", 
    "All I want to do is walk barefooted on it. Feels great", 
    "This is a great buy. I would pay more if needed for this. It looks great and is great quality. Also it is very comfortable and fits pefectly in any large room", 
    "I bought this rug to go with my gray chevron rug, this rug looks more like a mix of navy blue and dark gray so it's not a perfect match but it is still a good rug. My dog really loves it.", 
    "I love this rug and get so many compliments. The grey is robust and the shag is just shaggy enough. Easy to keep clean and still looks new almost a year later.", 
    "The color of the tug is true to the picture. It's a great rug, I've given it 4 stars because I do feel it's a little thin it's not as plush as in the picture.", 
    "Bought two for each side of my king bed...love it when I wake up and put my feet down Soooo nice!", 
    "Very pleased. Nice dark gray to hide stains and kids love it in the new basement.", 
    "This rug completely exceeded my expectations! It is super plush, feels great underneath your feet, and should well very well! Also, after getting it on sale, I feel it was a steal. I am very grateful! FIVE STARS", 
    "This was a great purchase! The price was amazing and the rug is cozy! It fits perfect in our daughters playroom. The only down side was that it did smell for about a month! Would give it 5 stars but it was a bummer that we couldn't go into that room for a while! Now that the smell is gone I would give it 5 stars!", 
    "I really love this rug. I purchased both the rug and a runner for the hallway. Very soft, looks good, lots of compliments.", 
    "Nice and thick. A good buy at this price point. The other reviewers were correct in that this is definitely more blue than gray. If it weren't for that I love it.", 
    "This rug is very soft and good quality. The color is darker than it looks and a little on the steel blue side.", 
    "This is a great rug! Coupled with a rug pad it is very plush. My grandkids literally use it as a bed when napping. You won't go wrong if you purchase this product.", 
    "i'm quite pleased with this purchase. i shopped for some time to try and find the right balance of quality, style, and cost... i think i nailed it. i've had it for a couple of months now and am super-pleased.", 
    "Great quality but hard to vacuum because it is extremely dense", 
    "Nice color...good quality", 
    "Holding up well! Wondering only how to vacuum better for you see nothing as it gets lost in this plush shag.", 
    "This is the second one i have ordered. Love it. Great quality, soft, think, beautiful color", 
    "I was pleasantly surprised at the quality and comfort of this shag rug. Should have purchased two instead of one. The price was right.", 
    "Beautiful color, I put it in the mater bedroom it looks wonderful", 
    "I LOVE THIS RUG. JUST LARGE ENOUGH TO SHAKE OUT IF I DON'T WANT TO VACUUM...VERY SOFT TO WALK BARE FOOT ON.", 
    "I purchased the 8 x 10 size in this rug. It came rolled and wrapped in heavy plastic. It unrolled and flattened well, just took a couple of days on the floor to get it to lay flat. The rug is beautiful, soft and very thick shag style rug. The color is as described, a dark steel grey. I have had it for about 2 months and have nothing bad to say about this rug. Great buy!", 
    "Wonderful gray color and texture", 
    "Better than photo. Very soft and rich looking. Many compliments received.", 
    "Very happy with this purchase. It looks modern and not cheap. We have had it for awhile now and it still looks great.", 
    "I was so pleased with the quality of this rug. It arrived in a timely manner and looked like the picture. My surprise was how plush the rug is. Love walking on it barefoot.", 
    "Perfect size and texture. Good density.", 
    "really nice rug at a fabulous price.", 
    "So comfortable and so far working out great!!", 
    "Its not a dark grey color more blue. That's the only fault with it - otherwise it would be perfect.", 
    "This rug is fantastic. We bought the 8x10 size and it has made our living room look so amazing. The quality is great and the color is perfect.", 
    "This is a great rug. Soft, no smell when unrolled, thick, non-shedding. While it is dark grey, it's more a blue grey then graphite grey, so I doesn't quite match with my other items in the room, but it's close enough and nice enough that we didn't send it back. We still love the rug, just wish it were less blue-grey.", 
    "Very nice rug....thick and nice right out of bag", 
    "great quality super soft and luxurious on the feet- ive gotten many compliments", 
    "You will love the feel of this rug under foot. It is thick and feels wonderful on your feet. The color is just what I was looking for.", 
    "Soft, beautiful color and so thick. I actually love it, worth every penny!!!", 
    "Nice shag rug way darker than picture. More charcoal color. Nice texture.", 
    "My most favorite rug I have ever bought!", 
    "Well made thick rug. I purchased the next to largest size I think it's 14 x 20 and it looks great with the folds from delivery disappearing within a day. The color is a deep charcoal grey which depending on the light (light bulbs vs natural daylight) in the room can get a denim blue appearance. I highly recommend.", 
    "Love the quality and thickness of the rug but very dark grey is closer to black! Also rug was shipped in a folded square instead of rolled; so creases where very noticeable! Since rug back due to color and creases!", 
    "Great color. Thick and comfy to walk on. Does not shed all over the place like other shag rugs I've purchased. Happy that I bought this.", 
    "These are the best rugs I've ever owned! Thick soft pretty !", 
    "This \"rug\" is more like a \"runner\" as it is so long & narrow. My daughter likes it for in front of her closet. Make sure you double check the dimensions before you order.", 
    "I purchased this rug after looking in retail stores based on the consistent reviews and was not disappointed. The rug is very thick and feels plush and silky on my feet. This was purchased for my bedroom and is a rich charcoal gray. I do not see any blue tones as others have reported. The rug arrived rolled, with no issues. It looks and feels much more expensive and is well worth the price.", 
    "Pretty sad to order a circular rug and get a rug with partial straight edges, More sadder than that is that I gave this company a 2nd chance and received a replacement and that one had some straight edges to it too. : (", 
    "Thick & Comfy I have them in my bedroom. Love them!", 
    "Super soft, very good quality!", 
    "After getting new wooden floors, I missed having a soft floor to do my evening back exercises. My wife found and purchased this rug for me, and it is softer and thicker than it appeared to be in the online photo. I actually look forward to lying on the floor last night, hanging out, watching TV, long after my exercises are completed.", 
    "Absolutely love this rug! Like almost any other rug, it has a slight smell when you first open it. This goes away within a few days. The little bumps from it being rolled up also go away quickly. Like others have mentioned, it is a very cool grey color... a bit on the blue side. I would never call its color \"blue\" in a million years. It is not a warm grey. Very soft, feels great under my feet. Bought for a spare room that I use for ironing & office, so it won't be getting much traffic. Highly recommend!", 
    "The color is clearly identified as \"Dark Grey\"but it looked more medium-colored in the photo, so I ordered it to match my color scheme. The rug ended up being darker than what my monitor shows, and I didn't like it in my family room. Luckily, I am furnishing a new place and I tried the rug in another room, and it was perfect for the space, with cream leather furniture. The pile is nice under the feet !", 
    "This is a great rug for the price, but I should've known since it's made from poly-fibers that it would stink. Just didn't realize it would stink for this long! We've had it for over 2 weeks now and it's still off-gassing. I leave the windows open all day and night in the room and the patio doors open all day, and still it smells as soon as you walk into the room. Bleh.", 
    "Very nice and plush. Will reco mend", 
    "Very soft and a dark, rich gray color. Highly recommend.", 
    "Love this rug. I was nervous after reading others review but decided to order and give it a try. Great color,soft,thick. Just love it. Really did not have the strange odor as others said, roll marks laid out after a few days of being place. My dogs love it too!!!", 
    "Little expensive but well worth it. Very cozy.", 
    "This rug is really plush. It does take a couple days to sort of settle in. The color is a slightly more bluish-grey, but it isn't blue blue. It's more of a cool grey than a warm one. It is very comfortable and easy to vacuum. All of my visitor's rave about it. I would happily purchase this rug again.", 
    "I love the rug. It is so thick and soft.", 
    "Adds a 80's flair to our master suite.", 
    "This is a soft nice quality rug. Color is more blue tone.", 
    "This is a huge rug and very reasonably priced but it doesn't look cheap. We love it.", 
    "The color is exactly what was shown on the website. The rug is very comfortable to walk and sit on. I am very pleased with this purchase.", 
    "This rug is super plush and I love the feel under foot. Is modern and goes great. Is a very dark grey agree w other reviews with a light blue undertone but mostly a dark battleship grey", 
    "This is probably the best rug I have ever bought. I love shag rugs, and this one is beautiful. Very plush and so nice under the feet. I would definitely buy this rug again.", 
    "Lovely Dark Grey rug with blue undertones. Looks fabulous and very soft.", 
    "Love the colors, go with any color scheme, top quality craftsmanship, do hug the floor nicely and clean up well, just the right size for the are, we purchased the runners, overall great quality and color", 
    "love this carpet.I could not pick better color then this one!!!", 
    "I have purchased this rug in many colors and many different sizes, you cannot beat the value of this rug. It is thick and plush and looks great in the home. I would recommend that you use a rug gripper under this item. Great Value..", 
    "Nice quality. Wish it was a little brighter the picture made it look alot more bright and colorful it's more dark grey then light.", 
    "This is a great rug. I even ordered another to compliment it in the room. It's a snag but not too bushy.", 
    "Received these rugs quickly. These are charcoal gray with really nice highlighting. Much nicer than pic. There was no smell and the 2 3x5 rugs came rolled, not folder. I laid them on the bedroom floor and one had to be rolled in the opposite direction briefly from what it originally was rolled to get out the creases, but not a problem. Good value at an excellent price!", 
    "Only negative is it is very difficult to get to lay flat. It has been unrolled and laying on the floor, being walked on and after 2 months it still has \"ridges\" from being rolled up.", 
    "Great color, soft and full shag material makes it look much more expensive than it is.", 
    "I ordered 2 different sizes of this rug to go in a bedroom. The first one arrived and was a beautiful dark gray color, then the second rug arrived two days later and it was completely different!!! It was BLUE, no hint of gray in it at all. Very disappointed with overstock. This is the second time in 6 months that I placed an order and received a product that was completely different than I ordered. At Christmas I let my daughter pick out a comforter set for her new bedroom. When it arrived it was also a different color comforter. The one she ordered was white,black, and blue and the one we received was white,black and green. When I called to set up a return I was told that because they were out of the one I ordered they sent me the green one!!! Very frustrating to search and find exactly what you are looking for, to only be disappointed when it arrives!!!! Order with caution.....", 
    "My daughter wanted a white faux-sheepskin rug for her room, but I thought that was a bad idea, so we got this one instead. It is still long-pile and cozy on her feet, and the color is a rich grey, that will hide most things. A good choice!", 
    "Rug is easy on the eyes and soft on the feet.", 
    "great rug, had to return it too plush to open doors over it :(", 
    "Very soft rug and works perfect in my son's room. The rug is more of a blue color, but still worked.", 
    "This rug feels soft and plush. Great for the price.", 
    "Love this rug, it's nice and thick and the color is awesome.", 
    "Hard to vacuum but it's great. I do see how some could say it has a slight blue tint in the right lighting but it's definitely gray. Also being a synthetic I'm not sure how long it will last.", 
    "It definitely caught me off guard when I first rolled it open as it appeared shiny to me. Once you roll it out and shuffle the shag around it looks better. It's soft enough to sit on but wish it was softer on the skin. For what's it's worth, this is the best priced shagged rug I could find for the size. I'm growing to like it more every day.", 
    "Looks just like the picture I love it", 
    "I ordered the dark grey, and have had it for about 3 weeks. The rug had very little odor and it rolled out beautifully. The color is beautiful and the rug feels great on bare feet. I have this rug in my living room, but plan on ordering runners for the hall and bedroom since I like it so much!", 
    "The ru is very soft and pretty. Feels great on bare feet!", 
    "Bought this rug for my bedroom. The color is perfect. Well made. Very happy with this purchase.", 
    "Love the rug! Color is as described and how it looks in online picture! Slight odor after unrolling, but that appears to be gone now. Very luxurious feel to this shag rug. I wasn't disappointed!", 
    "Very nice rug. Very soft. In the picture it looked about 2 shades lighter than in my house. So if you are putting it in a darker room then expect this to be pretty dark. Almost like a charcoal black. I had dark couches and so the rug color looked like it was creeping onto my sofa so I had to return it. It was a little of a hassle to return since this item was so big and you would have to fully wrap it up. I opted for the silver version of this one. Hope this review helps someone that is on the fence about this rug.", 
    "Looks very similar to photo. Might have just a hint of blue in it, but not much. Thick shag, good quality. Corners laid flat very quickly. LOVE!", 
    "Love this rug. It has a very modern feel to it. It is soft and feel nice on my feet.", 
    "This rug is a beautiful dark grey and very thick and cushy. I put it at the end of our bed and it looks great with my new comforter!", 
    "Beautiful quality. Soft! Love squishing my bare feet in it! Color is lovelymore of a Charcoal Gray (very dark gray)! It has no chemical smell and after just a day all the creases from being rolled up and shipped are gone! The quality of the rug is amazing when you look at the price. You are not going to find this rug in any store for that money! Love it!", 
    "The rug comes rolled (obviously), so the edges will be curled up at first. But the rug completely flattened out in about two days. It's beautiful, soft, and fluffy! It feels great under my feet when I get out of bed in the mornings. Two thumbs up.", 
    "This rug is very pretty and looks just like it did on the screen", 
    "Was delivered at lightening speed. The quality is very nice. Super plush. Color is slightly more gray/blue than photo but that didn't really matter to me. Overall great purchase.", 
    "I'm very happy with this rug. Perfect match. Very soft. No regrets at all. Buy it now. Happy happy", 
    "I am very happy with the quality of the grey shag rug. It does look exactly as described and shown in the picture. On the other hand, I am a little disappointed because I ordered 2 of the same size and color when placing my 1 time order, and received 2 different sizes when delivered separately. The smaller rug will work, but I feel there should have been a price difference.", 
    "it is very soft and durable", 
    "This rug looks just like the picture. It's thick and doesn't shed. Has a slight chemical smell but that's wearing off after a couple of weeks.", 
    "We've had this rug for 8 months now and it has worn very well. Vacuums easily even though it's a shag rug. My husband wanted a rug he could stretch out on and nap and he's been happy with the thickness of this one, even without a pad. My one caveat is the color. It's not a neutral grey, in different lighting I see a bit of purple and sometimes blue. It's a very attractive grey, unfortunately we're going to have to replace it because the color just doesn't work in our room. Someone said it is a cool grey and I would agree with that. I recommend it but check out the color first if you can. I'm ordering the same rug in ivory and crossing my fingers!", 
    "carpet is everything described. Looks great in my family room", 
    "Exactly what I wanted, color, density, and size. Looks like picture and fairly thick shag, but you can still vacuum. Some new carpet odor but it dissipates after a few days.", 
    "Got this for my son's dorm room and he loves it.", 
    "This is a great quality rug. A nice charcoal grey and comfortable under your feet.", 
    "Very plush and high quality rug. Thick.", 
    "Looks more like gray average carpet cut into a rug. We wanted a soft shaggy feel so we returned it. Color was darker and dull too.", 
    "Exactly what I had been looking. True to ad. Nice quality rug.", 
    "The order process took a little longer then I wanted, however I did order it around Christmas. I bought the 8.6 x 12 area rug to surprise my girlfriend as an accent piece with the new living room furniture we just bought. Rug was package great (no damage whatsoever), surprisingly it laid flat within a day, and the 1.5\" pile feels amazing on your feet! Can't forget to mention that the pets never want to get off the rug either. If I needed another rug for any room in my house, I'd buy this brand!", 
    "Love this shag carpet, the only thing is that you can not forget to get the slip pad, the carpet has no grip.", 
    "Great looking rug! Arrived on time. Feels great on my feet! Great blend of grays!", 
    "Very plush for this price point. It has a smell to it but only for a few days.. I didn't feel I needed to even order a pad for underneath. Very satisfied with this product.", 
    "After dealing with shipping and tracking issues with the rug, which Overstock.com completely stayed on top of (awesome customer service), I am happy to inform that the rug arrived yesterday neatly folded. Perhaps the scariest thing about ordering furniture online is, unless you physically inspect it from a store and try to price match online, you really are taking a chance on what is going to arrive at your doorstep. I read some of the reviews prior to ordering the rug. I don't believe I'm unlike other online shoppers when I write that a negative review carries more weight than a positive one. I don't necessarily want to dispel some of the reviews left but I do want to share my experience.*The smell was atrocious* - While there is an odor that emanates from the rug but it's nothing that I would consider atrocious. It's completely tolerable and have a feeling the odor will quickly subside.*The rug has a hint of blue* - Instead of using tan tones, we use gray as the neutral for our house, hence the purchase of this gray rug. Once I opened the rug it was quickly apparent the rug did not have any hue of blue, slate, periwinkle or any color associated with anything other than gray or gray tones. *Not plush enough* - This rug is plenty plush in my estimation and does feel great when you walk on it without shoes.*OK not fantastic* - For the price I paid for a 9'6\"X13' rug, I guess I'm okay with OK.When we convert our children's rooms, we will look for this line of rugs again and hope to replicate the same experience, tracking aside of course.", 
    "I have this rug for a month now. It looks just as good now as the day I rolled it out of the package. The color is luxurious and the sensation is amazing. It is plush and very comfortable beneath your feet. The arrival time was on point and no damage to the product. Kudos to the company.", 
    "This rug is really great for the price. It appears to be decent quality and looks like the picture. It looks great in our home!", 
    "Bought for my granddaughter's bedroom, and very happy with the quality and feel of these rugs. No shedding and are thick and very soft. She loves the feel of them so much, she is laying on them to do her homework....prefers that to her desk or bed! Very nice quality!", 
    "It's plush definitely needs a pad under it. Very harsh chemical smell took a few weeks to disipate", 
    "Good quality!! Very thick!! Would recommend!!", 
    "This is a nice product, but be aware it will shed. But if you like the soft feeling on your feet this is the rug for you.", 
    "Good quality the color is just as described there is no order at all. Perfect condition fast delivery.", 
    "Love this rug. It's soft, plush and looks great in our living room.", 
    "Soft and full shag carpet. My infant grandson loves to feel it. Beautiful rich color that is more gray blue in color. It matches Sherman williams' serious gray color. Very pleased!", 
    "I received the rug it was in a roll it was not folded. I rolled it out and just weighted down the ends, after a few days it was fine, the color is gorgeous it's soft and I'm very happy with it. Good purchase.", 
    "This is a gorgeous rug that is very soft, thick and plush. The dark gray color is true to the photo shown on my monitor. I did not notice any bluish tinge as others have mentioned. I'm very happy with my purchase!", 
    "Nice color, soft cushy feel, particularly on the supreme dual surface rug felt pad. I read some reviews about wrinkles. Mine came rolled up and there were a few wrinkles that took a couple days to press out. Very Happy! We'll see if it stands the test of time and vacuuming.", 
    "I ordered this rug hoping against hope that it would be an amazing addition to my living room. It was everything I was hoping for when I ordered. The color is wonderful! It is different colors depending on where you are in the room. It varies from a silvery grey to a dark grey. Thick doesn't begin to describe the pile on this rug. My one and only complaint is that due to the thickness it is hard to vacuum. I would definitely buy it again.", 
    "great under bed accent. Looks great with white/neutral colors!", 
    "No regrets! Love love love this! Came on time and quick! More stunning in person then on website. Love buying on Overstock!", 
    "Good quality. Color as described. Fast shipping.", 
    "My daughter loves her new rug. It's lush and comfy. Great Smokey gray color. Will leave a slight odor for a couple of weeks, just allow it to air out.", 
    "This is the 4th rug, I've bought for this space and I finnaly got it right. Very soft underfoot and great to look at. It's not in a high traffic area, but it seems to be holding up fine.", 
    "Looks great in our room and feels soft and fluffy to walk on. My kids love to lay on it to read over sitting in a chair.", 
    "This rug sit under a black table with grey and black leather chairs and looks wonderful. Lays perfectly after a day after being shipped rolled,", 
    "This rug is everything and more that we wanted for our living room, in fact we liked it so much we bought another one just like it for our family room. It has been getting great compliments from our family and friends. Thanks Overstock for having it on your site.", 
    "It's very comfortable, had a slight smell to it for 2 days then it went away. My toddlers LOVE rolling around on it. It doesn't shed at all and is easy to vacuum. Love this rug for my family.", 
    "I'm pleased with this rug. It looks good in a bedroom and is warm for the winter.", 
    "At first, they shipped the wrong color. They were extremely fast, however, at sending out another shipment with the correct color. They didn't even require me to have the other rug returned first. They also made it very easy for me to return ship the wrong item at no cost.The rug itself is very nice. It's thick and plush and the perfect shade of mixed grey. I wish that my large grey area rug was the same kind!", 
    "This rug looks solid in color in the photo and it is called \"solid\" in the title but it is two tone. It also is more blue than grey so it does not go well in rooms with true grey. The rug is super soft, thick and cozy. It did come folded and the folds are bumpy to walk over. We exchanged the rug due to the color so I am not sure if they would have flattened out. Overstock has excellent customer service!", 
    "Considering that the price of rugs, especially ones off this size, can easily exceed $*,***.. this specific product is the best bang for the buck I've come across. The quality of the shag is everything you'd expect from a rug that costs double or triple the list price for the Safavieh. Most definitely recommended..", 
    "I love shopping at overstock! Everything I have purchased has been great quality!This rug is amazing too:)", 
    "This was my first time ordering from Overstock.com, and I was over the moon at the quality of my beautiful new shag rug! The quality is exceptional, as well as being super stylish...the Safavieh. The color mix of the rug is perfect with my furniture as well as the rest of the decor. No one can resist testing the new rug without their shoes! It delivers comfort as well as style.", 
    "I expected the quality to be a little better. It wasn't bad for the price, but the picture made it look more plush.", 
    "ove love love it! I gambled and trusted the online posts and I am wowed... the color is definitely a darker grey with a little blue making it a slate color that really ties my living room art and furniture together. It is thick but soft and it came rolled up because of it's size so no issue with folds that some others reported. very happy!", 
    "The rug arrived quickly. It was rolled, so just a few creases, but I am hoping they will flatten out as we use it. The color was exactly as described. The rug was dense, with no backing showing through. Nice length pile. The price was amazing. I would definitely recommend purchasing this rug.", 
    "heavier & better quality than I would have expected- seems like it will be durable- color is more on bluish-green side- or, would would with blues & greens in decor, not a true grey- this is good, for my needs", 
    "This rug is very soft and plush. The gray color appears to have sparkle to it and really shines in a room. It takes some time to flatten out after laying it down but is beautiful in my living room. It is difficult to vacuum because the fibers are so thick but very pleased with my purchase.", 
    "This rug is really cozy and comfy! I definetly recommend this rug!", 
    "Exactly as described, solid dark grey, super soft feel. We love this rug!", 
    "This rug is super thick and shaggy and does not look flat all the time when you walk on it. It maintains its shape very well. Love the size and works exactly as I expected based on the description.", 
    "Dark gray color is really nice and feels great on my feet. I wish corners were done a little better. Nevertheless a great product and highly recimmended!", 
    "I was a sceptic purchasing a rug I couldn't touch but this rug takes the prize. The color advertised was exactly what we received. The rug is super soft and medium in thickness. We wanted a rug we could play with our 16 month old toddler on and this was the perfect purchase. Do buy a carpet pad.", 
    "I am very happy with this rug. Easy to vacuum, my baby loves playing on it because it is so pufy and soft. The color is beautiful! True to the picture color! It leaves some fabric smell first week or a little more than that but after that it goes away. I say this rug is a great deal and amazing buy!", 
    "I didn't think that I would but I really don't mind this rug. It is not the rug that I really wanted, but with a puppy and 3 kids in my house, the one I really loved had white in it and would just be too stressful to keep clean and pretty. This rug goes with what I had in mind for our family room and suits that space quite well. The colour is really nice. There is some odour upon unrolling it but that is fading pretty fast. I have found several of my children lounging on it quite comfortable, so I think the shag is going over well with them. ;)", 
    "I really like the look of this rug. I have hard wood floors so this keeps my feet warm in the mornings.", 
    "The rug was delivered on time, came rolled and quickly conformed to the floor, it is light and dark mixed gray, but goes perfect with anything blue, the color is beautiful, wish i had this all over my house, love how thick, soft, and luxurious it feels on the toes, very well made. Love it.", 
    "Large and soft. Perfect rug for our bonus room. The rug contains different shades of grey. It goes from light to almost black. Gives a clubhouse feel to the room. Great price for the size and quality.", 
    "I love this runner ! It feels so nice under your bare feet.The color and runner itself look of high quality.I'm very pleased (:", 
    "A beautiful shag. Very cushy on the feet. Super comfy to walk on. Nice size for the price.", 
    "After several weeks of having this shag rug I can say that we love it! It is thick, soft, does not shed, and we enjoy laying and playing on it as a family. The description said it is a charcoal grey and I will agree, it does seem to look different at various times of day when the sun is shining. I have noticed at different times a deep blue tent to it . It is a longer shag. I did not notice any smell or wrinkles in ours when we relied it. We ordered the large size and it does not seem to move around even when my kids are playing around. Overall, we are pleases and recommend it.", 
    "I bought this rug to go in the guest bedroom under the bed. It is really soft on your feet. The carpet is thick and you can not see the mat underneath even when you run your hand over the fibers. The color was exactly what I need for the room I was decorating. it is a rich dark grey. The price was perfect. I would definitely buy this carpet again.", 
    "Great deal, good quality, fast delivery, color was true to photo", 
    "very pleased, arrived quickly , very soft and thick rug for the money, great buy", 
    "This rug is nice and plush and made my toes smile, but 2 things about it I could not get past. First, the color really is a dark blue like some reviews say. I read these before I ordered but was hoping they were anomalies and it wouldn't look blue to me. Well, I was wrong. It looked very very dark blue/sapphire color against my espresso built in and beige sofa.Secondly, it smelled - and strong! So much so that if we kept it my wife demanded I put it in the garage for a couple days first so the kids weren't inhaling the fumes of the chemical smell. We didn't get that far because I ended up returning it.If you order this, keep the plastic that the roll comes in because you might need it!", 
    "This carpet exceeded expectations. Great value. Plush and thick. I assumed I would receive the normal nice shave but not thick. It feels like their is padding underneath but there is not. I wish their had been more colors available.", 
    "This area rug is just what I was looking for. It is. Super plush and cozy. The rug is true to color ias noted in the description. I would definitely recommend this rug to others.", 
    "This rug shipment arrived so quick! After rolling it out, the carpet was curled up on the ends from being rolled up in the package but it flattened out within a few days. Very happy with my purchase!", 
    "Rug arrived on time as expected. Unlike other reviewers have noted, this rug arrive rolled up and with no creases. Happy with purchase.", 
    "Love love love this rug! It is so soft and worth the price. .more than I expected", 
    "Bought this for our nursery and I love the look. Great color in our gender-neutral space. After buying a synthetic rug for the living room, I do wish these fibers were a tad softer, but certainly not enough to give the rug a bad review - it looks and feels great.I did notice the slight smell some other reviewers mentioned but I laid the rug down as soon as it came and it was completely gone in a day or too - and the fact that it arrived folded rather than rolled didn't affect the rug in the slightest. There wasn't a single crease when I laid it out.Going to buy a rug pad for it for added comfort.", 
    "I was holding my breath on this rug due to the \"blue undertone\" color comment I noted from a review. Not happening with my dark grey rug; it's just what I wanted color wise and is so soft & thick. The only problem I have is my 3 dogs also think it's great, \"wow, what a soft sleeping spot\" or some dog talk like that. But no sweat, it easily fluffs right back up so we're all happy:)))) Came quickly, was rolled (NOT folded) and looks expensive. Love it!", 
    "This rug was not as expected. I saw what I thought to be this rug in a Homegoods in my area and they didnt have the right size so I ordered it online here at overstock. This one that I ordered was not as soft and metallic threads all through it. I was hoping more for what the pictures were showing which was a flat gray color. $12 to send back was worth the try though.", 
    "Love this Carpet ,the color in grey is so beautiful and goes with everything.it was just as described. Love it !!", 
    "My husband commented this was his favorite of all our new carpets to stand on. This amazed me as I just purchased a very expensive silk rug and he prefers this inexpensive yet fashionable carpet. He never comments on items such as this so it is a real testament to it's quality.", 
    "What a great rug at an awesome price! Is perfect in my living room. Came very quickly and the ends didn't roll up flattened out right away . Would order the mat for underneath so it doesnt move", 
    "The rug is very nice and great quality. Came in a reasonable amount of time. However it is more blue coloring than it is grey. I am ok with either color since both go well with my living room but in the light it's more blue.", 
    "Love it. The lumps have flattened out, the new rug odor has gone away, it is simply gorgeous. Makes our dining room elegant instead of hodge-podge. I was extremely worried about the color - it's perfect. Looks just like the pic, at least on my monitor. Would not call it dark gray, more of a medium. Silky soft, very very thick. Gorgeous.", 
    "The rug was not as soft as I would have preferred. It collects dirt easily and is very hard to clean thoroughly even after shaking it out. It commended the room well, though.", 
    "This rug is very plush, perfect for my bedroom. Warm and cozy on your feet first thing in the morning. Very nice to wake up to!", 
    "I was worried about the color but it was pleasantly surprise. The color was dark gray mix with light gray. It looks great and the shipping was fast!", 
    "Love the color, heather grey, with light to very dark. No pad under it yet but it is the softest pile I've had. The long pile softened the rooms hardwood and sound. Couldn't be happier with it.", 
    "Before buying this area rug I looked at several others. The color is exactly as pictured. Additionally it is super soft and very thick. The pile is a bit longer than I expected but that worked out perfectly since I wanted something a bit longer. Beautiful rug and everyone who has seen it loves it.", 
    "This rug is a beautiful color and style - exactly as shown in the picture. It has a nice sheen to it. Extremely soft and cozy - a pleasure to sit and lay on... Our favorite rug!", 
    "Read the reviews prior and was satisfied with the quality of the product. Some people said it has a bluish hue but I think any gray item can have a blue hue in diff types of light. It is very plush and cozy and so far has been very durable.", 
    "This was a new experience for me, ordering a rug on-line. I was not disappointed. This rug is very, thick and comfortable. I like the color which is a blend of grays. It works perfectly in my living room. Very good quality for the price!", 
    "Perfect for putting under a coffee table, super comfortable and classy.", 
    "Color is more on the bluish side, not as gray as it appears in the picture but so PLUSH! Great value for the price.So plush in fact that when I dropped a hand full of screws to a piece of furniture I was putting together on it, I had trouble finding them...lol", 
    "I waited for a month with this in my cart before deciding to purchase. The rug is stunning. Thick, soft and feels amazing on the feet.You cannot see through the pile its so thick. The color is a warm grey with the slightest blue undertone. I am so happy with this rug that I am going to buy the same in a runner. Dont hesitate.", 
    "Very soft and thick, feels warm on our feet in front of our fireplace, the gray tends to blue tones but is very rich looking. We also bought the hall runner and they both keep the floor warm and quiet", 
    "I wanted to like this rug but in person it was UGLY. Scratchy and not soft and made our family room look like asphalt or a driveway. Was so glad to return it but I wish we hadn't wasted the money on return shipping/restocking.", 
    "the look and feel was nice/quality - but not \"dark\" as described", 
    "I can't believe that this rug hasn't shed one bit! Very soft and cozy to walk on. We are very happy with what I would call a truly dark grey rug.", 
    "Even better in person. Great quality and the color is perfect.", 
    "Love this rug - Excellent quality for the price - nice dense pile", 
    "I wanted a gray runner for a place on our hard wood floors where the dogs slip and slide every day. This rug is the perfect one! It's pretty and it stays still and the dogs love NOT slipping every day.", 
    "Was a great product for the money. Yes go on and place your order.", 
    "I bought this item because of the value, style, and the great reviews. I am not disappointed! It looks great in my living room and is very thick!", 
    "It's definitely a \"silvery\" rug. Beautiful, low shag. It's not thick and soft like some others I've seen at ****** and places, but the shag is great for what I wanted.", 
    "Perfect size for under the sofa and good quality. Exactly what was expected!", 
    "Liked the rug. Order was delivered as promised. color was as depicted and expected from the pictures", 
    "exactly as it appeared on line. Received in timely fashion. Plush and comfortable to walk on. Does not shed.", 
    "Purchased as gift and happened to be there when rug was delivered. What a buy! The shag is dense plushness. Feels so decadent under your feet. Ordered one for myself.", 
    "I was worried about the quality of this rug at such a reasonable price. i received it yesterday and was so happy. It is exactly what I was looking for and it is so soft and beautiful.", 
    "I absolutely love everything about this rug from the color to the material. It's absolutely gorgeous and everyone loves it. It goes perfectly well with my cream couch which i also ordered from overstock! Definitely buy!!", 
    "This is a very well made shag rug. Believe it or not, I haves machine washed it 4 times with no ill effects. Unfortunately my dog loves it a little too much. Hence, all the washing!", 
    "The color is very nice and the shag feels great on bare feet.", 
    "My family loves this rug. It is incredibly soft and color is a beautiful grayish blue.", 
    "Love the rug! It is beautiful but the color was a little darker than I was expecting from the picture.", 
    "This rug surpassed my expectations for the price. I bought it for my Grandson's nursery, and it is soft, thick and luxurious.", 
    "There are a variety of grey threads in the shag, which give the rug a look of more texture and visual interest since it doesn't have a pattern on it. The pile is longer than I expected, but it really is nice to sink your toes into. My puppy loves curling up on it, but beware if you have pets! She decided to christen it the first day, and it was an obnoxious 5 day process to clean the spot. Shag is not a great option if you are cleaning up spills and accidents often, which I learned the hard way. The little vacuum I use on my wood floors works well on the rug, too, since you can't use a vacuum on it that has a roller brush.", 
    "This is a soft, shag rug with a pretty smokey gray color that is a great value for the price. It is pleasing to the eye and the touch and works great as an area rug in my living room.", 
    "It looks great in my living room. Receive complements already! My cats love it too!! Very good buy !", 
    "Absolutely love this rug! Color is rich and texture is plush....it's just perfect in the room I wanted it in. This rug could easily go in any room and look great. I'm so thrilled I ordered it and that it actually was delivered in two days!", 
    "I love this rug. Nice texture and I looks nice. The only problem is it is darker than I thought. It Is gray but looks almost black in some places. I wanted something lighter in color. Kept it, though, because it looks and feels good.", 
    "This is my second safavieh shag. I had the ivory one before this, both were gorgeous, soft and luxurious for about 6 months then you start to see your traffic patten and the rug loses its soft, silky quality in those areas and looks rough. I'm not sure other rugs are any different. I usually replace my LR area rugs after about two years . I have four people, four dogs and two cats using and abusing them regularly. It spot cleans well. Make sure you vacuum it with the brush high or you'll fray the ends of the rug. I did that to my first one.", 
    "I bought this rug to go in my bedroom at the foot of the bed. It is perfect. Some of the reviewers have said it is blue or has a bluish tint to it. Mine is definitely gray, in the charcoal, with some shadings of lighter gray. It is lovely. We recently painted our bedroom with an accent wall of dark gray and the other three walls a couple of shades lighter gray. The rug fits perfectly and looks nice on our wooden floors. The price was excellent. I had looked locally, and a rug this size of this quality was at least double the price. I also did not have a bit of trouble with any odors, which lasted just a few hours and was not overwhelming in the first place. I opened the window, let it air out and, pouf! Odor was gone.", 
    "This is a great rug and the color is wonderful. After I ordered I worried it may be too dark in my bedroom, but it was a great decision and every friend that comes over walks past the bedroom nd comments on the \"nice rug\" and asks where I bought it.The corner I walk past still sticks up a bit after shipping but is getting much better at lying flat. I highly recommend this rug.", 
    "I was looking for a rug that my kitties couldn't \"shred\", which they have done to my wool area rug in my bedroom :(....THIS rug fits the bill....EXACTLY.....not only \"kitty-proof\", but GORGEOUS, as well!!....Adds a real elegance to my soft, rather feminine bedroom....really \"anchors\" it!!!.....Looks like I paid MUCH more!!!! :)", 
    "Based on reviews I expected this rug to be of good quality. I was not disappointed. It was even softer and more plush than I thought it would be. Looks great in baby's room!", 
    "MY GRANDDAUGHTER LIVES WITH ME AND SHE POSITIVELY LOVES THIS RUG. IT IS THE SAME QUALITY AS MY RED ONE. LOVE, LOVE, LOVE IT.", 
    "What you see is what You get!! This rug is beautiful and blends perfectly with my gray leather sectional. The rug was delivered one day after oderering and the price was unbelievable for the excellent quality of the rug.I would highly recommend puchasing this rug I doubt if you will find a better deal any where else. Thanks overstocked for completing my new room at a affordable price.", 
    "I am so happy with the quality and looks of this rug! The color is beautiful. Does not show dirt (I have several dogs walking and playing on it daily) and it adds warmth to a room. Highly recommend this product!", 
    "These rugs have a really good feel. They do take a while to lay flat. Charcoal gray hides everything.", 
    "Perfect rug for my area , was not disappointed at all Large , soft, color was exactly as shown , I'm thinking about ordering another one for dinning area ajaycent to the living area. I think they would pull both rooms to together , Love the look!!", 
    "I purchased this rug for my living room, the true grey color is perfect and goes well with my modern decor. Quality is amazing! Shipping was fast, I received my rug 3 days after ordering. Would recommend to anyone. As a matter of fact, I will be ordering an other one.", 
    "Bought this rug for my son's nursery and it is a great size! The only reason I gave it a 4 is because it was much darker than I thought it would be. Still works great.", 
    "Very happy with my purchase. I read the reviews beforehand so I was aware that the rug may have a bit of a blue tint to it. It definitely does! I would describe it as 'slate'. Nice pile, cozy and great for the price.", 
    "You can't go wrong! great bang for your buck. Looks great and feels even better :D I get a lot of compliments on this rug. I have it sticking out from under my bed by the footing. Love waking up and having my feet rest on this lush fabric :D", 
    "The is a nice, simple rug. It is fairly plush and it is a mixture of greys - mostly medium to dark grey with a light grey throughout. It looks very nice in my living room", 
    "I was going back & forth about buying a rug on line. So glad I did ! So nice on your bare feet & my granddaughter loves playing on it.", 
    "This rug is fantastic for the price. Often rugs of this price are low quality. It is thick, plush, and of good quality.", 
    "I bought this as a gift for my mother. She loved it! The only issue is it comes in a roll ( as most rugs do) and it was curled up on the end for a while. It did relax over time and serves her purpose quite well.", 
    "This is a very thick well made carpet. The color was a little darker than what I wanted but okay. I hope it is a durable carpet.", 
    "Bought three of these rugs for my newly painted light gray bedroom. Adds great contrast to the room. You will need rug grippers if you place these rugs on hardwood floors, as I did. I hate to shop, so I always go to Overstock first!", 
    "Like many other, we bought this rug for our baby's room. She was close to crawling and our house is hardwood. She absolutely loves the rug, as do we. It's soft and practical. Easy to clean (beat to clean) and versatile. We're kind of bummed we didn't buy it in the larger version. We found ourselves all sitting on the rug together and playing. I highly recommend this rug!", 
    "This is a very nice rug, especially for the price. It is very thick and cozy (like the description says) and is especially plush with a thick rug pad underneath. The color seems true to the picture on the website - it is comprised of a couple shades of gray but overall looks more like a charcoal gray. I am not sure about the shedding, but so far, so good. I would recommend this - you really can't beat it for the price.", 
    "Great rug rolled our nicely. We've had it for a few months now and no issues. Our puppy loves laying on it :)", 
    "Could be a bit softer, but otherwise fantastic for our living room. Matches perfectly with my white furniture.", 
    "I love this rug. We got it a couple months ago and it really anchors our room. It is soft and easy to clean. Unlike other shag rugs I have had, this one never shredded. Great rug for a reasonable price.", 
    "Love the look and feel of the rug. Very lush. I didn't use a carpet pad underneath and it is staying in place with no problem, but I do have a very large size. It came rolled up and was fairly easily to unpack. Only trouble is I'm not sure how I will vacuum, my vacuum will not go through the thickness.", 
    "The rug was beautiful, and was very happy with it!!", 
    "Exactly how it looks, color is charcoal/dark grey my walls are grey/blue and this rug looks great, it is definitely grey. It is thick so doors will not go over, we put it in our study and study doors can't clear it so had to move it accordingly but works and great rug!", 
    "I ordered this to compliment the decor in my guest room. Grey is a great neutral color and goes well with my preferred color palette of greens, blues, oranges, and yellows. I will be honest that I did overestimate the size and thickness of area rug that I needed so the placement of this particular size has to be closer to two walls in order to allow for closet doors to open, but that is no fault of the manufacturing, rather poor measuring on my part. I did order basic non-slip pads to go underneath but have found they really aren't necessary for my floors. I am still using them for protection purposes though. The thickness is great and I love how the color changes from dark charcoal grey to silver depending on how the pile is laying. Oh and shipping was lightening fast!. I also have not had any issues with shedding, but it is a carpet. They shed.", 
    "I did have some problems when ordering but I am not reflecting that through my rating of the product. I'll add that at the end.The rug itself is beautiful. The gray color reflects what you see in the photo. Like others have said, it's a sort of silvery gray. Each thread is unique in that some are almost all gray, some have hints of light gray and this is what gives it a more metallic/silvery look (but it's very clearly gray). The quality is what makes this so worth the price. There are so many threads that even if you try, you cannot see any open spaces in the rug (I tried). It's quite lush.The problem I had is that the first time I was sent the wrong color - it was a tan/brown color. And it took several back and forths to confirm that there was, indeed, a true gray colored rug and this was not just a bad picture. All said it was a few weeks before I got the right rug. While the team at overstock was very nice each time, it was a hassle I didn't have time for and if i hadn't been diligent I may not have known that there is a true gray rug. I must have asked 3 different people to confirm this and finally one of them said he'd have them send me the rug again, but have the warehouse folks check it first. I had 50% confidence I'd get a gray rug. :) However, it's all good now.", 
    "this is a great product. Highly recommend it! Bought the runner to match. Perfect medium gray", 
    "My son absolutely loves this rug. I bought it for his room and he always lays on it! Very good buy, I have since bought 2 more in different colors.", 
    "I love this rug. My husband is always talking about how soft it it. I make sure to always work on the rug in my room. It is a very dark gray.", 
    "We bought this rug for our baby girl's room so she didn't have to play on the wood floors. It was perfect. It is very good quality, soft, and thick. It is comfy to play on. If I had another place to put one, I would buy another one. Love it.", 
    "It's what I wanted and more great price the color matched perfectly with the room", 
    "Bought this for my daughter's room and she is thrilled. Actually color of rug is a bit darker than pictured but that was fine with us. If you are looking for silver grey this might be too dark. Very cozy & shaggy. Arrived quickly, no odor and very little shedding. Have ordered a few rugs from Overstocks and have been very satisfied.", 
    "Great product. I was searching and searching for months to find the right rug, and I finally took the risk on this one. Completely worth it! Irma beautiful, great quality, amazing price, and the color is exactly what I wanted. Also, everyone keeps complimenting me on how soft and thick the rug is. I highly recommend this product!", 
    "We went back and forth between purchasing the Crate & Barrel Memphis rug, or trying this way cheaper Safavieh option. We truly were surprised by the quality of the Safavieh when it arrived. We felt it right next to a swatch of the *** I would say it's about 80% of the quality of the *** option at seriously 22% of the price. It's not quite as cushy, so I used a 1/2\" wool pad underneath. I can't imagine us needing anything softer/more luxurious than this. And I like nice stuff! The color is great, and we've been able to spot clean our baby's spit-ups with baby wipes. Only negative: synthetic smell/residue for the first month. Be prepared to keep your windows open. I gave the rug a rubdown with a damp towel a few times too. I think this is the price you pay for synthetic that won't shed like wool.", 
    "I returned this rug as it was too dark for my bathroom. Dark gray with a lot of black in it. If don't object to that color it is a good rug for the price.", 
    "Love this rug. I get so many compliments from people on it.", 
    "This rug is good looking and very thick and luxurious. I ended up putting in my bathroom as it matched that decor better than what I originally bought it for. I would buy another one at this price and quality.", 
    "I love this rug. Bought 1 for in our playroom and 1 for in our office. It is a nice thick shag and doesn't shed at all. Rolled out perfectly. I don't even have a rug pad under them and they are more than soft to walk on. Highly recommend this product if you are looking for a good rug without breaking the bank.", 
    "Shag rugs can break your wallet that's why I'm so happy to have found this rug for such a good deal. Its super soft and even thicker than I had expected. Funny because as soon as my fiance opened up the rug he literally layed down on it lol.", 
    "I love the color and style of this rug. It seems a little darker than the picture, the shag is a great length. Makes my room look great Great for the price!", 
    "The product is pretty good value for its money. The color came in a little darker than advertised but still does its job. I would highly recommend this product", 
    "I was very happy with the quality if my rug. The color is a dark grey as stated but thicker then i thought, which made me happy. I would buy this product again.", 
    "I am still shocked with the price that I got this rug at. I've looked at other rugs with the same style and color and no prices compared to this purchase. I was a bit hesitant since I wasn't able to see or feel the actual piece before buying but I have no regrets. Everyone that visits loves the look and feel of the rug. I am planning on buying another one, possibly in white for my bedroom.", 
    "This rug is awesome, exactly as described. It was rolled up and came straight from the factory. We rolled it out and placed it and the colors are perfect. It does have some blue hues with the gray which is perfect. Excellent quality and very heavy backing.", 
    "Fantastic rug for the price. Bought this rug for my daughter's room and it is perfect. Definitely gray in color (not sure about the blue per other customers) and super soft on your feet. Came rolled up not folded and had no smell (per other customers again).", 
    "Nice rug, color looks good and as described. The rug us un a smaller bedroom and dits the space nicely. Very satisfied with the purchase, quality, delivery and O in general. Would recommend to friends.", 
    "This rug is perfect for my family room. The color was represented accurately and I am so pleased with the way it looks. It has a pretty sheen to it. Overstock has never disappointed me.", 
    "This rug is soft and nice to lay on. Took a couple of weeks for the corner to un roll but lays flat now. Good quality rug.", 
    "Very plush on feet and good value. The color is a darker gray with some lighter gray strands that give it some dimension. Color went well with our bedding. Glad I purchased it.", 
    "I'm very impressed with the color, and quality of this rug. It's shiny, and very dimensional, and very soft. I highly recommend it.", 
    "Love this rug under our modern dining table and chairs, comfortable, quality, and looks great.", 
    "I bought three sizes of same rug and like them all in their locations. They are pretty rough on the back side. I suggest a pad to avoid scratching into a nice wood floor. They are good by me.", 
    "The color of the grey shag is multi with hues of blues and black, pairs perfectly with my stark white contempo coffee table.", 
    "I'm pleasantly surprised at the quality of this rug; it's seriously gorgeous, plush and cushy. Fantastic buy. The color is darker than I expected - more black than gray - but it works with my decor and I'm really happy with how it looks.", 
    "Just know this definitely has a blue hue to it. We were trying to match a medium grey color in our nursery and it does not match at all. The rug is nice and soft and seems like a good quality rug but the blue will take some getting used to.", 
    "This was exactly what I wanted in our great room in front of our Swedish daybed. It looked like the color I wanted, and when I read that it had a tinge of blue in it, I knew it would be. It is! A nice vibrant dark gray with a tinge of blue. It's soft and modern-looking and seems to be very easy to care for.", 
    "Rug looks exactly like shown on the pics. Colour is a dark grey.very long threads, high pile, not quite as dense as I thought but my expectations were too high.. Really shaggy, looks more expensive than it is. Some reviewers likened it to the costco rugs that are sometimes sold, but that is not true. This one here from Overstock is much better in terms of quality, looks and density. My son loves it in his room. Delivery was fast. Great value for the price.", 
    "The rug is luxurious and soft and thick and I love the feel. I would say that it is more salt and peppery than the true gray I was going for. There are lots of hints of black/white versus just gray. Soooo, I kind of just went with it even though the color isn't exactly what I wanted. I just got lazy about returning it. I may end up using it in a different bedroom and try a different rug for the room it is now to get more of a true/even gray.", 
    "Received the carpet today and spread it out in the living room. Love the cozy, shag feel of the rug. Really soft on bare feet. (plus my cats already love it). And the shag look offers a dimension of grey color rather than just one. I looked at a few other rugs on Overstock and other websites. Reviews of rugs similar to this had issues with shedding. This rug appears to be well made, especially for the price. I did not have any shedding issues after vacuuming. My only issue is that the rug is more blue grey than I would like. It does look good in my room and goes decently with my grey furniture. Just wish it was a tad less blue.", 
    "Nice pile. Feels great. There is a chemical smell as mentioned by other reviewers, but it dissipated quickly. I may order another one.", 
    "Great rug, very soft however has a slightly bluish tint mixed with gray.", 
    "I thought this was a nice charcoal shag rug but upon closer inspection it seemed to have a bluish hue which didnt go well with in my living room so I exchanged it for a Safavieh white shag area rug. Good quality, just didnt like the color. Overstock customer service was very helpful.", 
    "This large gray rug is a beautiful color and looked like the gray on my screen which was perfect! I would call it a deeper or dark gray. The plush is great and my cats love it haha! Vacuuming is a little tricky but it's expected.", 
    "Soft, plush and the color is perfect! Could not ask for anything more from a rug!", 
    "This rug is beautiful, the colors were great. I would love this in a bigger size , but it doesn't match any other room decor. It is really nice though. It's in my office under a futon.", 
    "Great rug. Love the way it looks and feels. The color is a true grey.", 
    "It's perfect bedside my bed. Nice and thick. Shipped fast. Great price for the quality...", 
    "I was so skeptical to order this rug. But took a chance and was glad I did. These rugs are beautiful and very affordable. They are true to color and what I love most about them is that they are so plush and feels so soft on the feet. Luv, luv, luv them.", 
    "We bought this for our bedroom. It is very cozy, soft, plush....all the words you want it to be. We love it.", 
    "This rug is just okay. It serves a purpose, but has little to no wow factor. I was expecting a true shag, like a messy shag. I bought the 7'X6' round rug in grey. The color is a charcoal grey. The pile is medium and soft to the touch. To me it's not really a shag rug. The pile is very neat and contained within the shape of the rug. I was looking for a messier pile. I wish I had a picture to show what I was looking for. This is not it. I'll keep the rug because it was a pretty good deal. I like overstock. They have great prices and the shipping is bar none. I guess the old adage, you get what you pay for rings true here. I really haven't been wowed by any purchase. They all just fit the bill and are okay.", 
    "This rug is thick and beautiful. Dog loves rolling around on it!", 
    "Overall, I am very pleased with this rug. Despite what other reviewers say, the rug does have a \"new carpet\" smell about it. Also, the color does have a slightly blueish tone about it. I am hoping over time the new carpet smell will go away. The blueish tone is so slight that it is not a problem for me. The rug is soft and has a luxurious feel about it. I like the 1.5\" height of the pile. I have the rug in my family room and really like it. Great value as well.", 
    "This is the third rug I've purchase from Overstock and the first two were great. I read all the reviews on this rug and decided it had to be good. Maybe I got a bad one but my rug smells horrible and has a dirty feel to it. When you rub your hands over it your hands feel dirty and kind of sticky. Same thing if you have bare feet...you get dirty sticky feet! I think I could live with the smell because that will probably go away but the dirty thing just isn't going to cut it. It is beautiful and feels very plush though. I don't agree with the reviewers that said it is blue. My rug is a dark gray with some variation of gray and white fibers in it. The color is a perfect match to the picture. I may try to dry clean it because it is a hassle to return...not sure what to do with this one.", 
    "The carpet is very plush and of high quality, the color true to the picture.", 
    "Love the rug. Nice quality and beautiful color and texture!", 
    "The rug is exactly as described. It is thick beautiful shag. The grey is dark and shiny.", 
    "I was pleasantly surprised with the quality of this rug for the price. It feels really nice under the feet- soft and plush.", 
    "Nice quality rug. Thick shag. Well made. Needs to be unrolled and left to flatten out for a day or two. It also needs a rug pad since it has a scratchy backing. Color is dark gray with some shiny lighter grays.", 
    "I agree with most of the reviewers. I am very picky about \"grays\" and this rug is a true, dark gray in my opinion. I did not detect any shades of blue even in different lighting conditions.", 
    "I had been searching for an oversized rug for my bedroom for months, and was quoted around $XXXX for similar rugs everywhere. I can't believe the value for what I paid!! Great quality (super thick and soft), doesn't shed, and looks chic and stylish. Thinking of ordering another one...", 
    "Got this rug for my son's dorm room. Really made the room more homey and cozy. This was a good purchase!", 
    "This carpet works great in my office. I'm a young guy and was looking for something that would look nice in the office, but also make it more homey. This rug did the trick. It's very soft, but still classy.", 
    "I love the rug. It has a nice pile, and looks and feels great. However, it is NOT gray. It is blue! It doesn't look anything like the picture!", 
    "I bought this rug for my 3-year-old son's room, which has hardwood floors. The color is neutral but not drab, so I think it will \"grow\" with him as he gets older. Plus, it is so soft and plush -- we play and lie down on it all the time! I have it right next to his bed, and he has actually fallen out of bed once or twice and been totally fine when landing on this thick carpet.", 
    "After reading the other reviews I decided to get this rug. My husband and I are in the process of redecorating our family room and used the colors, black, grey, white and pops of red. I was worried about the other reviews that stated the rug looked more blue than dark grey. This is absolutely INCORRECT. The other people who received this rug must be color blind because this is no way a \"blue\" color. Its a beautiful shade of dark grey and silver.in the light. I honestly cannot say enough about this rug. I plan on getting a pad to put under it so its more lush than it is but other that, its delightful. A must have in the home. One happy person!!!", 
    "Was skeptical after reading some of the reviews here however, I was extremely satisfied by the color and quality of our new rug...It is a beautiful shade of grey and fits perfectly in our family room. Love, Love Love it !!.", 
    "A must buy. I will order another one in a larger size for another room in my house.", 
    "Awesome rug! Especially for the price. It's super soft & lush. I love the color, the dark gray is what I purchased! My kids love how soft it is and I love how great it looks!!", 
    "The rug came in as a roll but once you let it down and it became flat not curling up which is nice. The color is same as picture which is charcoal grey. The shag is longer and softer than I expected. My son and cat love to lie on it. I ordered the very large size and probably that's the reason the chemical rug smell being stay a while not go away. I'm sensitive to smell but still can endure it so if you're not very sensitive you probably won't feel bothered.", 
    "This rug is perfect in my little guys room. The color is definitely a nice dark gray. It has a nice thick weave, you do not see the backing through anywhere. It is soft and comfortable, my two toddlers love rolling around and playing on this rug. It was a great value. We're very happy with this purchase, and all our other overstock purchases. This is the third rug we bought, and we're thrilled with all of them. People always ask me where I got all my rugs!", 
    "This is a very comfortable, deep rug that my kids love lying on as they play board games or watch TV. Its a beautiful, deep grey color and looks great. It warms up the room wonderfully well and is highly recommended, especially at the price.", 
    "Plush, perfect color match with photo, unrolled and within a few hours laid flat, no curling of the edges. Excellent product.", 
    "Everyone who lives in my house or visits comments on this rug! Dark grey, very soft and shaggy. Really happy to find a square.", 
    "Very thin rug. . Figured there would be more yarn. If you rub your fingers between yarn strands, u see more backing than rug yarn. I was hoping it would be soft on my feet, over a tile floor. I sent it back. If the purpose of this rug is just for looks. It will be fine..", 
    "This rug is true to color. A true grey and not blue (which we have run into problems with in the past). The shag is very soft and size is perfect for our living room. It was delivered in great condition and well packaged.", 
    "The color of the rug is more blue than it is grey. The color that's shown here does not do the rug justice. I adore my rug, it suits well with my furniture and feet. I purchased the 4\"by 6\" because I have a very little living room space. This rug is tough, no shedding at all. I vacuumed it already and it's a really tough shag rug.", 
    "This rug is very elegant...the pile is so plush you see no backing through the shag at all. The color is a beautiful dark grey with some lighter shades of grey mixed in. I'm very happy with this in my bedroom and fits well with the décor.", 
    "We are very happy with this rug. We actually ordered a runner and an area rug for our living room. Great color gray, but silvery and blue too. It's very plush, feels great. We added rug pads under ours to make it even softer and to help the runner stay in place, used a XXXXXX memory foam pad. Totally satisfied. I warn you that when the come they are rolled up and the first day you need to set books or something heavy on the ends but they straightened out beautifully in a few hours. We are very happy with this purchase!", 
    "I had been looking at this rug for a long time for my bedroom, finally pulled the trigger and so happy I did. Color is true to online picture and the rug is so comfortable under foot. Great value.", 
    "Love this carpet. Absolutely beautiful. The color grey was gorgeous and well worth the price. Overstock is just amazing to shop at.", 
    "We were so happy with this rug in our bedroom we ordered another for the living room! Quick delivery! Very happy", 
    "As pictured and described, vacuums well, soft, good quality", 
    "I could not be happier with this rug! It is so soft and my kids absolutely love rolling around on it. Feels great underfoot, super stylish and great price. We've received many complements on it from guests, too. Love love love this item!", 
    "I love this rug. I listened to the reviews and received a fantastic rug. There is no shedding. And I ordered it at 1am Thursday morning and received it by noon Friday. Now that's what I call fast shipping and FREE at that. I am an Amazon convert.", 
    "Love this area rug. Very high quality and the style is just right in my family room. It is thick and the piles are closely woven. Much higher quality than many of the other rugs I looked at in person. I am very pleased with this purchase.", 
    "I love the rug. But I wish it were a true gray like the picture. It is silver with strands of black. I do love the shag. It is a nice quality rug, and I haven't found another one I like more. Unfortunately it really doesn't match my gray furniture.", 
    "I ordered the 4' round gray rug for our newly-remodeled master bath. It is just perfect! It is a true darker gray color and so perfect for our sitting/window seat area. The quality of this rug is amazing! I am delighted with my purchase!", 
    "9.6\"x13\" - Arrived quickly and it's a thick, quality that doesn't require a pad underneath. We are going with a gray, monochrome look in our living area and this works perfectly. In the evening, under artificial light, there are definitely blue undertones to this rug, but it's a true gray in natural light. I love that it gives off multiple colors of gray, so that you can match it with a variety of colors. After a few days, the folds released and there is no odor. We loved it so much that we also ordered the runner for our entryway.", 
    "It looks good, and is what I wanted, could be softer", 
    "Very plush. very comfortable and inviting to lay out on in our living space. No need for extra padding mat underneath it.", 
    "Very nice rug. Nice deep grey color. Just what my daughter was looking for. It does have a very strong odor when you open it. It's been about two weeks and we can still smell it a little.", 
    "I am so happy we ordered this rug! I was hesitant to order because it was sight unseen. But I took a chance because we had been rug shopping for 3 months and we needed something. The price we paid for this rug along with the quality of it far exceeds any store we went to. We ordered it on a Thursday and it arrived the following Tuesday. There were no strange smells as some reviews have said. It works perfect on our hardwood floors. We purchased a carpet pad and it makes the rug even more comfy to sit/play on with our 5 yr old. Love the blue grey color too!", 
    "I read All the reviews before I bought this rug, and I will tell you that there was little negative in the way of the comments. The few ones I remember were it was a slate blue, it is not it is a true gray like you would expect. It is absolutely gorgeous and very think pile. It is soft to walk on and I did buy the felt pad and I am not sorry. The smell everyone does talk about is a normal carpet smell when you have new carpet, it goes away quickly. The folds, I didn't experience....the creases again are normal in buying carpet that must be delivered. I would Totally recommend this carpet!", 
    "Soft and solid. The picture makes it look wider than it is. A solid buy and good value. I am hoping mu kids will love this and want to play on it .", 
    "This is such a gorgeous rug! It is so plush & soft. However, it is darker than the photo appears. And previous reviewers mentioned there is a blue tint to it, I couldn't see what they were talking about. In any case, I love this rug. I bought the 3x5 size for my son's room. It came rolled up, the edges were curled in, but I gave it a day or so, and it flattened out perfectly. It smelled like a rug that's been in storage, but air it out, and it'll be fine. Buying rugs is so hit-or-miss online, but aside from the slight color misrepresentation, it's nothing that I couldn't work with and I am more than pleased with this purchase.", 
    "Even though the rug size I ordered was not the size I should have ordered (a little short) I decided to keep it. My Chihuahua has not tired of luxuriating in it. It looks amazing and feels that way also. So many of my guest have asked me were I bought it from.", 
    "I really enjoy my carpet it feels so soft. Am looking forward to buy bigger for my sitting room. The colour is also great. It worth the money.", 
    "Love the look and feel of this rug. Makes the room pop!", 
    "Rug is soft and color is spot on. Had to ship back to get a larger size, but will get the same rug.", 
    "The size of the rug is perfect for the room its in and it's so so comfortable. It really is cozy and the color is charcoal gray like the picture. Would definitely recommend this.", 
    "I needed a soft rug for my husband's side of the bed after we put down a wood floor in the bedroom. I couldn't be happier with the look and the feel. It vaccums fine with the high setting.", 
    "This rug is wonderful. It's so soft under your feet and looks high quality. I will definitely buy other rugs of this style for my house.", 
    "The rug is beautiful, it looks and feels wonderful, I can recommend it to anyone with a large room in which to display it.", 
    "The dark grey is a beautiful color. The rug is very soft and plush. No problems with shedding yet and our cat has been playing on it constantly. All the roll lines cames out after laying flat for a few days. Only negative things I've noticed is that the rug smells bad if you put your face right up to it. I'm hoping this will fade with time. Overall, great value and great product!", 
    "super soft and plush perfect for our babies nursery. i didn't think it would be so blue even after reading all the reviews i still thought it would be grey. it's blue for sure but it does work for our room still. there is the exact same rug in a light grey color though for people that are looking for grey. its thick so i know the baby can crawl around without getting hurt.", 
    "Purchased this for our home office we have dark cognac colored walls and rosewood furniture. I wanted to lighten up room with some greys and silver accents. Rolled it out in the great room to get it to uncurl a bit. Hasn't moved since. Its in front of the pellet stove and tv area so warm and inviting, comfy and cozy. Cats nap on it, kids lay in front of the tv and fire, just a great addition to the room as winter sets in. Plan to find something similar in brown tones to replace it here in great room because it looks perfect in the office but it wont get the use there so its staying put until i find a replacement. Color is as pictured. Like other reviews it does have a slight blue cast i would agree rather than a green-grey. On the darker side but it does have a reflective quality too so its not a flat color. If you like the photos you will love the real thing. Unbelievable quality for the price.", 
    "The color was not what I thought it was going to be, but the rug is beautiful. It is actually better made than what I expected.", 
    "The color is exactly as the photos and the \"hairy\" surface makes it look modern and cozy at the same time. It added a nice touch to my office.", 
    "I needed a rug for my bedroom but I hate using a full area rug and waste it section under the bed so I used two runners. One along the length and width of my bed. It looks fabulous! The only drawback is the rug is not as soft as I would like it but I still love it", 
    "This rug is perfect for the room I chose it for, very good quality and the color is exact to the photo.", 
    "I usually only purchase wool rugs. But they can be expensive and one of my dogs has taken up the practive of digging on my rugs. it pulls up the loops and over time this has taken a toll on my purse and my rugs. So I thought I would try a shag rug that would not show the digging desctruction and yet still compliments my ecclectic design. I bought this rug in the gray and it is a match to the picture. Really charcoal gray with some contrast just from the length of the shag. Does not look at all cheap, very soft and plush feeling. Can not see through to the underpad, and the smell is minimal. I bought in the 5 x 8 and the 4 x 6 to put in my great room. Looks really nice, the dog digging is not at all noticeable. Someday i will go back to wool, but if you are looking for a quality and comfy shag this fits the bill.", 
    "This is a fantastic heavy-duty plush rug. The color is a darker grey. Highly recommended for a bedroom.", 
    "I purchased the round one. Its great! soft shag that my vacuum can vacuum! a must have!", 
    "We looked at lots of the reviews, so we were prepared if the rug were to be a very blue tint in daylight. It is. It's very comfortable and the quality is extremely good. We got the 10' x 13', holy crap it was heavy! Shipping was 6 days and yes, it was folded. It has relaxed already and has only been down a couple hours. Odor is insignificant. Overall, very pleased.", 
    "We bought this as an accent rug for a bathroom....very soft and appealing!!", 
    "Beautiful rug! Great quality. The color is very nice with just the right amount of sheen. It is very plush and thick. It hasn't shed any fibers at all. Very good puchase!", 
    "I really LOVE this rug! It is sooo plush and thick! There are some comments that say it looks blue, but that is not the case. It is a true gray color and looks great in my living room. It hasn't shed like some of my other rugs, and there was no funky chemical smell. It came quickly in the mail, and looks like I spent much more than I did. I am VERY pleased with this rug and you should buy with confidence!", 
    "happy with the texture of the rug but it more of a blue grey so the other items in my living area that are a dark grey dont quite match. but with a few decor accessories i can make it work. over all im happy with the product but the color is not my favorite.", 
    "The pile on this carpet is full and plush - very soft on the feet and hardly any 'shedding' since we laid it out. My only 'bone to pick' is the color is a bit more blue-grey than dark grey. It works for the decor of the room I'm using it in, but if you're looking for a flat, neutral grey, this isn't it.", 
    "This rug has a shimmery blue-gray coloring which matches my living room 100%. It's extremely plush & soft..I like to walk barefoot on it. I needed something simple to pull my room together & this was it. Great price too! If you need a bluish silvery grey then don't hesitate, buy it!", 
    "This was exactly what I was looking for. Great color and great quality for the price.", 
    "Beautiful area rug was purchased for my guest bedroom.... Looks great.", 
    "We needed a new rug for our living room floor (as its where my 19 month old daughter spends most of her time playing). I wanted a rug that was plush and comfortable. Our living room is decorated in tans and blues and silver hues, and the rug is the PERFECT color. I think it looks exactly like the picture that Overstock shows! And it is SO plush and comfortable that even my husband likes to lay on the floor now! My only complaint is that I can't keep our puppies off of it either! :) I do need to buy a no-skid mat to go underneath because it slides around a lot with all of our family traffic.", 
    "This is such a nice thick plush rug I love it! We put it down in our new guest room make over whre we installed wood floors so this is the nice plush touch to your toes", 
    "This is for my sons room who was away at school. He cam home for the weekend and said he just loved the rug! He had hard wood floors and loves that he has a comfy rug he can lay on the floor with his dogs!!!", 
    "It has way too much white in it. Not solid grey that I was expecting.", 
    "I am so overly please with this rug. Love, love, love everything about. The color, the texture and the quality. I also received my rug rolled up, so therefore it did not have any crease marks. I am so happy I ordered this rug!", 
    "Pretty rug. Darker and a bit of a blue tinge that I wasn't expecting. I have a grey scheme going on in my room and this has made it much darker. However, still very pretty and full!", 
    "I was very pleased with this rug. It came in a few days and there was no shedding. the color was exactly how it showed in the picture. I would order from Overstock again.", 
    "As the other reviews say..it is folded so there were creases for a few days, but love it!!", 
    "I love the color of this rug, plus the thickness and quality is nice, it looks great in appearance. I purchased this in a smaller size for my sons room. I wasn't sure about the softness of this rug initially because I didn't know what to expect, being an online purchase. It softened up more over a couple weeks as it aired out and I'm truly happy with the feel of it, and my son loves this in his room. I bought this brand and a different brand as well, based on different color needs for my rooms, and I will say I'm really pleased, the good reviews helped my decision and I wasn't disappointed.", 
    "This rug is a dark grey/navy blue. It doesn't look grey at all in my space. I know that the colors in my room probably bring out a little more blue than normal but this rug will definitely be blue no matter where you put it.", 
    "One of our favorite rugs. Purchased for our office and found out it was too small. Had a reading nook area and fits there perfectly. Comfortable to sit on.", 
    "This is a beautiful dark charcoal rug. It does not shed at all which is a bonus. It was delivered several days before promised. Everything about the rug and the transaction were great.", 
    "I needed this rug to cover my tile floor in our family room. It feels nice and plush underfoot. Did not need a rug pad under it because it is 8x10 and heavy enough not to slide. I probably would have purchased a rug pad if it were on hardwood or laminate flooring. The color has a \"peppered\" appearance with silver, grey, and threads that are twisted with black. It depends on how the shag is laying. I would buy again.", 
    "I am so in love with this rug! I ordered two 4x6 and a 2x7. The quality is amazing for the price as many others have said. They are so full and thick. My feet are very happy! I understand what some are saying about the \"blue\" tones. However, I have one rug next to a charcoal grey sofa and the rug looks charcoal grey. Next to a light grey chair it looks charcoal grey. I only saw the bluish color once and it had to do with the light filtering in from outside. If you asked me what color it is I would not say blue. In my case, fortunately, it was exactly the color I was looking for. It finished off my redo with a classy, rich look. I am beyond pleased and would recommend these rugs to anyone.", 
    "It is a nice, thick rug and not cheaply made. It was just a little too blue for my room.", 
    "Bought this grey rug (9 by 13) in June for our basement. Item arrived quickly and looked just as depicted in picture. Love that the rug is soft and thick; very comfortable on the feet. It does not shed. We also bought a rug pad (from Overstock too) for this rug as our basement has concrete floors. It feels okay without any padding but 'WOW!' with a rug pad. We like it so much that we bought another one later. YES...a good buy.", 
    "This rug is absolutley true to it's color. I saw not shades of blue in it as I have read in previoius reviews. The color is what it is online-a wonderful shade of greay. It is so soft & thick. It was the final addition to our daughters re-finished bedroom. She & all her friends love to sit on the rug & hang out. I would recommend this to anyone! I will definitely be a future customer of Overstock.com :)", 
    "Received rug quick as promised. Rug had a smell to it. Took a couple of weeks to go away after vacuming numerous times. Quality is good for price paid. Thick and color is as described and a very nice tone. Set it down on dark chocolate wood floors under a black leather bed. Beautiful", 
    "This rug was delivered to my house just yesterday from Overstock.com. I was worried because I had already purchased a different rug from the site and had to return it because the quality was poor. But when I laid out this rug, I was instantly pleased. The shag is thick and soft and I immediately threw myself down, performed a few snow angels to test it out and then put in a good 20 minutes of lounging around on it to break it in. It's my new favorite place to be in the house. Unfortunately, it's my dog's new favorite place too. I'm jealous that he'll be getting all that quality time with the new rug while I'm slaving away at work every day. Anyway, it's a very well made rug that exceeded my expectations....especially since I paid so little for it. Very happy!", 
    "I bought this rug for our family room and I'm very happy with it. The color displayed is very close to the actual color of the rug and the pile is just as accurate too. The rug is soft and super comfy to lay on it. The price is right and the quality is very good.", 
    "I was looking for a rug to go into my sons room for months and found nothing, Everything was way to expensive or not soft enough, so you could imagine how nervous I was to purchase online. Let me tell you this rug is amazing! So soft, so thick, absolutly perfect EXACTLY what I was looking for. I am so happy. The rug is almost a charcoal grey and in the reviews I do see where some people thought they seen a bluish tint....I can see how they see that but it is grey, and beautiful, I would def recommend to a friend", 
    "Really love this rug, much thicker than other shag rugs that I have looked at. My only slight complaint, is that the photo is not quite true for the coloring. Still love it, but it is a little more of a dusty blue/steel gray in color.", 
    "Very happy with this rug. It's thick and heavy. The color is charcoal gray with a beautiful sheen. I was expecting a bluish color from reading the other reviews, but mine is definitely gray. I also didn't experience any of the creasing problems I read in reviews. I ordered the 6x9 and it came rolled, not folded. I have it under furniture, so no need for a mat. It did have a new carpet smell for a day or two, but not sure how you avoid that issue. I would highly recommend this rug. So happy I ordered it!", 
    "I bought this rug for my baby nursery. We painted the walls blue and grey and went with a nautical theme. I read most of the reviews before purchasing this rug. People kept saying the rug was blue-grey when they received it. So I was prepared for a blue-grey rug. And it's NOT. I looked at this rug in natural light and in indoor light and could not see any blue in it. It's a light grey and dark grey nap. It's very soft on bare feet. It's the perfect rug for the babies room. The quality is great and Overstock offered a 15% off coupon and free shipping when I purchased this rug so the deal was really hard to beat.", 
    "I searched many places before purchasing these rugs and after we received them I wished I wouldnt have waited to long. For the price, look and quality, there was nothing I had seen that compared to these.", 
    "This rug was a great deal and beautiful. I think I'd like it a little bit bigger. I recommend per measuring before guessing like I did. It's fluffy and thick feeling with a soft to the touch. I have this rug next to my bed so every morning I get that comfort feeling. This is great rug if you have a no shoe policy.", 
    "Great color, very happy with the quality. I like the way it looks!", 
    "Lush, soft, shag perfect height, beautiful shade of gray. Very happy with the rug and the shipping. Give the fabric a couple of days to relax from being cramped during shipping... and enjoy!", 
    "A good rug, always great service with Overstock.com.", 
    "Good rug for the price. I had bought this in a hurry, did not know that it is not a wool rug. Might have been a blessing! When I opened the carpet it looked shiny and there was a smell to it, but within a week it evened out and felt great. Again - an inexpensive rug and great value for money.", 
    "Great color! Amazingly plush. I bought two for our large living room and put them side by side to appear like one giant rug. Soft and plush, great for kids and pets. Vacuums up well.", 
    "I purchased thus rug for my living room. I have never ordered anything like this online..... Read a few reviews from several sites and decided to try it! Can't say enough about it!!! It's soft and plush, much thicker than I expected and the gray is perfect!!! Will buy another one.!!!", 
    "First, I ordered the rug on a Sunday night, paid for regular shipping and it was at my home when I got in from work on Tuesday. Other than the unusually quickly arrival, there were no surprises. The rug was the color, size and texture that I expected.", 
    "This carpet is thick and soft! My husband used to lay carpet years ago, and was pleasantly surprised by the quality of this area rug. No issues with vacuuming. We bought a larger size and two 3x5. Love them!!! The color is an amazing deep gray with hints of deep blue.", 
    "Does have an odor but that goes away within a few days. Rug is nice and thick and stays in place.", 
    "Soft on the feet and great for laying on the floor.", 
    "I got two large rugs. Both arrived very quickly and look nice. There is some rug odor, but that's to be expected. When vacuuming, you'llneed to set the vacuum cleaner to the highest pile setting. Otherwise, it is too hard to push. Overall, I am happy with my purchase.", 
    "I've only had the rug for 3 days, so I will have to wait and see how it holds up with my 5 young boys, but on first impressions, it seems like a very nice rug. The rug is very similar to the color in the picture. I think grays are hard and I can understand why other reviewers said they saw some blue in it, as it seems the gray definitely is on the blue-hue scale. But it is most certainly a seal gray color. It is very thick and seems to be well made.", 
    "I absolutely love this rug. Mine is round, and is exactly as described. It's soft and thick and very cozy. I'm buying another for the bedroom. A must for cold winter days with hard surface floors.", 
    "I bought 3 of these rugs after reading several reviews on both the brand and this rug in particular. I must agree with the majority of reviewers in that: 1. This rug presents a lush, high quality shag for the price! 2. It does not shed (thank heavens because I already have a dog that has that job) 3. This rug is a deep, bluish steely grey, which goes so nicely with my decor. 4. The shipping and packaging from Overstock.com is second to none! I highly recommend and plan to purchase additional rugs.", 
    "I love this rug!!! I wish I could have this quality in my wall to wall carpet . It is thick, full and feels luxurious under my feet. I'm thinking of buying a larger one, just not sure where I'll put it yet. Definitely one if the best buys I've made in a long time. You won't be sorry, it's a gem!", 
    "This area rug is much nicer than I expected. It is so soft underfoot and at a little larger than 5x7 is a really nice size. The shag is a combination of lighter and darker shades of gray and just lovely in my daughter's room. I would love to have this form our living room in another color.", 
    "This rug is a nice rug and looks great. I have a hard time vacuuming it because of the deep shag.", 
    "I was hesitant on ordering a rug online rather than in a store. This was for my baby nursery so was worried how the color would match compared to already purchased items. The color matched the picture perfect. The rug is soft and durable, actually better than the description provided. After walking on this I am considering purchasing a larger on for a different room in the house.", 
    "We ordered this rug for a small room in our house, it is the perfect size, nice and soft with good quality. I recommend a rug pad for this rug to make it luxurious.", 
    "I love this rug. Its so nice and soft. Looks beautiful on my wood floors. Very soft. Would recommend a slip pad.", 
    "Love this rug, it's super nice and plush! I wanted a gray rug and this one does have a slight blue tint at times, it looks great in my bedroom with light gray walls.", 
    "This rug is a great gray color. The pile is very thick. I have it on a wood floor and it does need a nonslip pad. It came rolled,and flattened out fine within a week.", 
    "I wanted a rug which provided a thick yarn with some shading within the color; it delivered that promise. The rug is placed in the formal livingroom and looks great. It gives the room a more elegant appearance. Thanks for the great product...", 
    "though nice quality rug, the picture was deceiving. description states \"solid grey\" which I thought would be more uniform color. The actual product is a salt-and-pepper appearance with black and light grey fibers making the \"solid dark grey\" color. Also, the grey is a cool grey with blue undertones rather than a warm grey with yellow undertones. fibers are of different length making the \"shag\" appearance. Also some fibers are thin and tightly twisted, others are thick and loosely twisted making it a \"shag\". each fiber feels like fabric store yarn, but because the fibers are closely packed and long, the overall effect is a bouncy plush feel when walking on the rug. I have a rug pad underneath and with the two combined, my little ones can learn to walk without fear of concussion when they fall on the floor. smells like new carpet even after two weeks of airing out. Sheds a little with small short fibers (we have very dark hardwood floors, so the shedding is more visible to us). took a week and half to arrive, and very heavy to haul in (50-60#). came folded, but laid out nicely and fold marks were gone in a day (which was helped by the rug being a very textured rug). Overall nice rug, just not what I expected from the pictures and title description. was hoping for more of a uniform texture and color, and instead rug is very textured and salt and pepper colored when viewed with the eye.", 
    "I highly recommend this rug to anyone looking for charcoal grey palette. I had to return because I purchased based on screen color instead of description. I should have taken advice of previous reviews.", 
    "I am very pleased with this rug. It's extremely plush and thick. Color is a true charcoal.", 
    "I was really nervous about purchasing something like this on the internet but i am extremely happy with this purchase. The rug is great quality and looks amazing!", 
    "Extremely pleased with this. I bought a similar rug from ikea for the same price and it was not nearly as good quality. Would recommend.", 
    "I bought this rug for my grandchild's room and wish I bought another one for my room. It's soft and has a nice thicker pile. It's heavenly for bare feet! I highly recommend this rug. It's the best money I ever spent!", 
    "These are very well made and stain resistant! The first week we had them fruit punch was spilled near the edge of the rug. With one wet and one dry towel it was cleaned up without a trace of the spill. It is grey not bluish as other reviews stated. I definitely recommend these.", 
    "This rug looks great and feels terrific. The color is just right with nice shading. It arrived within days and we have been enjoying it ever since. It's the second rug we've ordered through Overstock and the second time we have been thoroughly satisfied!", 
    "I have the 7 ft round size partially under a full size bed. It is very comfy and adds great dimension to my hardwood floors. Have only had it for three weeks or so, vacuumed once and I wouldn't say the shedding was out of control. I was half expecting it to come apart based on some reviews! Very happy with my purchase.", 
    "This rug arrived quickly. I ordered a high quality pad for added \"cush\" factor. After a few days of settling down on the tile floor, this rug looks and feels great. Worth the price.", 
    "This rug's quality seemed fine, but the color was very off from the description. It is really like a periwinkle blue, greyish blue, but still, very blue. Unless you want blue in your room, rule this one out.", 
    "This rug has a rich look and feel and is very plush! A great value for the price!", 
    "This is a very sturdy (and easy to clean) rug that provides a great deal of soundproofing, esp. if you live in an apt with hardwood floors. While the texture is soft and quite plush with just a hint of sheen, it doesn't \"eat up\" a whole lot of visual space, even in a small NYC apt. For reviewers arguing about the color: yes it is gray, but a very cool slate-ish gray. The blue undertone folks are talking about would probably best described as a \"washed denim.\" Of course, all that depends on the kind of lighting coming in on it. I like decorating using very masculine colors, and offsetting them with more feminine textures. This is def. a masculine color. I can easily see Ralph Lauren lying on it. What I can't see sometimes is my little black dog and have tripped over him a few times when the lights are dim. Poor pup!", 
    "Great purchase. Shipping was quick and it looks great on my floor.", 
    "Nice quality, soft shag rug. The pile isn't too high, and it hasn't shed much in the few days we've had it. It's against hardwood floor and no slip guard is needed.", 
    "This rug is great for my bedroom where it won't get a lot of use. For the price the quality if great. The fibers aren't tightly woven so not sure how well it would hold up in a high traffic area, but it it perfect for the bedroom or low traffic areas", 
    "wonderfully soft & plush-color very rich-looks great in my guest rug and may purchasse a larger size for my bedroom", 
    "Rug is very comfortable and looks perfect in our living room. Well made. Great price!", 
    "This rug exceeded my expectations on both quality and softness. The rug will last forever and feels great on bare toes. Wouldn't change a thing.", 
    "Great soft rug. Using it in child's play area. Great to lay, sit on. No complaints.", 
    "Came very quickly, faster than any other item I have ordered in recent months. Everyone in the family loves it including our animals.", 
    "I was looking for a rug for my bedroom to match blues and grays. This rug has no green or blue hues, it's strictly silvery/gray, perfect. The added bonus to this rug is it is thick and soft. The price beat many local stores and the quality is excellent.. Many compliments on this rug. I would highly recommend this rug!!", 
    "Fits perfectly in my bedroom, took out carpeting and put down hardwood, but missed that feel so had to get it.", 
    "Gorgeous rug for a great price! You would not be disappointed if you purchase it", 
    "I love this rug! It's a beautiful color, thick, lustrous and soft on bare feet. I love it! It comes in a million sizes, so you can order the perfect size for your room. Really great!!", 
    "I love this rug. I got it to replace an older rug in my bedroom. This rug is so plush and soft - much more than I ever expected for the price.", 
    "The rug has no smell, no creases, and soft to walk on. Thick pile. I would buy another", 
    "I was expecting more of a grey rug its actually much darker almost a midnight blue with grey mixture. luckily it went with my decor so i kept it because it's actually quite lovely, a very nice, soft, full rug.", 
    "So I read every single review and went back and forth until I Finaly ordered it only to want to stop my order for fear about what if I don't like it.. Thankfully my order had been placed and it was on its way. It was perfect! So soft and plush but I can easily vacuum, a faint smell that only proved it was new, a perfect cool grey. I don't have a pad under it but it feels like I do. Light enough to move myself but heavy enough to stay in place on my wood floor. All Color is different in every lighting in every home so don't blame the rug if the shade is \"misrepresented\" it's grey! Makes my home feel so cozy! Absolutely love it! so stop wondering should I buy it or not... Just buy it!! Classic look for modern, traditional, or eclectic no worries it's worth it", 
    "I searched multiple stores and online sites to look for the perfect rug and came across this one. The color and size were perfect as was the price. It came 3 days after I ordered and it was perfect. The color, the size, the thickness and the softness are wonderful. I highly recommend this rug.", 
    "This carpet was even nicer than I thought. The customer reviews that I read was the reason I bought this product, yet the reviews did not even give it justice. It is so much nicer than described. Multi greys all blended together makes it look richer and the thickness is so soft. Have gotten so many compliments and asked where I found it. The order went thru very quickly and it was shipped within days. Very smooth process. There were no wrinkles like other customer reviewed. Just perfect.", 
    "This is a very nice rug, it is plush, the color is multidimensional, but I wanted to review the color because this is what I like to see in reviews. Some reviews here said it was blue grey, some said it was definitely not. I have to say it is DEFINITELY on the blue side of grey, it's not blue, but if you have anything that is silver or on the brown side of grey, they will clash. Sadly I think I'll have to send it back :(", 
    "We were skeptical about this carpet as often carpets arrive and are not the same as pictured. This was NOT the case. It is true to color, far more plush than anticipated, and did NOT arrive creased as some reviews suggested. We highly recommend this carpet for anyone looking for great value in an area rug (we ordered 5x7), and are thrilled to have it in our downtown loft.", 
    "This rug color in gray and the size are perfect beside my bed and on my hardwood floor..matches well w/ my bedding..feels great beneath my feet", 
    "I was very skeptical about purchasing this rug, I assumed the rug would feel cheap and I would be able to see through the rug, but I was stunned when I opened the package. The rug meet all of my expectations, its so plush and a great quality rug. I would definetly recommend everyone to purchase this rug becaue of the quality and the look. I just had wood floors installed and the rug sets the tone in the family room that I was looking for. I give this product 5 stars plus.....ITS A MUST HAVE if you are looking for a nice shag area rug....", 
    "I purchased a pad of the same size which needed to be trimmed so exact dimensions may be slightly smaller.. Carpet is beautiful and of high quality.", 
    "THIS IS A GREAT RUG! Do not hesitate, run to your computer and buy!! It is so great, I wish I had purchased a larger onebut not enough room to do so. It is great underfoot, very thick and plush, you need to take your shoes off when you walk on it! Absolutely fabulous!!!!!", 
    "I'm very happy with this purchase. The rug is very soft and has a good color. The shag is longer than I expected, but that's okay. The rug had a funny smell, but that went away within a few days.", 
    "I ordered this rug for a \"pink and gray\" room and it looks great. I love the plushy feel of it underfoot and it is very thick - had to have one door shaved on the bottom to open and close over it, but hey! it was worth it.", 
    "love this rug, good quality and good price i got 2 for the bedroom and they look great", 
    "I bought this rug for my study which has dark gray walls with white trim and black furniture and it looks fantastic! I bought the 7x7' square dark gray rug and it's perfect and pictured exactly how it appeared on my monitor. The shag is thick and super soft, my dog loves to lay on it! It feels great under bare feet. The color is just what a wanted. When brushed one direction it is a dark gray, slightest blue undertone, and when brushed the other direction it is a medium gray. Because of this it has the slightest \"salt and pepper\" effect to it making it very diverse. My dog has light colored fur and I can't even see it. Vacuums easily, still shedding a bit after a week but not a big deal. Love love love this rug!!", 
    "This rug is not blue. As others have said, if you understand grey this is a cool shade of grey. It has no brown, tan or warm undertones. The pile of the shag is very thick and it feels super soft and of high quality. In 2 weeks I have only noticed 1 thread of the carpet come up and my 2 dogs are constantly rolling around on it. It is a charcoal grey for the most part but has lighter shades braided into the threads. This matches my color scheme perfectly and I am beyond happy with the purchase. I would expect this rug to cost twice as much as it does on this site!", 
    "I searched for several months via the internet and in stores for a rug for our family room. I finally settled on this rug. I'm so glad that I did! It is super soft, the color is rich and as described. The rug actually looks much better in person. The kids love to sit and lay on it as well. It was packed well and rolled right out with no creases. We've had it for a month and haven't had any problems with shedding. Also, there was no offensive odor. I would love to get another one!", 
    "Luv it! Its nuce and thick. Doesnt shed off. Looks and feels elegant. It came rolled. Fast shipping! Great service from overstock as well!! Very pleased!", 
    "I love this rug. It is just as described on the website. Only thing i hate is that i have hardwood floors and if your not careful it can slide a bit but other than that i love it.", 
    "GOT THE ROUND SIZE, IT HAS OTHER COLORS RUNNING THRU, A LITTLE WHITE IT WAS BETTER THAN EXPECTED I HAVE IT IN MY DINING AREA UNDER A ROUND TABLE.IT JUST MAKES THE ROOM. EXCELLENT PRICE FOR THIS QUALITY. IF I NEEDED OTHER SIZES I WOULD ORDER AGAIN.. ANOTHER GREAT BUY FROM OVERSTOCK THANKS", 
    "I'm very pleased with this rug! It looks great in our nursery...very elegant! It feels great to walk on, super soft and cushy! The color and quality are just as stated in the description. The rug looks more expensive than it actually is. GREAT DEAL! We are very pleased! I would buy another rug for a different room!", 
    "One review stated the rug had a blue tint but the rug is a beautiful dark grey and matched my comforter perfectly. I am thinking of ordering the same rug in a different color for my living room. I love it!", 
    "Love this rug. Everyone in the family go out of their way to walk across it when barefoot because it feels so good!", 
    "I love this rug! We are using it as a hallway runner from the living room to the bedroom and its so nice to walk on in the morning after just waking up, or in the evening on the way to bed!", 
    "I bought the round rug for my bedroom and it looks great. Absolutely love it. The quality is great and the coloring and shades of grey don't do justice on the website. Very happy with this purchase.", 
    "The really like the carpet, fits in lovely. I must say I had to call and change the size of the carpet ordered and was very impressed with customer service!", 
    "My visiting grandchildren broke the rug in for us. They loved rolling around on it while watching movies in the media room. My wife wants to buy more shag rugs after getting this one. I would definitely recommend this product. Rug actually arrived ahead of it's expected date.", 
    "We LOVE this rug! Bought it for the nursery, feels so great underneath bare feet. Even the cats prefer to now sleep on the floor in there!", 
    "This is a beautiful, expensive looking rug. It is very well made.", 
    "This rug looks great in my bedroom. Very nice feel. Pretty much exactly as described on the site.", 
    "Only regret is, I wish I would have ordered a larger size. Really soft and works really nice in her bedroom.", 
    "I love this rug, looks great in my family room. Exactly as advertised and feels good on the feet to boot!", 
    "The shag rug fits the spot in our bonus room perfectly. Our grandson loves to play on it", 
    "I bought this rug thinking it may be too dark but in reality it is a great color for my living room. It is dark but it adds depth to my room. It is SO comfortable my kids love to lay on it and so do I. I would highlty recommend this carpet for anyone. And I may buy another color for my bedroom.", 
    "I was hesitant to order this because of the reviews saying it was bluish. But when we got the rug, it was not unduly blue - in fact it is less bluish than the smaller dark gray rug we are replacing! It is a neutral silvery color that works well with our modern, clean lined furniture. Only downside is that it has a stiff backing that didn't roll out quite flat, so there are some bumps in it. It's such a thick rug I'm not bothered by it at all - for the price the value is amazing. I was going to look for something similar at IKEA and am so happy to not have to deal with making the trip. Also, the rug showed up literally overnight - great work overstock!", 
    "Carpet is awesome, BUT it wasn't the size I ordered. The measurements were a little off. Carpet itself is great! Super soft!!! Love it, just wish it was the size I ordered.", 
    "I was very happy about this rug. Very plush and soft. It looks great in my living room. I will be getting another one in a different color. Fells great on your feet too:). Wroth the price.", 
    "Was pleased with the color but the actual feel is very rough I brought a rug pad and it still slip and slides all over", 
    "I enjoy this rug...I probably should have ordered the next size up but I wasn't really sure how it would look in my space...but it's okay because I think I can still make it work but just getting one more this size and it will be perfect for how I want my space to look!", 
    "This rug is a perfect blend of colors to make up the overall gray color. It works very well with a duvet set also purchased from Overstock. Everyone loves it.", 
    "This is a nice quality rug. It lends a more funky casual flair to our family room. It is most definitely blue though. I was looking for a charcoal/ graphite color but will be able to decorate around the blue tone. Rich color though.", 
    "I converted one of my 2 bedroom condo into a TV room. I have white carpeting in that room and the Dark Grey rug just brings my TV room together. I also ordered a bench ottoman from Overstock and with the rug and ottoman, my room is up to date. Therefore, I have renamed my TV room and call it my \"SHE\" Cave!! Thank you Overstock for taking all my money, I love everything I get from you. I read all reviews to help me decide - reviews really help. (oh yeah, I got my TV from you too!)", 
    "These are not like the old 70's shag rug! The material is thick & holds up Well to lots of traffic. The color was as described. I've had these throw rugs for about apathy now & I am extremely happy. It makes my living room look so stylish -- while it's so durable!", 
    "Excellent quality, but the wrong color for my decor. Excellent company return process with friendly customer service. Very prompt return credit to my account. In fact, I have never received a credit to my account so quickly after a return!", 
    "I love this rug. It is dark gray and looks good with my Dorian Gray walls. I ordered the largest size and it is REALLY heavy, but glad for it. I got the thickest rug pad I could find too. One review I saw said it looked blue-ish, but I don't see that at all. It is very coozy and everyone comments on how comfortable it is. I am allergic to wool so this is a great alternative, but time will tell how long it stands up to wear. My dog has been scratching and nesting on it, and no evidence of wear yet (2 weeks now) - so that is good news too!", 
    "The shag carpet arrived quickly and has a lot more depth to the color than it shows on the site. It ranges from a silvery gray to a dark gray but is mainly dark gray. Very well made and as always fast delivery from Overstock.", 
    "We bought this rug for our living room and its gorgeous. Super plush and soft, not a polyester feel like the cheaper versions of this rug. It has a very slight steel blueish hue to it as do most dark greys but its a really pretty deep rich color.", 
    "I purchased the 9x13 for our living room. It's so soft and plush, my 2 year old loves playing on it (and we've had several compliments from guests on how comfortable it is). It was folded when it arrived and sat like that for a a day or two until we got our old rug out. Once we laid it out, the folds virtually disappeared. There was very little smell, absolutely NO shedding, and it has held up well. Make sure you have a vacuum that has no roller brush, or one that you can disengage because it will pull at this rug. The color is a dark gray with flecks of light gray - exactly as the website shows. I would recommend this rug to anyone.", 
    "Didn't think it would be as nice as when I received it, but it very plush. And a great value.", 
    "The 2-3\" x 9 that I ordered came much longer. I measured 11\" and had to return it. Overstock handled the return very kindly and efficiently. A 9\" is available....just mistake.", 
    "What a great rug! Husband and animals love it, and there is always somebody curled up on it, sleeping. Warm, thick, dense pile but, so far, pretty easy to clean. Quality rug.", 
    "I love this rug. Bought just for the foyer but now I'm trying to find in 8x10 size for the living room. This rug is so soft and plush. Looks much more expensive than the actual cost.", 
    "Color as pictured and looks great in my black and grey dining room.", 
    "I ended u returning it because of I picked a size too small, but great rug as pictured and expected.", 
    "I was surprised to see my rug delivered and it was rolled. Many customers complained that there rugs were folded, and it sounds like they have listened & changed the way they ship. The quality of the rug is great. Our kids sneak into our room now to lay on the \"soft & comfy\" rug.", 
    "I've been looking and wanting this rug for some time. I am extremely pleased with my purchase. Overstock delivered.", 
    "This rug is much nicer than it looks in the pictures. My bathroom is white and black and I wanted something to pull the two together. The yarns are various textures and shades of dark gray and look perfect in the room. I will definitely recommend to friends,", 
    "I searched everywhere for an area rug to put in my master bedroom that didn't cost $*** or more. This rug is the perfect solution. (I got the 6' 9\" x 7' 10\" size). It's a little bit darker than I was expecting but that could be the lighting in my room. Regardless, I love it. It is so soft underfoot - the perfect cushion to stand on when I get into and out of bed. When the winter comes I'm sure it'll keep the room warmer, too. I also like how the dark color grounds the room, which has 2 story cathedral ceilings and lighter colored hardwood floors. This rug feels much more expensive than it actually is, and I'd recommend it to anyone. In fact a friend of mine is buying the 8x10 size of this rug for her new house after seeing it when I gave her a tour of mine.", 
    "I was worried about the quality and the color for my room...Turned out perfect in all respects..I couldn't be happier!", 
    "this is a very pretty rug but I did end up returning it because it was too high for the high traffic area of the hallway. (we got a runner size.) we ended up kicking it every time or having to purposely pick up our feet to not kick it every time we went down the hall, which got old real fast. loved the color though. wish it would have been a flatter pile rug.", 
    "The only reason this got a 3 star is because Overstock was so amazing with the return and because I never even unrolled it all the way. Let me just say I didn't feel like I had to when I took one look! If it had been orange or green it would have been straight out of the 70's, but this shag fell out of the 90's!!!", 
    "", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-California-Cozy-Solid-Dark-Grey-Shag-Rug/7322535/product.html?recset=a2dbb82d-48b8-46a0-a34a-a342ba42011f&refccid=2ILUXOB7ZFXJGASENEHQCF5LDA&recalg=828,512&recidx=7", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7322535/Safavieh-California-Cozy-Solid-Dark-Grey-Shag-Rug-8e226df6-6088-4171-adb5-55dfca8c9605_600.jpeg"
  ], 
  "description": "The casual West Coast aesthetic is celebrated in Safavieh's sensational California Shag Collection. Rich in tactile appeal, this cozy shag rug offers luxurious comfort and versatile furnishing options. Comprised of virtually non-shedding polypropylene yarn, this plush rug allows for ease-of-care and resilience in even the most high-traffic areas of your home. This rug's 2-inch pile height provides a sumptuous sensation underfoot that will be a pleasure to come home to after a long day of work, or a welcomed early morning cushion for your bare feet.Power-loomed with polypropylene to ensure a durable, long-lasting, and virtually non-shedding rugCasual eloquent style makes it ideal for communal areas of your homeUltra-plush fabric encourages your bare feet to indulgePile Height: 2 inchesFor over 100 years, Safavieh has been crafting rugs of the highest quality and unmatched stylePrimary Materials: Polypropylene Latex: NoStyle: CasualPrimary Color: Dark GreyPattern: ShagBacking: JuteRug Dimensions: 9' 6  x 13'Country of Origin: TurkeyStyleCasual, ShagMaterialOlefin, PolypropylenePatternSolidWeave TypeMachine-MadeShapeRectangle, Round, Runner, SquareColorGreyGallery RoomMahogany, Park Plaza, Polished PewterRug TypeIndoor"
}