{
  "name": "Safavieh_Cape_Cod_6-Drawer_Grey_Storage_Unit", 
  "price": "EUR 199.79", 
  "reviews": [
    "I bought this with the plan to remove the lower two baskets and put shoes on those shelves (this is in my entry). So I was quite disappointed to find that the baskets don't rest on shelves, they are just on runners and you can see through to the floor. Other than that it is a nice piece and I loved that it didn't require any assembly. But if I had known that the baskets didn't rest on actual shelves I probably wouldn't have bought it.", 
    "This same storage unit in brown can be found at TJ and M but I like the fact that I have it delivered on my door step and with free shipping, it is very convenient when you don't have a SUV. I was looking for a light weight unit with a lot of storage to clear clutter with some style. This storage furniture came already ensembled and as a female I could carry the entire frame into the bedroom. The baskets are nice and the entire color combination is very attractive (light brow baskets/ grey chabby frame). The grey is painted in a distressed way so it gives a little bit more dimension to the appareance. I am pleased with this choice. One of the drawers is not gliding smoothly but it is a minor thing. This is not a high end furniture, but not looking cheapy either...The color choice is a nice change from the regular brown/dark colors you would see out there which would not fit my bedroom theme. A good value!", 
    "The drawers where the baskets go are open so they have to sit in the shelf just right or they will fall through", 
    "Nice chest for the price. Baskets were not perfect but functional.", 
    "Such a cute piece! We bought this to hold all of our 4 year old's shoes in our foyer! Love the 2 drawers at the top which we put all her gloves, scarves, and mittens in! Baskets 'shed' some basket material every once in a while, but that doesn't bother us. What do you want for the money? It's not a super quality piece of furniture by any means.... But I didn't want to spend a whole lot of money for shoe storage, however I wanted something that actually looked nice too! This piece was and is PERFECT for what I wanted! I get lots of compliments on it! No one can believe the price I paid! I'd highly recommend it as long as you know this going in!", 
    "I love it especially that it came assembled. beautiful storage unit. would recommend it.", 
    "I love this! Fit into my space perfectly! Love the variety of finishes too.", 
    "great quality, great price, matches other furniture perfectly. color matches what was online.", 
    "let me tell you.... I ordered this same product from Amazon on feb 18, 2016 and got one out of the two I ordered expecting the second no later than March 1st. Course it never came! I called only for them to tell me it has been placed on back order and that they had no idea when the item would be back in stock let alone shipped. (can you say beyond pissed) and I couldn't even get a refund until the back order status changed. long story short I ordered the same storage unit for the same price and on Mar 1 and got it Mar 3rd!!!!!! Overstock to the rescue!!! I will be using these as night stands and it came in perfect condition! I'm happy Gal", 
    "This was the exact piece I was looking for. It matches perfectly with my bench and I found it here at the best price. One of my pieces came a little damaged but I spoke to customer service and they gave me a little credit for keeping it. My only downside for this piece is the baskets sit on a frame there is no flat surface for them to slide in or out on so sometimes they get caught. I may add a piece of wood so the baskets are able to slide in and out with ease.", 
    "The color is beautiful. Definitely a high quality piece. Very impressed with shipping package - not a single scratch or dent.", 
    "Lovely color, looks good, very functional. Only downside is that basket drawers are cheaply woven and on sliders, not full shelves. That is disappointing. Not functional enough for daily use but good for a spare room.", 
    "This unit arrived assembled and feels sturdy for the price. The color and finish look as nice as pictured. The unit is smaller than I though it would be. I was originally going to use it as a TV console but have moved it to the master bedroom for a night stand. It looks perfect in the space!", 
    "Very happy I made this purchase. It was better than expected. Even with two grandsons under the age of 8, we are able to put all their arts and crafts things in the straw drawers and it works well for us.", 
    "Love it. The drawers are not sturdy. Only hold light items. But it works for my use and takes us little space. Looks nice.", 
    "Really like this. We put it in our bathroom. Very well made the color is gorgeous. My only complaint is that the wicker basket drops into the lower basket because it doesn't sit on wood. It is open so little pieces fall in the lower baskets.", 
    "This low profile piece fits right in with my coastal decor. Great for casual storage. Unit is strong... basket drawers not good for heavy storage but fine for lightweight items.", 
    "Super cute, perfect size for the small space where needed. Even though a smallish piece, the baskets are room and the item is sturdy. Plus it came assembled -- nothing to put together at all. Love the gray color also.", 
    "It was a little smaller than I anticipated but it will do. was looking for a storage unit to organize my home gym-would have preferred something a little larger. Great for small spaces."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-Cape-Cod-6-Drawer-Grey-Storage-Unit/6971915/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=10", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6971915/Safavieh-Cape-Cod-6-Drawer-Grey-Storage-Unit-e89ff1cb-9dce-40d3-a366-1ce6c09aa5eb_600.jpeg"
  ], 
  "description": "Tuck away eyesores and protect your belongings with this handy Safavieh Cape Cod storage unit in your bathroom, guest bedroom or children's play room. With six spacious drawers to tame overwhelming clutter, it allows you to reduce storage stress. This storage unit's fetching contrast between its classy gray color and the natural tones of the wicker baskets enhances the look of modern decors.Includes one six-drawer storage unit in a contemporary styleVersatile black finish on gray and natural tones coordinate with modern decorsSturdy construction in shrinking- and swelling-resistant pine woodStorage unit measures 27.6 inches high x 29 inches wide x 13 inches deep Storage basket measures 4.7 inches high x 13 inches wide x 10.4 inches deep MaterialWoodAssemblyAssembledColorGreyOrganizer TypeDrawer Organizer"
}