{
  "name": "Safavieh_Wynton_White_Black_Lacquer_Coffee_Table", 
  "price": "EUR 209.60", 
  "reviews": [
    "The table is quite big and looks more expensive than it is - the top is very glossy and stain resistant. It did come with a minor chip in the top, but it can't really be noticed unless you look really closely or run your hand along the top of the surface. My only real complaint is that the little felt pads that stick to the bottom of the feet don't really stay - luckily it's sitting on a pretty thick rug so that isn't an issue, but it wouldn't work with hardwood or laminate floors unless you found another option to stop the bottoms of the legs scratching.In general, though, I'm happy with the purchase, and the table is a nice addition to my MCM-meets-Bohemian living room.", 
    "This table arrived very well packaged so there is no need to worry about it arriving damaged. Aside from being impressed by the fast shipment and sound packaging, the table exceeded my expectations. The top is a high gloss white on very sturdy hairpin legs. This midcentury modern table is simple but makes a big impact in our space. I highly recommend this table.", 
    "Was packed very, very well! Super easy to assemble, done in mins! Love it and very satisfied with my purchase.", 
    "Easy to assemble. Attractive mid century design.", 
    "Love this coffee table. Easy maintenance and very functional.", 
    "Love this table! Looks great in my newly remodeled cabin of all places!"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Safavieh-Wynton-White-Black-Lacquer-Coffee-Table/9048901/product.html?recset=bbd1c0d9-3866-4ebc-a44d-470c2e3edb03&refccid=YMLL7KGZNVZKP32OYHN65NFVEY&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9048901/Safavieh-Wynton-White-Black-Lacquer-Coffee-Table-bcc4fd0d-784d-433d-9422-595d8b870cde_600.jpg"
  ], 
  "description": "Give your living room a high end designer look with the dramatic\nelliptical shape of the Wynton lacquer coffee table. Inspired by\nmid-century classics, this striking piece pairs a sleek white\nlacquer top and three sets of black iron hairpin legs.Color: White/ BlackMaterials: Iron and MDFFinish: WhiteDimensions: 15.7 inches high x 44 inches wide x 31.5 inches\n  deepThis product will ship to you in 1 box.StyleMid-CenturyMaterialMDFTypeCoffee TablesFinishBlack FinishShapeTriangleAssemblyAssembly RequiredColorBlack"
}