{
  "name": "Simple_Living_Seneca_Black_Grey_Metal_Corner_Shelf", 
  "price": "EUR 179.76", 
  "reviews": [
    "Nice shelf, solid, well made. Easy to put together. It fills the corner space beautifully. Very happy with the purchase.", 
    "This shelf was so easy to put together. My husband and I did it within a matter of 10-15 minutes. The finished product looks exactly like the picture and it is the perfect shelf to fill a corner space. Very happy with this item.", 
    "Package:Came in long, wide, flat boxes and the box was in good shape and plainly marked with the contents.Corner Shelf: Easy to assemble, simple design. When first assembled, I recommend leaving all the screws slightly loose until you stand it up. Then tighten all the screws. This prevents the shelf from being wobbly from differential timing of setting the screws.Overall:Clean, simple design and easy to set up. Highly recommend for those empty corners sitting around doing nothing.", 
    "This works well for the corner I bought it for. It's under my television.", 
    "Just what I wanted for my living room..."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Seneca-Black-Grey-Metal-Corner-Shelf/9753729/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9753729/Simple-Living-Seneca-Black-Grey-Metal-Corner-Shelf-b2872d72-9014-42e7-96c1-15da99ea13f6_600.jpg"
  ], 
  "description": "Create a beautiful home office space with the stylish and contemporary Simple Living Seneca Corner Shelf. It features a black metal frame and a stylish grey reclaimed look finish. The simple, stark color scheme of this shelf ensures that it will blend in seamlessly with many modern office environments. The shelving is sturdy enough to accommodate a wide variety of office and storage needs. Use it to hold books, a printer and printer paper or decorative items such as small plants and photographs.Materials: MDF board with PVC laminated reclaimed look, metalFinish: Grey, reclaimed lookSet includes: One (1) Seneca corner shelf with Four (4) ShelvesFrame color: BlackSturdy metal frameMatching pieces sold separatelySeneca Shelf: 59 inches high x 29.5 inches wide x 18.75 inches deepTop Shelf: 20.75 inches wide x 11.25 inches deepSecond Shelf: 23.25 inches wide x 13.5 inches deep x 16 inches highThird Shelf: 25.75 inches wide x 15.6 inches deep x 16 inches highFourth Shelf: 28 inches wide x 17.5 inches deep x 14.25 inches highStyleContemporary, TransitionalMaterialMDF, MetalShelf TypeStorageAssemblyAssembly RequiredColorBlack, Grey"
}