{
  "name": "Simple_Living_Seneca_XX_Black_Grey_Reclaimed_Look_Cocktail_Table", 
  "price": "EUR 129.94", 
  "reviews": [
    "I've never been so disappointed in something from any online retailer. This one is really bad.First you have to understand what \"MDF Board with PVC laminated with reclaimed look finish\" means.MDF is particle board of wood chips pressed together into a wood-type product. It isn't real wood, but if it's going to be covered up, not so big a deal.PVC laminated is a polyester (plastic-type) coating over a mesh coating that provides the surface image. PVC laminate adds durability to the MDF.BUT...PVC is the same as glueing down contact paper on a shelf. And if you've ever tried to glue on the top and side of a shelf, you know that you have to wrap the paper down. If you cut and try to line up the paper on both sides, you're going to have a gap.That is exactly what has happened to my table. The PVC decoration laminate on the bottom shelf is literally \"coming apart at the seams.\"After only two months!With no heavy activity around it. No kids. No pets. No vacuums. No brooms. Nothing touching it.The table may last another two or three months. And then I'll go out and pay good money at a real furniture store.", 
    "The sticker like wood effect is already peeling off on the corners after 3 weeks.", 
    "This is a great table. As stated in an earlier review, the wood grain is a sticker, and it is peeling a little around the edges. Not enough that you can easily notice it, but if you run your hand against it, you can feel/hear it pull back. The sides aren't as rustic as I was imagining - they're on the shinier side.Size is good. Definitely on the bigger side - I live in a 925 sq ft apartment, and don't have a ton of space, but it's not so big that I would consider returning it. About the same height at my couch. Shipping was a little shoddy - the box was torn to shreds when I got to it. I was really nervous that the table would be damaged inside but it was fine. Was shipped to me FedEx; ordered on a Saturday evening, got it the following Thursday. Putting it together was super easy - took me about 25 minutes to do it by myself. All you need is a screwdriver. I had to bring it up a flight of stairs which was somewhat difficult, but I managed just fine - I'm a 135 lb female. But the weight/shape did make it awkward, not to mention I didn't want to rip the box anymore than it already was.Overall I'm very happy with my purchase so far! Worth the $$!", 
    "This coffee table was easy to assemble, doesn't scratch easily, and also easy to clean. If you are looking for coffee table that looks good and can be actually be used, this is a good option.", 
    "they are beautiful sturdy and roomy", 
    "This table us very nice. I have received many compliments on it. Well worth the price!", 
    "LOTS OF TIME INVOLVED TO ASSEMBLE THE PIECES FOR THESE.", 
    "We purchased the table and as we were assembling it we noticed the edges began flaking off. The table was much heavier than we originally thought and it was sturdy. The edges are not glued well and the table will not be a good long term purchase for that reason. We chose to return it.", 
    "This one is hard to put together. I still don't have it together. I put it together wrong at least 3 times and gave up. Waiting for a friend to help me finish it. It is too big for my loveseat so I think i will give it to my son. I need to find a smaller table. to fit my loveseat.", 
    "The table looks beautiful, and by assembled furniture standards, it was very easy to put together.", 
    "I absolutely love this table!! It looks great in my living room and great quality!!", 
    "the colors are great, its very sturdy. the top however feels likes plastic... so it looks great but when you get close it feels cheap.", 
    "Finished product looks ok. A few parts were chipped so I'm not sure if that happened during shipping. The instructions were not very detailed so it took longer to put together.", 
    "Very nice! And very reasonably priced.", 
    "This is a great accent table! Colors and design style was much better than expected! Great piece! Easy assembly!", 
    "Sent couch table instead of coffee table.Bur fixed it quickly", 
    "I bought several of these matching items. The table is good sized & the bottom shelf conveniently holds the storage baskets I have. They are easy to assemble and look more expensive than they were.", 
    "Easy to assemble great lines. Bought this and th tv stand with end table.", 
    "Not a true wood coffee table, it's made of particle board and some parts are peeling with wear & tear. Love the style and color though!", 
    "I really like this coffee table. The color is great and the metal sides are good quality. A little challenging to put together but nothing my boyfriend couldnt handle. I am nervous that the top wooden piece will start to peel since the material isnt the best quality. But other than that it looks great in my apartment and matches a variety of other pieces.", 
    "Easy to assemble, quick delivery", 
    "The veneer started peeling after about a week and the support underneath the center doesn't stay put at all.", 
    "The table is very sturdy, elegant and it has a wide enough surface. The wood looks elegant, something I wouldn't expect for this price. The assembly was very easy. The only problem is that the middle leg below the table fell off already since it was poorly designed. However, nobody notices that.", 
    "Very happy with the product.", 
    "Very simple to put together even for a beginner. Well built and really attractive.", 
    "Goes great with the other simple living pieces. Quick delivery and easy to put together.", 
    "I am very happy with my furniture..very sturdy and matches the gray leather perfect..Took a long time putting it together as the instructions were confusing but I love the quality", 
    "Really love these yables but the Really love theses tables but the corners are not good for toddlers. Had to buy protectors so my grandson would not crack his head open if he hit them.", 
    "Not hard to put together at all... very happy with our purchase!", 
    "Got this for my son for college apt. He put it together in under an hour. It's a large coffee table with a lot of storage area. Great for video game stuff, their beer , etc. No complaints. Shipped quick.", 
    "This table is decent enough for the money but it came with a big indent diagonally across the top (possibly from the packaging) that could only be seen in the daylight from a certain angle. Make sure you check pieces carefully before you assemble and throw away the box! Now we're stuck with a table that is damaged.", 
    "I love this coffee table. It was exactly what I expected after reading the reviews and comparing the price.", 
    "It much to the one I expected", 
    "I love them. Very good quality", 
    "Love this table the color,the style and it fits perfect in the living room. .so glad I bought it", 
    "This table is bigger than I thought it would be. I comes out farther away from the couch, if that makes sense, than I thought it would. But I love it. It looks like really high quality materials, seems sturdy, and the coloring works really well with my steel grey couch and loud accent paintings in the room. It's a great buy.", 
    "easy assembly and very sturdy", 
    "Just what I was looking for!", 
    "Functional, attractive & pretty sturdy!", 
    "Easy to assemble and looks beautiful", 
    "Easy to assemble. The color is too light that does not match my leather sofa and dark color wood floor.", 
    "It looks nice, not sure how well it will hold up though", 
    "We got this to go with our new tile flooring and the design could not have worked better. It is also heavier than I thought it would be which is great since we put a lot of wear and tear on our furniture.", 
    "STURDY EASY TO PUT TOGETHER WE LOVE IT", 
    "I love this living room set. It is exactly what I had hoped for. Easy to put together. Great buy!", 
    "The look and style is perfect! Easy to assemble!", 
    "Perfect size finish and easy to assemble", 
    "Easy to assemble and nice quality", 
    "The \"veneer\" is nothing more than a sticker!", 
    "I was really enjoying this table up until 6 months after my purchase when the sides started getting air bubbles.", 
    "Perfect for my apartment. Easy to put together. I have had this item for over a year and have had no issues with it.", 
    "Love this table, my 7yr son and I put it together ourselves, nice wipeable finish it was actually larger than I expected, but still worked for my household.", 
    "This is a great table for the price. The colors are just what I needed. It's exactly as shown in the pictures. Looks great with dark furniture and the oak flooring. It may be laminate but my experience so far is that it is far superior to pressed wood furniture with the wood looking finish. I use coasters and haven't seen any signs of bubbling on the top like you do with pressed wood. I am extremely satisfied with this purchase.", 
    "The texture is great and so much space!!", 
    "attention to the sizes, these ended up being larger than I expected. I was disappointed that the table is a plastic veneer. They look nice from a distance but a bit cheap up close and I expected a real wood veneer for the price. I would not purchase again and will probably sell these to get nicer pieces.", 
    "Love love love. Perfect color and size. Easy to put together! Definitely a good buy", 
    "I bought this coffee table about 9 months ago and the \"paper\" wood like finish is bubbling on the ends of the table. I'm very disappointed in this product, would not recommend it. Shows all water marks from glasses too.", 
    "Decent quality. Good price", 
    "Good quality but the laminated has bubbled in some places along the sides. Kind of irks me but it hasn't ripped.", 
    "The table looks great and easy to put together. The only downfall is that the detailing is one large sticker that is peeling in one corner, it came in that way unfortunately. It's not something that is noticeable and the table is great for the time being.", 
    "Unfortunately poor quality and we have to return it", 
    "Easy to put together and looks very nice in the living room. Needed a lighter coffee table to brighten up the room with our black couchest. Looks great.", 
    "I bought the tv stand, coffee table, and end tables and I love them.", 
    "Nice-looking & very easy to assemble.", 
    "Looks as good in person as it does in the photo. Easy to assemble, came with all of the pieces. Definitely recommend getting the matching end table.", 
    "Garbage item, particle board. Arrived broken. Couldn't return it fast enough.", 
    "Me and Mt husband put this together. Didn't take long and we love how it looks", 
    "Great coffee table for a good price. Color matches well with Grays and blacks.", 
    "Table was easy to assemble. Heavy and sturdy and it is large so you should have a big space, 48\"L rectangular. Has smooth surface since it is lightly laminated coating which is good for everything my family puts on it so easy clean.. Thinking about getting the coordinating end tables.", 
    "beautiful cocktail table that gets lots of compliments from guest", 
    "The table arrived quickly and is true to the picture. It is heavier than I expected, but that is a good thing. The quality is good and the price was perfect. Assembly was easy, but I needed some help picking up and holding the pieces as they were too heavy for me.", 
    "The table is sturdy, but when assembling, I noticed that the gray grain on wood was actually a sticker. The sticker started to come up a bit in the corner, but otherwise it looks ok. The table is quite large, therefore provides a lot of space to place stuff.", 
    "Once I put this coffee table together I realized how massive it is in size. It's akwardly tall, taller than my tv stand. Wouldn't recommend it unless you have a very large living room.", 
    ""
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Seneca-XX-Black-Grey-Reclaimed-Look-Cocktail-Table/8847268/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8847268/Simple-Living-Seneca-XX-Black-Grey-Reclaimed-Look-Cocktail-Table-e733afa1-de47-4a69-b0fe-515cfd01299b_600.jpg"
  ], 
  "description": "Add a classic touch to your living room with this rustic cocktail\ntable. The versatile table doubles as a coffee table as needed, and\nits durable supports ensure it can easily hold the weight of\nmultiple drinks or platters of food when you have visitors. Each\nrustic cocktail table features a stylish reclaimed-look finish and\npowder-coated frame that can stand up to the rigors of regular use\nby family members and guests. This coffee table forms a unique\ncenter point for your living room. The metal hardware provides an\ninteresting contrast with the rustic wood finish, and the mix of\nmaterials and finishes included in the table allows it to fit in\nwith home decor from contemporary and urban to rustic and\ntraditional.Features One (1) Lower shelfSet includes: One (1) cocktail tableMaterials: MDF Board with PVC laminated with reclaimed look\n  finish, Powder-coated steel frameFinish: Black/reclaimed greyDimensions (overall): 20 inches high x 48 inches wide x 26\n  inches deepShelf dimensions: 44.5 inches wide x 24.5 inches deepMatching pieces sold separatelyStyleContemporary, Rustic, UrbanMaterialLaminate, MDF, SteelTypeCocktail Tables, Coffee TablesFinishBlack Finish, ReclaimedShapeRectangleAssemblyAssembly RequiredColorBlack, Grey"
}