{
  "name": "Simple_Living_Piazza_Coffee_Table", 
  "price": "EUR 118.03", 
  "reviews": [
    "I love this coffee table! It was a little tricky to assemble since the pieces didn't fit perfectly but you can't tell. The coffee table is perfect for a small living room in the city - love that it's a good length compared when paired with an extra long 3-seat sofa but narrow enough that it doesn't take up too much floor space. Great price!", 
    "Wasn't wanting to pay an arm and leg for real wood. This table is actually really good for the price. Its heavy! Very easy to put together! I did it myself within 25 minutes or less, you don't need two people. The only screws that didn't line up with the holes are the ones on the bottom of the surfaces, but with a little muscle there's no problem getting the screws into the particle board, which I will add is painted black(a plus). I will be getting the side tables to match, maybe even the console table.", 
    "It looks great with the side table I bought. Plenty of room to have books and magazines on top. The cats love the second shelf.Putting it together was easy even I could do it.", 
    "this was very easy to put together and it looks rustic. You definitely need 2 people though just to keep everything straight and even", 
    "the pre-drilled holes did not line up so one side is longer than the other.", 
    "Missing pieces not good quality", 
    "put this together by myself with very little trouble", 
    "Easy to put together. Works great as we needed. very good value.", 
    "I purchased for my family room as a coffee table and ended up using it for a tv stand. The table is well constructed and easy to assemble. It was shipped quickly and well packaged.", 
    "If it's not otherwise stated in a product description, my assumption is that an MDF product has a wood veneer of some sort. The shelves for this product (and others in the same family) have a veneer that is basically a big, plastic sticker. It looks very cheap and fake up close. You can even see the seams where it's been wrapped around the edges like a Christmas present, folded on the corners. It was already starting to peel up at some of the seams and corners when it arrived. If the description had stated it had a stuck-on plastic veneer, I would not have purchased.", 
    "Now that the table is put together, it looks nice in the room, but considering the price and assembly time, I would not recommend this table. As someone who hasput together a lot furniture, this was the worst piece of furniture I've ever had to assemble. You will need at least two people, and I would recommend having an electric drill handy as well. Most of the screw holes were not pre-drilled, and of the few that were, some of them were off center. The wood finish look is achieved through contact paper. This paper, as well as the metal frame got scratched just from sliding the lower shelf into the frame during assembly.", 
    "sturdy frame, trendy look. the surface probably won't withhold much wear and tear, but great for the price!took about 20 minutes to construct, great instructions. a little difficult to keep the table top aligned to the frame when assembling."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Simple-Living-Piazza-Coffee-Table/9779330/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=16", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9779330/Simple-Living-Piazza-Coffee-Table-dfad7604-9995-47ed-b246-c52a04039879_600.jpg"
  ], 
  "description": "Give your living room an updated contemporary look with this Piazza\ncoffee table from Simple Living. Featuring two shelves with a\nnatural reclaimed wood finish on a simple box metal frame, this\ncoffee table's uncluttered design and mix of wood and metal brings\na modern, industrial look to your home.Includes one contemporary style coffee tableMDF and metal construction offers strength and\n  durabilityNatural reclaimed wood finish adds warmth to the designShelf measures 4.5\"H x 42\"W x 16.3\"DCoffee table measures 18.3\"H x 42\"W x 18.1\"DRequires assemblyStyleContemporary, ModernMaterialLaminate, MDF, MetalTypeCocktail Tables, Coffee TablesFinishReclaimedShapeRectangleAssemblyAssembly RequiredColorTan"
}