{
  "name": "Sivan_Health_and_Fitness_Yoga_Kit", 
  "price": "EUR 21.65", 
  "reviews": [
    "The yoga set is truly amazing included in kit is a mat plus a shoulder carrier, balance blocks and support strap. You can\u0092t beat this price anywhere. No odors coming from the mat of any kind. I\u0092m so pleased with my kit. I began taking a class again the first of August so this is perfect.Thanks, overstock.com you did it again!", 
    "Love this item! Great quality. The color is true to the picture...bright!", 
    "This mat is too thin and hurt my knees when doing Yoga. Overstock customer service was very nice and handled my return without a problem.", 
    "This kit had everything needed for our girls yoga class. Very pleased!", 
    "I love it. The mat is very short, about 5\"4. perfect height for me but any taller people maybe not.", 
    "The set is complete and convenient. The thickness of the mat is adequate but I wish it was thicker and softer...It was a very good purchase for the price however.", 
    "A must for anyone that does yoga, love it", 
    "liked quality; though they did smell a little strongly at first; aired them out and they are fine now; recommend.", 
    "I don't do yoga, but I do use this mat to stretch out before I do elliptical training. It stays in place on my hardwood floor and is comfy to sit on to do my stretches. Due to its comfort level, I would guess it would be a great yoga mat!", 
    "great price for this package and great quality", 
    "It's like one stop shopping. This is just what I needed to start me on my new journey. The lost of my dad then my mom only to find out I had breast cancer all in one year was a lot but thanks to this little mat and blocks I can find peace and I look forward to the next day. Oh yes the mat is well made and I like the color blue because it is calming to me.", 
    "Great for the price, however, the bag could be larger.", 
    "My daughter chose this and couldn't be happier", 
    "I am a beginner at Yoga and this set is really inexpensive and is great for newbies.", 
    "I really like my yoga mat, it's nice and thick and the bonus yoga blocks and bag are a nice additional feature!", 
    "all together kit to get you started", 
    "not much grip and very thin", 
    "Excellent cost for a yoga kit. Has some smell of plastic but goes away really quickly.", 
    "This mat is only 3mm thick", 
    "the matte is not slip resistant at all. I need to use the blocks to keep my hands in place", 
    "Good yoga mat and blocks for such a low price. Not much else to say. I can't see why you'd need a more expensive mat than this. Great for home yoga practice.", 
    "Nice mat to use for my yoga class. Have not used the strap or blocks, yet, as they are provided at the class. Like having a light case for transport.", 
    "My wife uses this and finds the length OK but the mat needs to be a little thicker for when she is in a sitting position for any length of time.", 
    "This yoga kit has been very useful to me. It is lightweight which makes it very easy to carry in and out of class and to travel with.", 
    "Yoga mat with blocks included. Good product! It's long enough for tall people.", 
    "excellent! love the carrying bag for mat", 
    "The yoga mat is pretty good. It does make a dent when you stand in a position too long. Otherwise it's pretty sturdy. The bag broke. It was made cheaply and the stitching was sloppy. I had to sew it with a needle.", 
    "I'm a yoga novice, so didn't want to spend $** for a mat when I might not keep the practice up. This set was perfect. The blocks help with the difficult positions and the mat is long enough (about 68\") so that I can stretch out fully. It grips well (mine is placed on a rug) and doesn't smell like chemicals.", 
    "Absolutely a great price for what you get! Definitely recommend this yoga mat!", 
    "I loved this Yoga kit. I use it every other day. The product is durable and perfect for someone who is a beginning Yogi. The Yoga mat helps those who are unable to be on the bare floor. The blocks help you to get into Yoga poses and the belt helps with opening up difficult areas such as your arms and heart. and assist in stretching hamstrings. I love it just after a few practices I noticed a difference. What I like most of all about this product is it's quality. This kit will last for years and it has washable services.Yasmine"
  ], 
  "link": "http://www.overstock.com/Health-Beauty/Sivan-Health-and-Fitness-Yoga-Kit/9245090/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=1", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9245090/Sivan-Health-and-Fitness-Yoga-Kit-8791ae0e-8fa4-4116-926b-9979b462f286_600.jpg"
  ], 
  "description": "Start a healthier lifestyle at home with this foam yoga mat. The foam yoga mat is great for a variety of stretching exercises including yoga and Pilates. Foam blocks and straps provide extra help with the more difficult yoga poses. The carry bag allows for portability to keep up with your fitness routine even when away from home.\nModel: YOGO12-P, YOGO12-BRecommended use: Exercise, stretching, PilatesWeight capacity: 300 poundsAdjustable positions: FlatAccessories: Carry bag, two (2) yoga foam blocks, strapMaterials: Foam, thermoplastic elastomer, PVCDimensions: 68 inches long x 24 inches wideProduct FeaturesFSA EligibleYoga Item TypeKits"
}