{
  "name": "Spine_Book_Tower", 
  "price": "EUR 124.52", 
  "reviews": [
    "I saw my first book tower in a retail store in black, and knew it was just what I needed, but it seemed very pricey. On checking Overstock I saw the same idea, but in silver grey instead of black, and at just over half the price. Now that I have it I realize that the color barely shows, and makes no difference. It was delivered in near record time. I assembled it myself, and it was quite easy, even though I had read a review that said it was difficult. Believe me, it's easy. I am very happy with the purchase and the transaction.", 
    "I have been looking to get the vertical book shelf offered by stores such as DWR and Chiasso, but the cost + shipping surcharge was too much, in my opinion. I saw this version on Overstock recently and after reading the reviews, I ordered it immediately. Bottom line: It is a good quality product, but it lacks the same design aesthetic as the other offerings. It is not glossy powder-coated steel. Rather, it is textured steel with a light gray color. It also appears slightly more boxy and bulky as far as the footprint, which is larger. It only comes in one height; I would have preferred another 12-18 inches. Even so, it's a great buy for the price and $2.95 shipping, and once you cover it up with books, it mostly disappears.", 
    "I always wanted one of these to store those \"look at books\" that we usually put on the coffee table, but the towers that I saw were always too expensive for my budget. It takes up so little floor space and stores so many books. I was a little concerned when I saw the five-pound per shelf limit but the heaviest books are on the base and everything is fine. It was easy to assemble and my friends rave over the \"book sculpture\" in the living room.", 
    "I own a number of spine-style shelves, but all my existing ones are Sapien Bookcases. I assumed these would be similar, and they are; however, the quality is not as good. The edges and welds are a bit thrown-together seeming, and the fact that the shelves must be screwed on instead of just lifted in like the Sapien style is a bit annoying. This makes it harder to remove or add shelves as needed. Also, the distance between shelves is less useful on this model; the Sapien shelves are wider apart and fit a good quantity of books. On these, I had to leave some of the shelves off to make room for larger stacks. I'm not a metallurgist, but the finish on these seems almost sprayed on, and sort of chintzy in a way that is hard to qualify. Also, instead of nice embedded rubber feet on the large base, these just come with adhesive pads. Not terrible, but I would actually recommend paying just a bit more for better bookcases of this style.", 
    "I have been eyeing these spine bookcases all over the Internet. Many companys and manufacturers offer them in a ton of price ranges, most of them at least 60 to 80 dollars more than here. I bought this and placed it in my bedroom. I am very satisfied. It took my husband about 8 minutes to assemble and he had no problems whatsoever. All pieces were completely straight and perfect. The shelf holds a lot of books for the small footprint size. I would recommend this to my friends, that is if they don't already die wanting one when they see it. It's so much better than those cheap compressed pieces.", 
    "Love it! Make sure you understand how tall it is. As another reviewer mentioned it's a little shorter than I anticipated but once filled with books it looks amazing. All my guests are perplexed and intrigued by this unique book shelf. I bought one but plan on buying another to create two seemingly precarious towers of books aside my sofa. Great price for such a distinct piece.", 
    "I have another spine bookshelf from a different company that's a slightly different style, and they complement each other nicely. I actually prefer this one to the other one, which was more expensive and \"high end\". Easy to put together and very stable.", 
    "this book tower is built to last!! it is sturdier than the more expensive ones i bought elsewhere. the color/finish \"is what it is\"- so i sprayed it with Rustoleums' metal paint to match other furnishings. 2 years later it looks and works great.", 
    "We love it, we love it, we love it! We saw the same type of shelving from a sales catalog for about 50 dollars more. Though the color is grey and not orange like the other one we saw, by the time we placed the books on the shelves the room looked instantaneously warmer from the books on display. The slender vertical configuration is perfect if you only have a small space but need to store lots of books. If you place the bigger books at the bottom it will lend a nice, balanced look. Assemblage was very quick and easy, but you will need two people.", 
    "This item is as pictured, I just wish I had bought something else. I use it for towels in my contemporary bathroom. I roll up the towels and stuff them between the shelves. I don't think this items would work very well for books, as it is just not that sturdy.", 
    "It is a space saver but I can't use the top shelf for books because it is missing a screw to secure it. Overall I am enjoying the book case", 
    "I was excited to see an affordable version of the Sapine bookcase. After assembling the tower and adding books and dvd cases, I will be purchasing more in the future. I would be so happy if the vendor made other colors! So here are my two cents. 1) The item was well packaged, all holes and screws fell into place, no warping. Comes with a small allen wrench which is all you will need to assemble. 2) Assembly was very easy. Something you could do while watching tv with the family and be done in 10-20 minutes. Most of the time is spent tightening screws. 3) The finish is not luxurious, I would prefer a laqcuer, but I understand I would have to pay a premium for that. I am stuffing this tower so that it looks like a giant stack of books, so the only place the finish shows is at the base. 4) Stability. I have a good amount of large, hardcover books, they seem to be holding up well. The spine is not bending. I made sure to put the heaviest books on the bottom shelves. Again, the original I am sure is stronger, but for the price, this is a good piece. 5) It holds a lot of books in a small footprint. 6) Removing shelves does involve some unscrewing, but I am using all the shelves now. So this is not an issue for me. Overall, I am very happy with this purchase and just hope I can get it in more colors, but will settle for the silver if that never happens.", 
    "Love it. It's very useful when you have a space constraint!", 
    "I purchased this after seeing a similar product at CB2. The quality of this product not equal to that of CB2, but it looks great and does the job. However for the *** saved if I could do it over I'd by the Tower Bookshelf from CB2.", 
    "The Spine Book Tower is great! This is the second one I've ordered. Holds lots of books in a small \"footprint\" and you can \"dress it up\" with a can of spray paint. Wonderful product.", 
    "I couldn't be happier about this shelf. The price is 50 dollars less than other location and this is a very heavy piece of furniture. I really really like it!", 
    "A friend of ours had a book tower from a retail store that charged 2x what I paid for from Overstock. The one from Overstock is great, seams sturdy and is now filled with about 30 books. I am pleased with my purchase.My only regret was that it was not a available in black, yet at the end of the day, that is not a problem.", 
    "Exactly as promised, easy to assemble", 
    "This book rack is just as it appears in the picture is half the price of the ones sold in the higher priced stores. The only thing I wish is that the shelves were adjustable like its competitor which reduces to 5 stars. But for the cost this is perfect for me as it takes my books and magazines off the floor. I didn't use all the shelves so that I could put a decor item on the shelf. Good Find!!", 
    "This looked like the the DWR (which I already own) or CB2 vertical bookshelf, but it is really a cheap copy. Each shelf requires 2 screws to hold it to the back spine. The previously mentioned vertical shelves require no screws. Each of these shelves also has a little give, feels flimsy, and can only support 10lbs. Better versions have no give and are much more sturdy and solid feeling.I didn't realize the shortcomings of this shelf until after I had unpacked it and saw the assembly instructions. For less than $$$ I will deal with it. It will cost more in time, effort and shipping to return it. Do yourself a favor and pay more for the better vertical shelves that are out there.", 
    "Perfect for small areas, extremely sturdy.", 
    "I keep this in my kitchen to house all of my cookbooks and I could not love it any more! Small footprint, yet holds all of the heavy cookbooks I love.", 
    "Went together easily. Use it for dvds. Plan to put in order so they can be found. Putting dvds in a drawer may be neater but I forget what I have!", 
    "I am addicted to magazines and books, and this keeps me organized . I only wish it came in a different color. I ordered a second one!", 
    "I live in a Towhouse where the rooms are small. I have two towers. One is in a small den, and the second in a small guest room. Because they are horizontal, they take very little room. Best of all--they hold a lot of books and look cute!", 
    "I bought two of these and they are very sturdy and attractive. Easy to put together and looks great loaded with books", 
    "I need another one. The one that I have is already full.", 
    "This book tower is as described. It holds 90% of my books and is very sturdy. No complaints.", 
    "love it keeps all the cookbooks easy to take out", 
    "As nice as the one i bought from DWR", 
    "Easy to assemble and really sturdy. Great purchase.", 
    "I bought this for my son's room: a modern design with brushed metal accents. This book shelf is small and just sort of blah. It would be better if it were at least 1/3 again the size, and if the shelves were larger. I would have returned it, but my son and his friend destroyed the packaging. I would say it's worth less than half the price.", 
    "too heavy--didn't like this design done in raw metal", 
    "Because I live in a small apartment, I LOVE these spine book towers. Everytime I break my promise not to buy more books, I can find a place to slip one of these book towers. Since I have no more room for a bookcase, they're perfect- I have 6 of them!! Sturdy, attractive and practical.", 
    "This is an excellent and more affordable version of the tower shelf you've seen in price catalogs. Simple to assemble and extremely sturdy. Have gotten many compliments on it. I've seen it used to store folded towels (in a guest room or pool house) in addition to books. Looks especially good when it's full and you can't see the individual shelves.", 
    "sturdy and functional and out-of-the-way. Wanted to get them for my grandchildren but they couldn't remember seeing this in my house.", 
    "What a great idea! No more books stacked on tables. Beautifully displayed and easily accessible.", 
    "Works well for small spaces and keep books tidy.", 
    "Nothing you have to put together is ever perfect, the holes were a little off here and there but once it was together it was wonderful and I love it.", 
    "I was looking for a book storage without having to buy a traditional bookshelf. This definitely fit the bill. It takes up so little space and holds so much. One of the screws have me a little trouble but after a minute I was able to thread it in place. Set up took about 15 minutes. Great buy.", 
    "Great bookcase which takes up very little space and keeps all your books and magazines organized and within easy reach. Very solidly built and a great addition to my office.", 
    "Easy to assemble; much better price than the ones I purchased earlier from another source. I love the style and I ended up buying another.", 
    "I get so many compliments on this bookshelf it is not even funny. Great conversation piece.", 
    "I'm getting another one. Great space saver and looks great anywhere.", 
    "Small enough to fit in a corner and display pictures and in knicknacks.", 
    "I have a lot of books and modern furnishings so love having the option of this unique design.First ordered one to try it and now on number 2 . Not possible or desirable to overload but each little shelf can hold max 3 books depending on weight and size. I like it a lot.", 
    "This can be used for many trhings and especially a combination of books mags and stuff!", 
    "I love this bookshelf. It barely takes up any floor space. All of the shelves are the same size, but sturdy enough for several small books or a couple larger ones. It was easy to put together and came with the required Allen wrench. Plus it looks cool!", 
    "One of the slats was bent so the shelf could not fit in. Poorly made product. We have a sapien bookshelf at home and I thought that I could find a similar product, expecting it not to be as well made, but at least functional. Proof to pay extra for a superior product that you will enjoy and will last.", 
    "Exactly as shown. Easy to put together. Can really hold a lot of books and is very sturdy!", 
    "Different from other book shelves I have seen. Nice contemporary look, fits snugly into even small spaces without being too overpowering.", 
    "I would have just liked them a little taller, I just hung a picture above them and they look great!!", 
    "I originally found this product on an expensive modern website. But I always check overstock for better deals. It was not only also on overstock but half the price! I love this piece! You can put the shelves where you want which made it more convenient for our purpose for it which is children's books.", 
    "Easily assembled, with included allen key. NO other tools needed. Took maybe half an hour. Looks great! I always wanted one of these vertical book towers, but couldn't spend the usual $$$. I was so glad to find this on Overstock at such a great price, and with book on the tower, you can't tell any different. Love it!", 
    "I was going through my cookbooks as I had no more space in the kitchen bookcase for them....I realized that it was like giving away a collection I still wanted to keep and I needed to organize them and display them at the same time. I found this online and read reviews carefully; liked the price on this one (about half compared to other sites) and the fact that it organizes books in a less bulky way. It arrived late in the evening and I told my husband women said it was easy to put together and I would do it tomorrow. Next morning when I got up, he had already taken it out of the box and was looking at the directions (unlike me he loves to assemble things) It looks very nice our kitchen corner. It took about 20 min. for him to put it together with me holding on to the spine. He liked how the directions were drawn; \"like a blueprint\". He did say it would have been nice if they added an extra screw, but nothing was missing, so that was no problem. Unlike some, the color of grey looks fine in my kitchen; no need to spray paint it. I don't think it looks cheap either. Big heavier books on the bottom make the shelf bow if you put too many on, but just a few works; smaller ones as you go up and cooking mags at the bottom helps with my magazine clutter habit. It arrived well packed; no issues on that.", 
    "I just love these. They are strong, hold tons of books in a very small space and get positive comments from everyone!", 
    "The book tower takes up little space but has a big impact. We display books and succulents. Easy to assemble and the portability is a big plus.", 
    "Love these book shelves. Very stylish and different. I wish they held more, but the footprint is small enough that multiple shelves is a workable solutions.", 
    "I purchased the shelf to house my cookbooks in the kitchen, I did not want something too large or taking up a lot of space. This shelf is perfect for the job. I put a lot of heavy cookbooks on the shelf and it can handle it no problem. Very good quality.", 
    "Great, sturdy and easy to assemble product. Love it!", 
    "I got this because I don't really have wall space for a bookshelf in here, but I keep accumulating books and magazines. This holds a lot of books and fits on one side of a wide archway we have between the living room and the den. Easy to walk up and scan the spines to pick out a book. It is not conventional looking or particularly attractive, but it fits an informal decor just fine. The metal is gray, and looks easy enough to scuff up and spray with any color you like. If I fill this one up, I will probably get another one.", 
    "I already owned a competors, higher priced spined book tower. I wanted a match for it, but it wasn't in the budget! This is functional and an attractive way to display big picture books. The art on the covers of the book are displayed more on this unusal shelf and I really enjoy it.", 
    "I liked the CB2 version of this but not the price. I bought this as an alternative. At this price you can no expect it be as sleek and finished as the pricier models but it does the job. Easy to put together, one shelf didn't get grabbed the screw well so I just switched the position and all was corrected. It holds a lot of books with minimal floor space. Perfectly does what it's supposed to.", 
    "I like book towers but this one arrived bent, making it impossible to attach one of the shelves. So there is a big gap in the middle of the spine. It was too much of a pain to repackage and return so I kept it with the bent spine.", 
    "I would have given this 5 stars but it has one flaw. The shelves should be a little sturdier. When heavier books are placed on them, the shelf tends to sag a bit and the books are sitting at a downward angle rather than straight across. Other than that I love this bookshelf and love that if you have enough books on the shelves, they disappear and all the books look like they are floating or piled on on top of the other.", 
    "It's a great free standing shelving for books. It's really sturdy, because it's metal; I was a little worried that it might tipped over because i put sooo many heavy books on it, but it's standing very sturdy. Unfortunately, It came in missing 1 small screw and have 1 additional longer screw. So i couldnt put the last piece together, but I chat with the overstock cust service and got the help from them to order the missing screw. It took abut 1 week for them to order from warehouse and shipped me the screw I need ( it came in a pack of screws- but I only need 1) but anyways, i put together the last piece and it's PERFECT!!!", 
    "Spine Book Tower is great addition to a small apt or any room where you want a compact attractive way to display books. Fits perfectly in a small niche new to husband's desk. Easy to assemble, sturdy, holds more books than we thought. Another friend bought one and uses it next to her front door for all the things she wants to take with her when she leaves the apt.", 
    "Screw hoes do not line up. One screw is positioned at a an angle but other screw fits well and the book tower sits away from baseboard and then hits wall at the top. The lean seems to have nothing to do with the screw issue. You are provided very long screws but onlyabout 1/2\" actually attaches one piece to the other. I would not have kept this item if I wanted it to be free standing in a room. However, it actually holds a fair amount of books (for several weeks now) and seems to be holding up well.", 
    "This was very similar to a very expensive version I'd seen in a design store. I was not disappointed at all! I will be buying another. I hope there will be more in stock.", 
    "Bookshelf was difficult to put together at first because the base holes were not aligned. After some hammering, was able to fit the screws in. Basic, inexpensive (relatively speaking) bookshelf that met my needs. I needed to \"house\" some text books. The individual shelves seem a little flimsy, giving the appearance that they will \"give\". However, they are sturdy enough to hold all my books. It's a useful piece of furniture that I don't have to wory about matching my whole room decor.", 
    "This bookshelf is great! There are others like it out there that cost twice the price of this one. It was very easy to put together. I had it assembled with books on it within an hour.", 
    "I love those towers. I have one that I bought 10 years ago and I payed over $ $$$$ which is very heavy and much taller. The grey one is very light and easy to assemble. Very useful however looks chip.", 
    "I love my book tower and will probably get another. This product was easy to assemble, and is incredibly useful. It fits almost anywhere, and is a stylish, unique space-save while serving its important purpose.", 
    "I needed two book towers for small spaces in my home. This product fit that need perfectly. The product is sturdy and very easy to assemble. I have one in my bedroom and one in my TV room. You can adjust the shelves to be more open by leaving a few out if you desire. I'm thinking about purchasing another for my office.", 
    "There was a manufacturing defect in mine -- the pieces wouldn't fit properly. I confirmed this with multiple people (I'm good at building IKEA furniture, and this is much simpler job than most of their pieces, but the \"spine\" wouldn't bolt onto the base properly. Needless to say, I don't think it's worth it to send back--it is a very large, heavy box. Other than the defect, it's just as described/pictured.", 
    "This bookshelf is amazing! I can see all of my books now and actually use them without having to buy some behemoth book case! The individual shelves on it are slightly more flimsy than I would like, but they still hold all the books, they don't collapse or anything, rather they just slant down a teeny bit, but if all the shelves look that way, then it looks fine. I was just under the impression that this was a big hunk of heavy, solid, unbending steel. It's powdercoated metal but still looks attractive. Some of my books just aren't big enough to cover the entire shelf, like if you want to put smaller paperbacks on it, the shelf is exposed, but for larger books and hardbacks, it's perfect. Highly recommend this product!", 
    "easy to a sample I had not double with it, but one of the shelves had a little damage, but it got covered up by books. I really didn't want to take it a part again so here it is . I am happy with the product otherwise.", 
    "Excellent product, and the price is just what I was looking for without spending a lot o money for the same producto somewhere else", 
    "i now own 3 of these, wised up after purchasing the first from CB2 at $50 more that I could get the same ones on Overstock. Easy to assemble & the original ones purchased 5 years ago are still as sturdy & trendy as ever!", 
    "Great bookshelf... takes 15 inches of floor space but holds about 3 dozen novels! Perfect for my reading nook.", 
    "would recommend to a friend and would buy another one.", 
    "Holds a lot of large books and looks great in my photography studio! Would definitely buy again!", 
    "Purchased almost the same item from The *** for $150...wish I knew about this one beforehand. Great concept and space saver holding a good amount of books without having to purchase furniture or install wall book shelves. The Container store product was easier to put together and did not have inexpensive packing material. The styrophone breaks in a million little pieces when broken creating a huge mess... OS.com could use better packing material.", 
    "I bought a second one, I like the first one so much!", 
    "I received the tower very quickly. When I tried to assemble it, Idiscoverd the post was bent. I called the company, and a new post was shipped the next day. The tower is now together, full of books and I and everyone who sees it loves it. They want to know where I got it. I live in a mobile home and space is at a premium, so this tower works very well for me. Quality and service are great!!!", 
    "I love these bookshelves.. I oogled them at cb2 for years but wasnt ready to spend the $$ on them.. decided when we moved i would do some searching and low and behold o.co had them for less... they werent hard to put together and I love the way the look. They are heavy which is nice since they wont move over and people always compliment us on them!", 
    "Though not quite as unobtrusive as in the picture when brought into real life, this is a very well made, functional piece which does exactly what it was intended to do: store books in a minimalist fashion.", 
    "Read the description carefully for the measurements - it is not as high as it looks on the picture...which i actually like, it fits perfectly nexxt to my contemporary couch by a small strip of wall b/w two windows. You definetely don't want to overload the shelves. Overall, decent qauality and cool looking shelf! My frineds already asking where i bought it!", 
    "I really like this bookcase. It looks so unique. I have gotten several comments and compliments on it. I have it in the dining room filled w/cookbooks, perfect for a small space.", 
    "I had a small space and needed additional storage for books and this book tower worked out great. I had seen similar product a some national furniture stores but it was so expensive there. This book tower looks just as good and cost so much less.", 
    "Once again found product that I was looking for on the Overstack,less costly and free shipping .", 
    "Very functional; sturdy and space saving. XXXXXXXXXXXXXXXXXXXX", 
    "I bought this to hold all of my cook books so I can have them handy in the kitchen area. Obviously you must store the larger, heavier books at the bottom. I was pleasantly surprised how many books I am able to store (about three dozen cook books) without overloading the shelves. The vertical storage shelves make it very easy to pick a book without disrupting the others. When I stored cookbooks on a horizontal shelf and removed a large book, the others would fall over, even with book-ends. I really like this book tower.", 
    "I live in a studio in the city. So how do you solve the problem of a book lover with limited space while holding onto your deposit? With this awesome Spine Book Tower. This item is functional, modern, and economical. I had a small hickup during assembly but all the tools and parts were provided. Overstock, another great product!", 
    "It does the job. It holds a lot of my very heavy text books. My only wish is that they made one that is a bit more decorative.", 
    "I love the aesthetics of this book tower - I use it for my cook books in the kitchen with other SS finishes in there. The books are the star not the shelf. BUT, it does lean forward, the shelves hold the lighter books, but anything hardcover, you can only pack 2 or 3 at most per shelf before the lean starts. You have to put all the big/heavy ones at the base. Having said that - I still like the flexibility of it but the shelves and spine could be more sturdy .", 
    "This book tower was easy to put together by myself. It is sturdy and appears to hold a lot of items like books, dvds.", 
    "Great modern bookcase, easy to assemble, looks great, would recommend. Thanks!", 
    "It is a lovely piece, just does not hold the amount of books that I expected of it. It is just \"okay\" in my book, however, it is great for getting things off the floor and stacked in some order.", 
    "This is a perfect replacement for someone looking at more expensive book towers at some of the higher end designer stores. Holds a lot of books in a small amount of space.", 
    "The price was considerably lower than other stores so I was unsure of the quality. I was pleasantly surprised; sturdy and easy to put together.", 
    "Overall the tower is a good buy for the price, would have liked it to be a bit taller however it fits a fair number of books and still leaves room above for art work on the wall. Was very easy to assemble and looks great on the side corner of my daughters room. Definitely recommend it for the price.", 
    "These look amazing in my hallway and I'm considering buying a 3rd. You can actually remove shelves so I had left over shelves and just recycled them. Lots of complements on them so far", 
    "A great space saver! I totally love it. It is so easy to assemble that instructions were not included. It seemed a bit overwhelming in the beginning! But I figured it out and a couple of the shelves didn't fit until I had to hammer the screw slots. Overall I am enjoying the tower and it fits in the tiniest space.", 
    "The color, a flat dishwater gray, is nothing special. But the shelf is reasonably sturdy, stylish, and certainly saves space. A good value compared to similar *****l products, although a little on the short side.", 
    "I researched the versions of this shelf at west elm and design within reach. This one doesnt have as nice a finish and its not as tall, but you know what? It works great and you dont see the shelf itself when it's full of books.", 
    "This bookcase was fairly easy to put together. It is more industrial looking than \"fashionable'. I bought this for my college-bound son to use. It is very sturdy. This has to be placed against a wall, as the spine, or back shows the many screws that hold the shelves in place. This would actually be a great piece to hold manuals, etc. in a garage.", 
    "I ordered the Spine Book Tower as a Christmas gift for a friend. Everything about ordering and receiving it was simple, and delivery was prompt. My friend now has it put together and in use. It looks great, and she is very pleased. At first, she worried that it wouldn't be stable, but now, loaded with books, it would probably take an earthquake to move it.", 
    "Great, space saving bookshelf for crowded teen bedroom! Easy to put together.", 
    "Easy to assemble. Very similar, but much less expensive than a book case seen at another retailer. I was trying to keep a clean, modern look in my dining room while still having a place to display my cookbooks. These book towers fit right in.", 
    "These are perfect and very sturdy. I am not afraid of how heavy the book is - the metal is strong. Love it!", 
    "This is the second Spine Book Tower I purchased from overstock. I love the style, the design, the quality and of course the price. Other popular sites carry identical book towers, however their prices are always higher. I would highly recommend this product. A+", 
    "I am very happy with this purchase! It stores a lot of books, looks great and was a good price compared to other places that were also selling the same kind of thing.", 
    "Love the look & function of this. Base is a little larger than the more expensive version sold by others, but it's definitely stable.", 
    "Great item! Perfect for keeping my cookbooks organized. Super cool storage option. Love it!", 
    "This shelf reminds me of some old boyfriends...cheap but nice looking...It is stylish but is not very stable or well made. The price is right and you get what you pay for!", 
    "I love this product! It is very sturdy and easy to put together. It also looks great and makes my cookbooks (which is what I bought it to hold) very easy to assess.", 
    "The title says it all. Easy to assemble. Looks fantastic. Appears to be uber durable and sturdy.", 
    "1. You cannot put anything too heavy (not more than 2 books) because the shelf starts bowing down.2. I tried filling it completely with books to support the shelves. This will not allow you to take a book from the middle because all the books above it will just topple over.3. The shelves are too slippery. If you try to take the middle book from a pile on one shelf, all the books on that shelf will move.Basically, useless for books.", 
    "But not as tall as I would have thought from the picture - still like the shelves. d", 
    "I would have liked to buy the higher end shelf at another store mainly because I wanted the taller unit. I decided to get this one due to the price. It does not hold as many books as I would like, it looks nice and is functional. Note don't start putting the shelves on in the middle, it was easy to put together, took me longer because I didn't look at the instructions.", 
    "I was very pleased with the ease of construction and the overall sturdiness of this piece.I have a magazine collection that tends to add quite a bit of weight to shelving and this system has taken the weight surprisingly well.", 
    "This thing is awesome. It is very sturdy and classy looking (could stand to be a little taller in my opinion). If you are looking to use books as decoration--this is a great way to do it. I put the bookshelf on one side of my couch and a shelf filled with more books over it. It's like my own private library--LOVE IT! ps-Overstock is basically the best thing ever.", 
    "This spine book tower looks just like it's more expensive counterparts at CB2 and West Elm, but is half the price! I put it together in under 30 minutes, it looks great and fits into my modern studio apartment. Plus, the package came so quickly! I highly recommended this!", 
    "The tower is great for the price!!! It is a little wobbly, but looks great with books or dvds. Have bought several .", 
    "Beautiful! This piece was easy to assemble and holds up well to the weight of many books! It fits nicely in my room (it's not an eyesore) Also the matte gray finish is calming. This product is a great value and I'd buy it again! :)", 
    "Easy to put together, takes up minimal space, and holds books. Love it, am going to get another one.", 
    "I truly love this book tower. It holds all my cookbooks in a small foot print of space. After comparing Overstock's price with another vendor, Overstock's offer was a no-brainer at half the cost. It is a few inches shorter than the other brand, but it has one more shelf, (if I counted correctly) which suits me just fine. Most of all, I assembled the whole thing with the absolute greatest of ease with the included allen wrench. If I don't like the color later, as it is an industrial grey, I can always repaint!", 
    "This is just as shown. For my purposes it works perfectly. I would buy another. Always wanted this but did not want to spend $300. This is a fine knock-off.", 
    "Book tower is attractive, efficient, capable, economic and it fits into the narrow space we had available. A great help in keeping books, etc. from being everywhere.", 
    "Got this for our post-grad daughter for all her extra text and art books. She loves the modern look of it. We wish it was a little taller but it went together pretty easily between the two of us. A great space saver and after comparing prices, a good price.", 
    "Books have been scatter around bed, on and under night stand -- with a small footprint, the spine book tower has helped me organize my space. Thank you.", 
    "Arrived well packed and in good condition. I put it together by myself in about 25 minutes (doesn't require two people or heavy lifting), and no outside tools were required (package comes with the only tool you need). Holds a substantial amount and weight of books -- the base and \"spine\" are sturdy but the middle shelves are a bit flimsy. It is a bit shorter and smaller than I anticipated, but overall a good purchase.", 
    "This book shelf adds a great addition to my newly remodeled contemporary bedroom. It allows me to display my greatest books without creating that much clutter which could destory the look of the bedroom. It has a clean and organized look to it which is what I was after. As I mentioned before, it really does provide the perfect compliment for a contemporary room. Being that the bedroom is in Miami, this contemporary book shelf was about the only one that fit my taste and decor. Take care!", 
    "I got it in 2 days. It was just what I needed. I had checked out other companies this one was more reasonable. Very Happy with my purchase.", 
    "This shelf definitely has a cool factor and gets noticed by everyone who visits. I've seen the exact same shelf advertised at different sites on the 'net and it always costs more than at Overstock.com - - sometimes a lot more! It went together with no problems, - it probably took me all of ten minutes. It was out of stock for a long time, but when I saw that it was available again, I jumped at it and I'm glad that I did.", 
    "This shelf is exactly what it looks like in the picture . . . it was really easy to put together and looks really good full of books are with only some on there. I had this on my wish list for a while due to the price but definitely worth the money and no regrets!", 
    "This shelf is a great buy. It cost %50 less then in other stores. It is really easy to assemble, looks very modern, is really sturdy, and holds lots of books. Great buy!", 
    "The spine book tower arrived quickly and was easy to put together. Looks great!", 
    "The shelves don't support too much weight, but the overall effect is really nice -- sleek and modern, and a perfect knock-off of the Crate & Barrel taller design. The only thing is, it's more of a textured almost pewter color, more gray than silver, so if you're looking to match chrome or nickel, this won't work.", 
    "Just assembled this tower in minutes by myself and tucked it into the very small sapce between my bed and the wall. I now have space for over 50 books within reach of my pillow. I was thrilled to find this at Overstock b/c I had wanted it when I first saw it in pricier home decor stores. It works so well it would have been worth paying full price but I am happy I didn't have to.", 
    "Sturdy, well-made. I've seen this bookcase go for hundreds of dollars in home decor stores. I'm glad I found it on Overstock.com -the same product for a lot less money.", 
    "If you love the look of books on display, but don't have space or desire for a traditional bookcase, this tower is a great choice. I had a small wall space where I wanted books stored, but couldn't find a properly sized bookcase to fit. The book tower works well for small spaces -- very unobtrusive compared to a standard bookshelf. The book tower went together smoothly -- I'm short and of average (female) strength, and had no trouble at all putting the unit together without help. Instructions are clear, hardware worked well, and holes were machined cleanly and at the right spots. I live in a 100-year-old cottage, so most of my decorating tends toward traditional rather than modern. That said, the tower fits well with my other furnishings, mainly because the tower structure essentially disappears once the books are loaded. The base is the only large part (for stability), but even that is minimized if you put some large books there. (Creative types could also do something with paint, fabric, or carpeting to make the base even less obvious.) I did limit the load to about 5 lbs per shelf, but I may see if some of the emptier shelves can take just a little bit more. Keep in mind that it won't hold as much as a full-size bookcase, but its design is definitely eye-catching! It's not an exceptionally tall piece, which leaves room for artwork on the wall above it, if desired. I wish it had been just a bit cheaper, but otherwise am very happy with it. I'd recommend it to others, and may even get another one myself at some point in the future.", 
    "I finally was able to buy them: they look great in my living room and in my bedroom!", 
    "Super easy to put together. Great value! Nice and sturdy. A light grey flat metallic color.", 
    "great value, good for small spaces, modern look, will order more for myself, first order was gift for post college person", 
    "The bookcase is sturdy, and went together easily. The unusual (for a bookcase) design, and small \"footprint\" allows you to either show it off or \"hide\" it in a room, whichever you like.", 
    "Great product in limited storage areas; plus diff way to display/store books.", 
    "I love it!!! Pretty easy to put together, and looks like it does in the picture. Got exactly what I expected. Great purchase!!!", 
    "This book shelf saves room and holds many books! Very impressive!! Very Pleased!!", 
    "Looks great in my creative space, was so easy to assemble, very strong. Placing all kinds of books on it was fun. If this Grandmother can put it together, probably anyone can. It also came promptly.", 
    "I was excited when I saw this product because I'd been looking at them for a while on other sites at a higher costs. The product arrived in a timely manner and I assembled it by myself in a few minutes, maybe fifteen minutes or so. It looks great, very sturdy, I didnt give it a five because the finish is on the dull side, I thought it would be more metallic looking, thought about painting it, but by the tiem I put books on it, I'm not even that concerned any more about that.", 
    "Texture is a bit grainy. Texture is not to my liking. Also color is a industrial gray. Those are the negatives according to me - the aesthetics.Everything else is a positive. Very easy to install. Very good design to keep books organised. Good quality product. Fast delivery. Good price. You will not be disappointed by function of the bookcase.", 
    "I bought one of these for home use and was so happy with it I bought 2 more for my office.They work great for my DVDs (hold about 100) as well as my books. I teach at a community college, so I have a great deal of heavy textbooks, and this shelving unit holds up great.I also love that, while it holds about the same amount of books as a standard book case, since they stack upwards, I end up having a lot more room for books, and my wall space is more open.Not a fan of the gray color, but with the books stacked on it the actual unit isn't even visible, so it doesn't really matter.", 
    "Nice bookcase, sturdy. I use it for my engineering reference books and the unit held up nice. Easy to assemble. It's not as tall as other similar products out there but for the value, this is fantastic.", 
    "This is a great book tower. Its made out of high grade metal and putting it together is a breeze! This is the second one I have bought in the last year. No wonder they sell out everytime they offer this product. A+", 
    "Looks exactly like the spine towers in fancy modern furniture stores - just less expensive. Got the silver and am very happy with it.", 
    "I have been contemplating buying this item for over 3 months. This was also my very first purchase on Overstock. It's very affordable. Other stores sell them for at least $20 to $30 more. I ordered this on Thursday and received it Monday. Assembly total time took 20 minutes and was super easy! Its definitely a space saver and looks great in the corner of my room. It fits well with my contemporary styled furniture. I was able to fit 50 books on all 11 shelves, not including the base which I could fit 8 books on. Definitely love this book spine shelf and will buy another one for my loft/study area!!", 
    "I had been looking for a bookcase for my college age son for quite sometime. This appeared to be something that would work great! After receiving it, he was most definitely pleased. It's exactly what he needed for all the countless books he has accumulated! It's a nice sleek contemporary style. It fits in smaller spaces, and the height is just right. I would definitely recommend this to book tower to someone else. And this arrived extremely fast! Very impressive!", 
    "I bought this with the idea of using it as a stash for paperbacks, but the shelves are too deep so you you have to push the books forward. The gaps in the back look unslightly. I gave this purchase a lot of thought and have to admit that I am not as thrilled with this as I thought I would be. Big kudos to the overall stability of the shelf.", 
    "Great product -- looks lovely, sturdy shelves, very easy to assemble, and at an unbeatable price here. Tempted to buy a second...", 
    "This design is exactly what was called for in my space challenged apartment. Fits perfectly against a narrow wall and holds my entire collection of books. Arrived very fast and was easy to assemble.", 
    "I have been waiting for these to come back in stock. We have so many books in our house, and I was running out of places to put them. This piece fits into a very small area, but holds a ton of books. Plus, it looks great. I, too had seen similiar pieces in catalogs. But, between the higher price and shipping, I just didn't want to spend that much. I probably got both of these for a little more than one of their's plus shipping!", 
    "I purchased this book tower and received it within 48 hours. It was very easy to assemble and looks great. The base and spine are very sturdy which allowed me to fit 65 books. It fits very nicely in a corner at the top of my stairs that would normally be unused space.", 
    "I love this book tower. I have a space between two windows that would have been useless, instead I was able to get over 50 books in that space!!! It looks very modern, it's strong and very sturdy. Other stores carry a VERY similar piece for more than twice the price.The assembly is easy but there are a lot of screws (tool included). Also you will need a long area as it has to be laid down to attach the base.Mine had arrived damaged during shipping, I was able to assemble it while waiting for the replacement part and now it's good as new. I have to say this is pretty typical of overstock, they really resolve problems well. I've been buying from them for a while and have had either good experiences, or problems that got fixed, but never a problem that wasn't fixed.", 
    "im not ranking this 5-stars because the spline was noticeably \"bowed\" when i received it. i had to put some weight on it to straighten it out--- but it looks SUPER good now. i hope it doesnt warp w/ the weight of the books. and for this price, im willing to order a second one.", 
    "I am very hapy with my bookcase. I've been looking for something like that fo more than a year now, and the only one I found was the Sapien form DWR for $325.So I am very pleased with this one, same look - much better price. Looks great filled up in the corner.", 
    "After reading the reviews, I thought I would give this a try. It is well made in terms of ease of assemply, however, it is incredibly cheap looking. Also, it's much shorter than I had expected. I don't think it's quite a good bargain because it's made of very inexpensive material. It also makes the books look a bit messy.", 
    "Nice product. One of the best I have purchased on this site. Looks good and is beyond easy to assemble.", 
    "I love modern, contemporary , durable ( I have many animals) pieces. Rarely can I find something that fits this bill and is affordable. This looks just like the more expensive bookshelves offered through other catalog sources.", 
    "Shelf is great. Ordered it just before it sold out, and will probably order another if Overstock gets more of them. It makes the books look so neat and organized, and holds a LOT of books but keeps them easily accessible. Shipping was fast (2-3 days maybe), packing was perfect, and assembly was simple - could be done by one person, but with two people it takes just minutes. I wish it came in black, but the silvery gray is fine.", 
    "I really wish there was more then a 5 star rating for this bookshelf. Not only did Overstock have it for 3x less then other sites but it's not a dumbed down version. This shelf is study and once filled disappears completely offering me the ability to have streamlined clutter. People are amazed by the huge tower of books that seems like it will topple at any moment and even more amazed that anyone of the books is available at my fingertips without disrupting the entire stack. The craftsmanship is amazing, featuring actual welds (no spot welding here) and a powdercoat finsh. I was about to be suckered into paying 3x the price of this, but on a whim decided to try Overstock, and am so thankful I did.", 
    "A friend of mine had a book shelf like this in her apartment, but told me she bought it from a very popular furniture company at about 3x the price. I knew I would be able to find something similar for cheaper and BAM there it was! When I first saw it on Overstock it was out of stock almost the second day they had it on the website. I added my email to the reminder notice and received one when it was in stock.It was super easy to assemble. My pregnant self and my 9 year old daughter put it together in no time.It kinda feels a little wobbly so i definitely placed it against a wall in the part of the room that wasn't going to be in the way of anything. Once I added some heavy books it seemed to weigh it down more. It's definitely got a great linear, clean look to it.", 
    "I had been looking at this type of book storage at another company. It was almost 3 times the price. It was taller than the ones I purchased here. However, this product is a bargain. The quality is very high. I am very happy that I found it here before spending a lot more.", 
    "It's very industrial looking, but exactly as advertised. It holds a lot of books/magsand is easy to put together and is very sturdy. The only drawback is the shelves are very close together, so it's not good for large books.If you don't mind the aesthetics, it's fine.", 
    "I love this bookcase! It's so easy to put together I did it myself while my husband watched. It's looks fabulous and holds a great deal of books without taking up a great deal of space. You won't be disappointed with this purchase!", 
    "This was a cake walk to assemble. I don't think it was even 20 minutes. The workmanship is fine, but I thought the price was about 30$ more than the value. It fits well in a corner and accomodates a bunch of soft-cover books.", 
    "I was looking for a non-traditional bookcase because I'm not a fan of wood. Plus I wanted something that would not take up a lot of space. This bookcase is absolutely fabulous! It holds TONS of heavy hardback books and is gorgeous. Absolutely a smart buy.", 
    "Family doesn't worry about what to buy for me anymore! I have my \"O\" list and they can pick from there! My latest gift was this bookcase. It is really a versatile piece with a clean contemporary look when empty. After you put your books on the very sturdy shelves, it looks like , well ,. . . a stack of books! I have never seen a tasteful decor that couldn't find room for them!! This spine fits anywhere and really serves it's purpose well. The height is good and makes for a great accent piece, conversation piece and organizer! I use the bottom (base) for magazines and the rest for both hard and soft cover. Try it next to your favorite reading chair or a bed- Although it is a very modern concept, it will work well in a transitional room, an eclectic room, even a traditional room! It just depends on placement and what you put on it. This is my second one and I really like it! Once again, I am pleased with Overstock!", 
    "I saw a bookcase like this on some higher end websites. I was pleased to find it on Overstock. It was very easy to assemble and is very sturdy.", 
    "This bookshelf is very unique, which is what I liked about it. I was worried that larger books and papers would not stay on the shelves (the shelves are not very deep), but no worries there -- large books stay on without any problem, and papers stay on as long as you put some kind of weight on top of them such as a small book. I only rated the appearance of the bookshelf with 4 stars because I wish it was made out of wood instead of metal. On the other hand, you can't see the bookshelf itself very well once it is holding a lot of books, so the fact that it is metal really doesn't matter very much. There are spine bookshelves made out of wood for sale elsewhere on the web, but you'll end up spending a ridiculous amount of money.The shelves are very easy to assemble -- I did so in about 30 minutes by myself. Overall, the value is great for what you get.", 
    "This stand is very substantial. Its made of what appears to be either cast aluminum or steel and is structurally sound, assembly is a snap, and aesthetically, it is so contemporary in its look that it fits in any modern apartment. The best value for me is that I can reduce the clutter of books on various side tables and store them on one great looking piece which when filled with books shows like a piece of sculpture in my home. Like all the other reviewers I'm very satisfied and I thank them for helping me decide to buy it. One last thing... $1.00 shipping cannot be beat.", 
    "The spine book tower is a great way to keep 50 or so books neatly together and convenient -- and it takes up little space. I'd like it to be taller but it works perfectly and was easy to put together. And it allows you to store books in odd corners and in spaces where a traditional book case wouldn't fit. It also is attractive -- a nice room accent for people who think books are beautiful.", 
    "I'm very pleased with the spine bookcase. It is very well made (very heavy) and the design allows me to put a lot of books in a very small space. I've put 50 books in so far and there's still room for more. I put mine in my art studio and it's modern, streamlined appearance fits the room perfectly. I almost bought another brand that was more costly, but am happy now that I got both value and quality with the spine bookcase. Keep it up Overstock!", 
    "This is a great shelving system for the price. It is both economical and very effecient. It looks great with books on it and would look great in any space. I'd buy it again.", 
    "The spine book tower is much much cheaper than any other vertical book towers. Compared to other towers it is shorter. But it does come with more shelves than the other book towers. It's sturdily made of metal and looks fabulous. I did have some problems getting the shelves and the holes on the spine to align, this is clearly a manufacturing defect. I fixed my problem with a power drill. Overall all it is the best value for the product and since its quality is no different than the more expensive vertical bookcases I am planning on buying at least one more.", 
    "at first i was iffy about the price. after getting the spine book tower, i couldn't be happier. it is so compact and holds so many books!! super easy to put together, i did it by myself in about 15minutes while i was on the phone!!", 
    "I purchased this item to go along with the contemporary theme in my decor and it looks absolutely perfect. The base of the book tower is so sturdy and the shelves are, too. Smart design and saves space. Great value for the money!", 
    "This shelf works great for my sons video games. He thinks it looks cool! It was very easy to put together.", 
    "I have only had this item for one day but am already considering ordering another. It provides storage for many books in a very small footprint. It's easy to fit into small spaces and the books appear to \"float.\" I'm no mechanical genius, but I had no problems assembling it. I think it's a winner.", 
    "Uglier than I could have imagined. And notice you cannot return it.", 
    "won't hold books, cheaply made. It tilts from the weight of books. It may be half the price of other models but not worth it."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Spine-Book-Tower/2682148/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=14", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/2682148/Spine-Book-Tower-fc5bb4c2-8546-485f-a230-c88b11c1d07d_600.jpg"
  ], 
  "description": "Complement your home and create a focal point in the room with this\nuniquely designed spine book tower. Made from sheet metal, this\ndurable tower features a modern silver tone finish. Place the tower\nin the entrance way, living room, den, bathroom or any other space\nwhere a decorative accent is needed.Accent your home decor with this contemporary book towerCreate an artistic focal point in your living areaThe space-saving design adds functionality and makes\n  organizing easyThis book tower features a foot rest that is accessible from\n  all anglesThis sturdy tower holds books, DVDs, CDs and other decorative\n  itemsModel OS5980One bookshelfConstructed from sheet metalFinished with powder-coated silverMeasures 55.25\"H x 16\"W x 14\"DAssembly requiredStyleContemporaryMaterialMetal, PineFinishPine FinishShelf TypeBookshelvesAssemblyAssembly RequiredColorSilverFurniture Frame MaterialMetalNumber of ShelfMore than 9"
}