{
  "name": "Studio_Dove_Finish_Coffee_Table", 
  "price": "EUR 194.92", 
  "reviews": [
    "I am overall very happy with my purchase. The real wood is fantastic quality, especially for the price, The finish/stain is beautiful and goes really well with the gray/neutral theme of my living room, it's on the \"cooler\" side of the color spectrum which is perfect for me, I think it matches the picture perfectly (purchased via ipad and most Apple screens are color correct). It is a very simple table and took no time to assemble - maybe 30 minutes most?Hope this helps!", 
    "This table comes very well packed, is easy to assemble and is quite sturdy. However, the color is much lighter than it appeared on my screens. Perfect if you're looking for a whitewash look.", 
    "This table is perfect and would be sturdy if the connectors made more sense. The screws go in on an angle and it was really difficult getting a tight screw which means my table jiggles back and forth. If someone sat on my table it would be a wrap.", 
    "I was not happy with this purchase, the table was very light and if you bumped it walking by it would move. The material was cheap looking. Overall, sorry I purchased this table.", 
    "So easy to assemble; and true to color in photo! Great addition to family room.", 
    "I ordered two of these to put next to each other in my large living room. The clean lines and gray wash finish are beautiful. Easy to assemble, took less than 30 mins and as always shipped quickly by Overstock.", 
    "This table is a perfect fit. Simple but stylish, and looks great for the price. Would definitely recommend.", 
    "Sturdy heavy wood. Great color. Nice style to a rustic, minimalistic decor.", 
    "Great table so far! I'm not sure how it will hold up long term but for the price I'm quite pleased. It looks exactly as pictured and is a nice weight. The table also still seems sturdy enough even though I did not use the top 2 corner screws (what a struggle with those)! Other than the corner screws the assembly was simple.", 
    "Great coffee table and goes perfect with our decor!", 
    "Easy to assemble and great looking", 
    "It's exactly as pictured. Not the easiest to assemble and a tad wobbly. Good for the price", 
    "Once we followed the fairly easy instructions to put the coffee table together, we found it to be nice & sturdy & a real compliment to our living room. So we ordered the sofa table.", 
    "Only complaint is that crumbs can get stuck in the little seam around the perimeter. Otherwise, it's sturdy, good looking, and easy to assemble.", 
    "This is a simple but elegant piece of furniture and looks fantastic in my family room.", 
    "I received this table 3 days after ordering. The color matches the picture, and it was fairly simple to put together (took about 30 minutes). It is well-made, and feels solid even though the design is fairly minimalist.", 
    "Love this table- light and modern and looks exactly as it does in the picture. It goes with any color or decor. Easy to set up my 9 year old and husband took about 30 minutes to put it together, and that was because he was teaching as he went long. Would buy it again- LOVE it.", 
    "Looks great and it's nice to know I'm using a responsible, sustainable wood!", 
    "It shipped quickly, very little damage to the carton the parts had no damage. My 22 year old daughter put it together in about 40 minutes, but she is good at that kind of thing. The hardware came with an Allen wrench, but she preferred to use our multi-tipped screwdriver. It is a solid piece of furniture. I am shocked at how nice and solid it is.The color is grey and it looks like it has a coat of light stain over the paint. I also bought the matching sofa table that I will assemble this weekend. I am giving the coffee table 4 stars because I want to see it it stands up over time. I do not regret this purchase. We really like it.", 
    "This is a great table for a great price! The color is exactly as it appears online and was in good condition.", 
    "I am pleased with the overall look and style of the table. It looks like it should for the price. It meshes well with my other distressed furniture. I found the assembly instructions to be a little odd but otherwise I am happy with the purchase.", 
    "Not bad for a table you have to put together, matches well with the sofa table/console that we also purchased in the dove wood.", 
    "I was looking for a coffee table that was inexpensive, but didn't look it. I found it!", 
    "I do really love this table. the colors are perfect and the size as well. The only negative is that its VERY wobbly and not sturdy at all. I only put a few things on it so it serve its purpose.", 
    "I am in love with this table. It is definitely a true gray over light brown finish (has a beachy-weathered /acid washed look) and it's just gorgeous and very modern. The table is lightweight for its size so it's easy to move around. It was a snap to put together (I did it with a screwdriver as my husband was not home to locate a drill for me). It's just a tad longer than I wanted (in a small living room) but I am definitely keeping it. Put a few iridescent round oil burning lamps on it of various sizes and it just glows! Beautiful and a great value. Thank you!!!!", 
    "Absolutely love this coffee table! It is the perfect everything for what I wanted and it far exceeded my expectations.", 
    "True to color, kind of a nantucket grey. Very happy with color"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Studio-Dove-Finish-Coffee-Table/8066554/product.html?recset=82171105-8922-4d90-8eab-da22b5c63b77&refccid=526HRK235GUJVKSMIADNUQGXWA&recalg=828,512&recidx=17", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/8066554/Studio-Dove-Finish-Coffee-Table-c0d58988-d5e3-4cf3-9882-98ad77e6a379_600.jpg"
  ], 
  "description": "Accent your home with this elegant studio coffee table featuring an\nattractive neutral tone dove finish. Made from solid rubberwood and\nveneer, this transitional style table is strong, durable and\nlong-lasting. This rustic coffee table is well suited for an office\nspace, den, family or living room and is easy to assemble.Set includes one coffee tableMade from solid rubberwood and veneerFinished in dove grayMeasures 17\"H x 47\"W x 22\"DAssembly requiredStyleRustic, TransitionalMaterialRubberwoodTypeCoffee TablesFinishGrey FinishShapeRectangleAssemblyAssembly RequiredColorGrey"
}