{
  "name": "TRIBECCA_HOME_Myra_Vintage_Industrial_Modern_Rustic_Storage_Desk", 
  "price": "EUR 356.28", 
  "reviews": [
    "I was very nervous buying this desk as I hate buying things without seeing and feeling them in person first. I had a different desk from Pottery Barn and although it was nice, it was too big for my space and I thought it looked too masculine for what I was trying to achieve. This desk has the rustic artisan appeal, but is not too much wood, which I felt gave it a bit of a feminine flair. It goes nicely with my leather and metal desk chair that I found at Homegoods, my natural jute rug underneath it, and my hollowed tree stump garbage pail. It's the perfect size and I love the shelves for extra storage. I also love that it doesn't have a drawer for a keyboard because it would just collect junk anyway. I was so impressed when I opened the box, seeing that the wood is heavy and weathered, I was so excited to put it together, I didn't wait for my husband to come help me. It was easy to assemble, I did it myself in about a half hour, and although I'm usually pretty good with figuring things out, I'm certainly no Handy Manny. It really makes the look of the space! If you like the rustic/artisan look, but are concerned about quality, style, and/or durability, go for it! I don't think you'll find anything this great at a better price.", 
    "This is a nice piece overall~ It's very easy to set up, spacious, and looks very stylish; rustic but modern. If you want to add some comtemporary rustic feeling into your home office/bedroom, I think this desk would be the Right choice. It won't go wrong. Some helpful tips: 1. the color of the wood actually is darker than the pic shows: What I mean here is the wood has redish brown tone in it. It's Not \"Light brown\" or \"Tan\" in the 1st pic! So If you'd like any light brown, greyish desk there, be aware of it ahead ! 2. The top surface kinda feels somehow \"Rough\". It has natual wooden lines in it. I understand that is how these rustic tables have been designed, so I don't really mind it. BUT for some ppl who like desks with very smooth surface, it MIGHT not the choice for you guys. I like this item a lot, and hopefully my shopping experience will be a useful guide for those who are considering this piece~", 
    "I typically don't buy furniture without seeing it first, but took a chance on this piece. I was thrilled when it arrived. It is everything I hoped and was less expensive than some comparable pieces I was looking at from some of the big named retail furniture stores which charge for delivery or shipping. You will not be disappointed with this piece!", 
    "My husband says it was easy to put together. I love the look - very industrial artsy looking. And the open shelves are great for displaying small baskets or pottery. The desk is quite large, but not oversized. The wood is all fairly smooth and even with only one small flaw detected that is barely noticeable. Solid, great looking piece of furniture that looks great in my living room which I have converted to more of an office area with interesting chairs and artwork.", 
    "I was nervous about buying this desk without first seeing it in person but have no regrets! The desk was delivered promptly and without issues--it included all of its parts and arrives undamaged. It was relatively easy to put together, although the holes of the desk frame and the shelves did not quite line up and I needed the assistance of my roommate when screwing in the shelves--essentially she had to push the frame in while I pulled the wood shelves out and only then did the holes align. Now that the desk is all set up I am very pleased. The quality is excellent. As some other reviewers mentioned the top of the desk is rough--it does not catch on fabric but it does have ridges--I anticipate needing to use a writing pad and mouse pad with this desk. It may be worth mentioning that the desk is also very high--I raised my desk chair and arm rests as high as they will go and they still do not reach over the desktop, but align with it. This would not be an issue for most but I have carpal tunnel and need to have specific posture and wrist placement when typing and this may be an issue that I have to solve personally and that others with similar issues may want to consider either when purchasing the desk itself or a chair to go with it.Ultimately, it is very stylish and of great quality for the price.", 
    "I am missing several key parts of this desk. I have no small shelves for the side towers and and I do not have all the washers and bolts. Big disappointment in service and this is desk was not inexpensive to buy.", 
    "Very nice desk. Came shipped via UPS at 88lbs in a flat box. Assembly took about an hour and only required an hex key (included). The wood is darker than appears on the photo and I was pleased about that as it makes a nice compliment to the room, Overall exactly what I was looking for.", 
    "I've been shopping for a desk for 6+months. It is the perfect size for my large mac monitor, with room to spare for when I'm not on the computer, but not too big that it dominates the room. There is wonderful storage space underneath and you can use it as storage of decoratively. I LOVE THIS DESK.", 
    "Bought this to use as a craft desk and I'm very pleased with it. It is not a smooth finish but I use a craft mat anyway, so this is not an issue for me. Holds a 12\" trimmer, lamp, a 2-tier shelf on top for tools and inkpads, and there is still plenty of working space. The combo of the wood and metal (matte black) is very nice and the breadboard edges add a nice finish. The shelves are deep enough to hold a Big Shot die cutting machine with more room to hold the dies/basket/whatever. Was able to assemble by self. All pieces lined up correctly.There are only 2 cons for me:1. Price - which is a bit higher than I would have liked (The Target madison trestle table is $*** but a bit smaller) but this is does not appear to be an mdf desk2. The feet have only a stick on rubber pads (like furniture felt but cheaper) and if you have to move the desk, they roll off so only the hollow leg is touching my floor. That is very annoying and I'm concerned that it will affect my floor. I'm going to explore getting casters and put this desk on rollers.", 
    "Beautiful wood--not smooth to write on. Sturdy. Good looking. Simple.", 
    "Bought this table for the extra bedroom for crafts, sewing and homework but I might just need to bring into my office because it is great.Just enough contemporary rustic to match our eclectic home. Heavy, sturdy and a snap to put together - took my 15 year old daughter and I 20 minutes to put together. I had to empty the box of all the pieces on the porch - too heavy to carry upstairs in the box - but that is not a complaint - we love the table!", 
    "Such a nice desk. Easy to assemble and looks very contemporary and stylish. I was worried about the desk surface being too rough because another review mentioned this, but was pleasantly surprised to discover that it has just the perfect amount of \"rustic-ness\". It's not so rough that you can't write on it (though I do use a desk pad anyway), but not so smooth that it just looks like some bog-standard MDF desk. Basically, I love it!", 
    "My two sons put the desk together quickly and easily. There were two not so perfect details. The finish on the desk top was most likely damaged in shipping which I chose to repair with furniture repair pens. Also, one of the shelfs was rather splintered on one edge. This was disappointing but because the desk is sitting against a wall, this isnt noticeable. All in all, its a great looking desk. I really like the size of this top. There is plenty of room for a desk lamp, computer and still room to spread out to work. The open shelvingnew is perfect for books or baskets. You will love the vintage yet industrial vibe of this desk.", 
    "I think that title says it all. Desk was perfect. Bookshelf wood was very crooked and noticeable on the top shelf- literally more than an inch in thickness different from one side to the other.", 
    "Meets my needs. Large, sturdy, and good looking.", 
    "Easy to put together and looks very nice.", 
    "i'm not sure what other reviews were talkilng about as this piece seems to be real, actual wood and is very easy to assemble and is very strong and sturdy when built. It is very attractive and can be viewed as rustic or industrial. It is perfect for our in-home office space.", 
    "I really like this desk. It's strong, rustic and goes well worth my current decor.", 
    "The wood on the desk is not smooth it is rough enough to get splinters and has a definite varnish/gas odor. I am hoping that it disipates with time. Hope it isnt toxic. I purchased a piece plexiglas to cover the desk surface. The design is appealing and functional. But materials and workmanship are definitely lacking. If i had seen this in person I would not have purchased it.", 
    "Desk looks great, as pictured. It's straightforward to put together. Although it is made of wood planks, it's finished with a faux-veneer. And whatever they use to adhere it has an awful chemical smell. We tried to air it out by closing it in a room with windows open for days. It doesn't help, the office now stinks and gives a headache upon entering. Some of the shelves were warped included the desktop! It dipped right where one would sit. Lastly, properly assembled, all washers/hardware tightened, the desk wobbles. Not a wobble as if it were on an uneven surface. It wobbles due to the cheap metal and design. The desk slightly wiggles as you type/write. Which also wobbles the display. Final thought: Looks nice but is of dubious quality.", 
    "I'm normally hesitant to order furniture online, but the reviews were so great, I took a chance. It really paid off. We bought 2 for our home office and while I might have preferred having drawers, the open shelves keep the small room feeling spacious. We got boxes at Ikea to go on the shelves to store paper, pens, office supplies and it looks great. We'd be hard pressed to find 1 desk for the price of 2 of these. The color of the top leans towards pecan, with a little red in it.", 
    "Easy to assemble, looks great and really sturdy", 
    "I have looked for a desk for a while. I was pleased with how quickly it arrived and the condition of packaging. Very easy to assemble. Nice quality product - especially for the price point. The top and shelves are real wood which is very nice. Only downside - I was shorted 4 washers in the hardware packet. Was able to find a replacement that worked (even though they weren't the right color.)", 
    "Love this desk! I also got the matching shelves too. It's very beautiful & sturdy. The only \"negative\" if you want to call it that is that the wood is actually darker than it appears online. Not a huge deal, but it doesn't match the other pieces I already had in my office that I was trying to match. All in all, I love it.Kudos to Overstock, as the desk got damaged in transit and had an indent & small knick in the front of the wood top. I callled them & they offered a small refund without any problem. They would have replaced it, but the desk was out of stock.", 
    "It's a terrific desk. Very solid. Easy to set up. The color I would say is a bit darker in person due to the dark brown tones mixed in. The top is like handscraped hardwood, so not smooth like butter but bumpy..not rough, so you would need a writing pad if that is an issue for you. My husband and I are using it so that we sit opposite each other at the middle. It's big enough so that we can each have books in front of us while facing each other, and there is enough leg space for both of us. I'm 5'4, he's 5'10. The desk is also long enough that we keep a computer monitor at one corner in addition with a wireless mouse and keyboard. The style reminds me of stores like pottery barn and restoration hardware, but I can bet you won't find such a great price.", 
    "great desk! it is super sturdy. perfect size, easy to set up and great look!love it, if you're looking for a solid desk with an industrial flare..get it :)", 
    "Beautiful desk, great quality and easy to assemble. This desk has a reclaimed wood texture to it. It is sturdy and substantial. Dimensions are as described.", 
    "My desk arrived within three days of my order to Overstock. I am amazingly pleased with the quality and style of this beautiful desk. It brings a quality to my Office that I'm looking for industrial, modern and stylish. I will be ordering the bookcase and the television stand to finish the look. I will continue to shop at Overstock this is my favorite on line shopping venue.", 
    "assembly was real easy, overall I am happy with the product. it squeaks a little bit if you shake it, but I'm guessing it's nothing a little wd40 couldn't take care of. it has that classic wood desk modern look.", 
    "nothing fancy but sturdy and really stylish. Super easy to put together. We bought all coordinating pieces and are very happy. Can't beat the price!", 
    "classy looking and very sturdy.", 
    "Pros: Easy to assemble, and quick delivery. Cons: Desktop is a pressed wood product, and had some damage on edges. Legs are uneven, so several legs do not touch ground.", 
    "I was looking for a solid wood desk with plenty of work space and open shelves as I have a smaller room and I didn't want anything that looked too heavy. This desk fits the bill. It's well made and the rustic finish of the wood adds character.", 
    "This is one of the best purchases we have made. Looks like a desk we saw elsewhere costing over $1000. Love it so much we bought the matching TV stand to use as a console table next to it. It definitely adds charm and style to the room!", 
    "This desk is exactly as pictured. It's fairly easy to assemble, looks rugged and lends the perfect industrial look to any space. It looks fabulous with the matching book shelves.", 
    "Bought this desk for use in my home office. I use a cutting mat, so I'm not working directly on the surface. Like others have stated, the desktop does have an uneven (rustic) surface, so depending on how you use the desk, you might find getting some sort of protective top to your benefit.It was super easy to assemble, and the use of metal and wood is a great way to introduce texture into your decor. There was a bit of an odor with the desk for the first 4 days or so. The same scent as you would have from any stained and sealed wooden furniture. I didn't mind it, but if you are sensitive to that sort of thing, it is worth mentioning.I ordered it in the brown, and love that it brings a different shade to my room. My floors are a dark wood, and the metal of the desk is darker, so I enjoy the contrast. The shelves are nice, and the open design keeps the desk from feeling too heavy in the space. Delivered on time and in perfect shape. Would definitely recommend.", 
    "Nice looking distressed wood and solid wrought iron legs! Does not look cheap. My husband uses it for his computer and printer...he loves it!", 
    "Feels very substantial, looks great in person!", 
    "beautiful. heavy duty. looks more expensive that it is.", 
    "This desk is awesome! The brown wood is pretty darn true to the color shown online, maybe just a tad darker. But it's gorgeous. Assembly is was one of the easiest and straight-forward assemblies ever. Took maybe 30 minutes. The shelves on each side provide more than enough storage (we've used baskets). Definitely a good buy - we're very happy with it.", 
    "I remodeled my office and bought this desk along with the matching bookshelves. It looks great. The desk is so heavy and made of solid wood, Easy to put together. Great price and amazing customer service. Plenty of room between the shelves for a basket or bin to hold stuff. Very comfortable.", 
    "I love this desk. Solid construction and easy to assemble. Highly recommend.", 
    "Product exceeded my expections. High end look at a affordable price", 
    "Relatively easy to assemble. Looks great in my home office. Plenty of surface space to work on and forces me to keep my stored items nice and neat!", 
    "This desk is wonderfully sturdy and a fantastic size to spread out my work. I love the shelves. The wooden top is warm and goes well with the antique and cherry furniture I have in the same room. The packaging, though, bothered me. SO MUCH STYROFOAM that couldn't be recycled. Time for more environmentally conscious materials, please!", 
    "Bought this for husbands home office. Looks very good, also bought matching tv stand to use for a book case. Easy to assemble delivery was good.", 
    "Love this desk, it looks great in my living room! This desk is incredibly sturdy and very easy to assemble!", 
    "My first online furniture purchase, but had looked enough to know this would be a good purchase. Solid poplar, very heavy. And very easy to put together.", 
    "this was my first purchase ever from overetock.com ... I was surprised that this desk is so nice. It smelled a bit like oil for a week or two but eventually went away. Setup was pretty easy but required a lot of using an allen wrench to fasten 24 bolts tightly. bI recommend this if you like the way it looks, you womt be disassistfied with its quality, sturdiness, and weight.", 
    "This desk is amazing. Very sturdy and stylish. It is quite large, so make sure you pay attention to the dimensions so you have enough room for it. My fiancé put it together by himself, and did not have any issues. It did have a strange smell when it first came out of the box, but the smell went away after about a week.", 
    "Easy to put together and looks great!", 
    "Love the warmth of the wood mixed with the metal. It is a sturdy, well made piece. I use two screens for work (my laptop plus another screen) and still have room for office supplies on the top. Very happy with my purchase.", 
    "This desk couldn't have been easier to put together. My girlfriend and I finished it in roughly 30 minutes. The desk had a odd paint like smell for the first couple days but has since faded away. The desk looks very nice and the build is great!", 
    "This desk is solid wood and is truly beautiful. Exceeded my expectations for the price.", 
    "The Tribecca series of office furniture is substantial, attractive, and easy to put together. Would recommend it", 
    "I was overwhelmed with the large and heavy box. I was so glad it was delivered to my door. Once I started putting it together, I realized how easy it is and I love how it turned out. I like having a lot of space for my desk and this is perfect.", 
    "I couldn't be any more thrilled with my purchase of the Tribecca Home Myra Vintage Industrial Modern Rustic Storage Desk. The desk is beautiful and useful, providing just the right feel in our second-floor guest bedroom, which when we are not having guests I enjoy as a room to do creative writing, reading and relaxing, and crafts. More than a traditional style desk, I wanted a functional and fabulous writing table - a surface large enough for journaling, letter writing, a laptop computer, lamp, jigsaw puzzles, knitting projects, and coloring. I found all of these qualities in this desk. The storage/display shelves are an added bonus - providing space for drawing and coloring pencils, puzzles and games, coloring books, knitting wool and more. The desk top is solid wood with a pleasant and appealing stressed look. The legs are a sturdy metal. And the whole thing took only 15-20 minutes to assemble. It was delivered on time and the easy assembly also means the piece is lighter to carry (in sections - top, legs, shelves) to any room in the house. An excellent value on this substantial piece. Very happy with this first purchase from Overstock.com.", 
    "nice desk. big. easy to put together. outgasses for a few days.", 
    "This is a really nice piece. Super quality wood top and shelves. Easy to put together. Looks great and plenty of shelf space for large storage baskets.", 
    "Warm and beautiful desk. Looked at other options in the 1000's and this was the same quality!", 
    "This is a very handsome desk at a great price. Others mentioned the desk top not being smooth, but the one we got is. It is a little darker than it appears in the photo, which is even better. It was very easy to put together and is a great addition. Overstock had the best price on this desk, as I found it on two other sites on sale at the time of our purchase. It also was delivered when expected.", 
    "I find it hard to believe some of these reviews. This is the second time I've purchased something from the site and not been happy. I read nearly all of the reviews on this desk because of my first experience and it still wasn't what I expected. My main issue was the wood was a glossy painted gray and had this unnatural looking design which made it look very manufactured none of which was represented in the photos.", 
    "It is definitely a great desk. Not an RH but WAY less money. Uneven top but you could buy a glass cover if you wanted. Looks expensive but it is not. For $300 on sale, it was a great deal", 
    "Perfect large desk. Looks great. Sturdy. Nice rustic wood finish.", 
    "This desk is a great purchase. It is simple, sturdy & has a nice look to it. Perfect for a simple computer desk.", 
    "I absolutely love the desk! The only think I didn't see mentioned is that the top is not smooth. It's uneven planks of wood therefore you cannot use you computer mouse on it or wrote on it. I have a writing pad I placed on it in front of me and problem solved.", 
    "I love my desk. The top came dinged from damage during transit, but Overstock gave me the option to return it, get a partial refund, or get store credit. I went with the store credit. I still love it. It's a nice piece of furniture. I got some baskets for the shelves to use like drawers. I love that it's a sizable, significant desk that gives me plenty of room to work.", 
    "Great desk. I work from home full time and this desk provides great storage. The only complaint is the wood is not smooth on the top so if writing anything you have to place a pad under your paper. Small issue though :)", 
    "I love the rustic details. Easy to put together. Good quality", 
    "Solid table that was extremely well packaged and easy to assemble. Have had it for several months in a teenage boy's bedroom, and it still looks terrific. Very solid desk that should last for years.", 
    "Heavy! But beautiful and a great addition to our home. Easy to assemble.", 
    "using it in my home office and can't ask for more. looks great, sturdy and just gives character to the room.", 
    "So many desks options are made with fake wood or presswood that will break down and look cheap. This is not the case here. Sturdy construction and a professional feel and look. I plan to have this for years to come.", 
    "Easy to assemble and looks great!", 
    "This desk just arrived the other day. I got it in the brown color and when we opened the box I was pleasantly surprised at how nice the wood looks and the color - very natural and much higher quality and \"refined\" looking than I expected. I had almost purchased a 1200 desk from a well known retailer and decided to first check Overstock and when I saw this one I figured - what the heck - save some cash and see how it works out. This desk has exceeded my expectations in terms of color, quality, sturdiness, functionality and overall style. I would HIGHLY recommend this desk and I am extremely pleased with this purchase.", 
    "Love this desk. so easy to put together, and beautifully made. the wood is thick and heavy, but the desk comes together so easily.", 
    "Beautiful and sturdy table! Assembling was easy. Excited to use it.", 
    "Love everything about this desk: the size, look, open feel. One of my favorite purchases!", 
    "Sturdy, stylish and good amount of surface area on which to work. I love the side shelves that accommodate storage basket. I use it as an art table and I can have my necessary supplies close at hand. My first delivery came damage but the wonderful customer service replaced it without a hitch.", 
    "The desk came well packaged. Easy to put together. Great desk for money spent.", 
    "Simplicity in Assembly and appearance. Sturdy. Bought 2 and set back to back for home office. LOVE IT!", 
    "Happy with the purcahse. Great addition to my room", 
    "Zero complaints. This desk is everything I wished for!", 
    "We have 6 kids and have been looking for the perfect desk that will hold up to a crowd. This desk is sturdy, easy to assemble (mom did it alone). It looks very smart and complimentary in our open floor plan home. Our office is one of the first things you see when you walk in the front door. We get ALOT of compliments on our new office. I am absolutely thrilled with this desk and bookshelf choice! The only negative is the packing material and getting our waste management to pick up the styrofoam.", 
    "I bought this for my junior in highschool for homework area and to take to college....perfect", 
    "The Tribecca Home Mrya Vintage desk was a great choice for our home office. Although a little challenging to put together, its is a solid desk with plenty of space to spread out if needed. It is also an attractive, understated piece of furniture. I'm happy with the purchase for what it is and what we paid for it.", 
    "Couldn't ask for a better desk. I enjoy the look of the distressed oak. Very sturdy and heavy. The work space is deeper than most desks I've had which is a huge plus. The open back gives the desk a great modern appeal. For all your wires nothing a couple wire ties can't fix. Great purchase.", 
    "Desk was easy to put together. It has great lines and looks elegant. It does not clutter the space. The open shelves make it easy to reach and store items.", 
    "Easy to assemble. Quality shelves. Looks great. I ordered the side table too for the printer and file storage. Very happy. Worth the price. Got desk next day.", 
    "I have had this for 1 year now and am still in love with it.", 
    "Beautiful piece. Bigger than it look in the picture.", 
    "Desk is great and functional. Only took about 20 - 30 minutes to put together. Would be easiest with two sets of hands. Looks like reclaimed wood which I really like.", 
    "This was made well and is very nice.", 
    "I was disappointed in the quality.", 
    "The finish is a bit darker than pictured which makes it perfect. My guy who assembled said \"this is real wood\" and the assembly was very easy. I divided a long livng room with a loveseat facing the TV and the desk behind the loveseat; it is a perfect and stylish arrangement for working.", 
    "This is a nice desk that looks more expensive than it is and gives a slight industrial feel. I'm only knocking off a star because it came slightly damaged with a two-inch gauge right on the top (not big enough of deal to send it back though, we just cover it with a book or something!). It required two people to put it together - one of us had to \"squeeze\" the pieces into alignment quite a bit while the other one tightened the screws. We were almost afraid it wouldn't come together, but it did.", 
    "looks great exactly as wanted", 
    "The wood portion of the desk is excellent, has a vintage look to it. It's very heavy and has a nice color to it. The legs are made of metal and are hollow inside and do the job well supporting the desk. Very happy with this purchase.", 
    "Sturdy, good quality and easy to assemble. Lots of storage space. I love the industrial modern look. If you like this style...you won't be disappointed. Highly recommend.", 
    "I saw a version of this desk at a much higher price point on another site. The upscale version is made of oak. I am more than happy with my choice. The desk was relatively easy to put together. It required a little thought to attach the shelves while the desk was upside down, but well worth it. Perfect for the area where it sits and because of the open shelving is inspiring new ideas about storage. I like it.", 
    "The desk is wonderful and sturdy.", 
    "Perfect desk for a casual user.", 
    "Desk is a great size. I love the look, I wish it were made of real wood however. Desk is a bit flimsy putting together, however, once assembled, it is very sturdy.", 
    "Once I opened the box I recognized that desk won't fit my small room outlook. The top of the desk has really rustic finish and look a little darker then pictured. I did not assemble it and had to send it back.", 
    "This desk took a while to arrive after a mix-up at the warehouse, but it finally arrived well packed, in good condition and with all the hardware. It's heavy so it's best to assemble it upside down with the desk top on the floor. I put it together myself in about 20 mins. and just needed help turning it over because it's heavy. One hole didn't line up between the top and one of the legs so I left out that one bold, but the desk is sturdy and stable enough without it. The top looks rustic but smooth enough not to snag things. I'm using baskets on the shelves to hold office supplies. It's a good size and could be used against a wall or free floating in the room because all sides are finished. My only criticism would be that when I first unpacked it, the wood smelled strongly chemical, possibly from the stain. To avoid that smell permeating the house, I put the desk together on my open porch and let it sit outside for a day. After that the smell had dissipated and hasn't been an issue. I like the look of the desk with my contemporary furniture and have received several compliments on it.", 
    "This desk is great. Like other reviewers said, it is a little rough on the top, but that just adds to the charm. Assembly was easy. The desk seems really sturdy and everyone who sees it, loves it.", 
    "We bought two of these plus the bookshelves. When it arrived (promptly in 4 days) my husband looked at the boxes and said 'if this takes more tools than we own to put together we are sending it back. In fact it took two of us less than one hour to assemble both desks and the bookshelves. All it took was the one small ikea looking tool that was included in the packaging. Very nice heavy wood peices that look great in our house.", 
    "I bought this as I'm now working from home full-time. The desk is plenty big - enough for a monitor, laptop/docking station, keyboard and extra space for a lamp, papers, etc. It's well made, sturdy, and the finish looks beautiful. I was hesitant about buying furniture online, but this is better than anything I found in stores. So happy with this!", 
    "Love my desk, it looks amazing. Its super strong. My favorite piece of furniture for sure.", 
    "I have gotten so many compliments on this desk! It's has a beautiful mix of rustic elegance and definitely looks more expensive than what I paid for it. My husband and I converted our living room into an office and I didn't want the first room people see when they walk into the house to look too \"office-like.\" But it's tough because desks can be so expensive. We painted the walls a deep blue and centered this desk under a cool chandelier (also bought on overstock!) with a cream chair. We also added two wing chairs to create a seating area. We LOVE the room!", 
    "This desk is well made and very easy to assemble. It is very heavy and does have a chemical like odor that slowly is going away. For the price, I think it was a good value. It was difficult finding a desk that had this modern industrial look priced like this. The only downside is that given it doesn't have drawers I had to get baskets for storage.", 
    "Very pleased with this desk. Arrived very well packaged. I was able to uncrate and put together by myself. Took me a little over an hour. I found the trick was not to completely tighten down the screws until all the various pieces were in place. Certainly looks more expensive than it was. As others have said, has a Pottery Barn or Restoration Hardware look w/o the price. I live in a small cottage near the water and this looks rustic and charming at the same time while not overbearing.Large enough to hold a big, heavy lamp and all the office accessories.I paired it with a rattan chair, popped in a couple of seagrass baskets and also had room for a good size potted plant on top. My home office looks fabulous if I do say so myself! Highly recommend.", 
    "This is a great desk, great quality and very sturdy. It looks perfect in my home office.", 
    "I've had several disappointments on this site, and expressed them in reviews, but this wasn't one of them. I've read the comments of other reviewers and didn't have some of the \"issues\" claimed by a few of them. The colors depicted in the accompanying photographs were fairly accurate in my case. My unit didn't arrive with a strange smell and I found it very easy to assemble (the instructions were missing though, but I muddled through it with few issues). I was also able to assemble the thing alone (a second person would be helpful but not necessary). Someone also indicated she thought the desk was high and she might be very well be correct in this; however, I carefully looked over the specifications before purchase and compared them to other desks. I'm over six feet tall and wanted a tall desk and it works perfectly. The mouse pad is indeed a little too high if placed on the desktop, but I bought an under desk mouse platform which remedied this issue. The unit is stable, the shelves affix themselves securely to the main unit, and the metal legs are solid and finished in such a way that I don't think they'll scratch or age badly. I wasn't a big fan of the cheap rubber pads you attached to the bottom of the legs, but their substitutes can easily be found at a hardware store or online. Overall, I think it's a piece that will last quite a few years.", 
    "I bought the book shelf, desk, and end table. Super easy to put together. Sturdy. Looks great. Love it!", 
    "Arrived a little damaged on one corner (which I can hide against back wall), but other than that the style and construction is solid, perfect for my artsy home office in my Victorian. After looking at hundreds (literally) of desks to complete my office in my dream home, I'm glad I chose this one. No problem to assemble. Highly recommend.", 
    "Exactly as described, easy to assemble, delivered promptly. As others have noted, wood a bit darker - almost the exact color of a pecan, quite pretty. Only complaint is generic... that awful smell of varnish the first day or two out of the box.", 
    "Love this desk. Easy to assemble. Perfect size. Looks fantastic.", 
    "This table isn't complicated to put together. It has solid material and much more leg room.Recommend it!", 
    "The desk looks very good and feels sturdy.The holes in my side shelves do not align properly with the supports. One of my side shelves was also gashed.", 
    "Very easy to put together and a very authentic look for a fraction of what it would cost from traditional retailers.", 
    "We were bit apprehensive about ordering something without seeing it in person. But my in-laws purchased some furniture thru Overstock and we're very satisfied, so we thought hek why not try it. We received it on time. It's beautiful and it was so easy to assemble, my husband is so happy about that.", 
    "This grouping is a very sturdy set. It looks polished and rustic at the same time. Larger than I thought it would be so my husband is thrilled. Highly recommend the whole set.", 
    "This is what I was Looking for all along", 
    "Very impressed...arrived in great packaging, with all the parts in perfect condition.assembly is easily performed by one person.....you will need another person to help turn the desk over onto the legs after assembly is complete.This desk is solid, looks great...convinced me to order the end table to use as my printer table", 
    "I purchased this table along with the bookshelf. Not only do I love my study room set but I also got a lot of compliments from friends and family members who've been to our home.", 
    "Beautiful and easy to assemble on my own. Heavy and substantial piece.", 
    "I wanted to buy new office furniture for my home office and all I could find was put it together yourself MDF. I ordered this piece and the matching desk. Both arrived quickly, each in one large box. I put them together myself which really just entails building the metal frame and laying down the wood board. There was a slight smell but it went away after a few weeks. I'm not sure what type of wood but it beats mdf with a paper or vinyl coating for sure.", 
    "Beautiful desk, I have several other pieces(bookshelves) of this product.Love them all!!!", 
    "very easy to assemble, looks much more expensive than it really is. very satisfied with purchase.", 
    "I purchased two of these and placed them side by side...taking up entire wall in family room (my office). I needed a great deal of space due to multiple computers, laptops, phones, printer, etc. I also needed room to write. However, I didn't want an eye sore. This was perfect and lovely.", 
    "This looks fabulous in my room. Even though the wood shelves and top are veneered and not solid, you wouldn't be able to tell except for that the veeneer on one my shelves has all bubbled up and lifted loose as if it had gotten wet, but it never has. The humidity in my house is even rediculously low, so I have no idea why this happened. I'm disguising it with a stack of magazines. Overall, the desk does give me an awesome look for a fairly low price and if I had it to do over, I would probably still choose to buy it again knowing what I know.", 
    "While redoing my \"woman cave\" could not determine what I wanted saw this desk with its open shelves for easy access and thought it would fit the open concept I had. The shelves do provide easy access to my baskets that hold my crafting supplies. The mix of reclaimed/vintage wood and the black metal gives it the room and the desk an modern yet vitage look. I've gone ahead and purchased the TV stand as well as the tall narrow book case.", 
    "Perfect for what I needed at a great price. Looks very high end!", 
    "The desk looks authentically rustic and is very sturdy. It offers a lot of desk space to handle computer, monitor and keyboard. This is exactly what I was looking for. You can't get these types of pieces from your typical office store chains, which sell low-quality particle board items.", 
    "I have never ordered furniture online. I a very pleased with the desk. Sturdy unlike some of the wood furniture today.", 
    "I love my new desk. It was pretty easy to put together although some washers were missing. I love the look and open feel. Solid quality.", 
    "I have been using this desk for several months and it is a beautiful and functional addition to my home. Most people comment on how nice it looks in my home office area.", 
    "Nice solid wood with distressed look. Took absolutely no time to put together. Would highly recommend!", 
    "Happy with the desk. My 17 year old grandson put ittogether in little over an hour. The desk is a mellow brown, sturdy and adds a good look to my home office.One little dent in the top, but it is rustic after all.", 
    "Very well made and easy to put together.", 
    "This desk looks great and is the perfect size for my home office. It only took about an hour to assemble. I love the rustic finish and open sides.", 
    "Desk has perfect simple style I needed. Wanted a desk without front drawer so I could attach a standing keyboard/monitor to it. This worked perfectly. Also - for those wondering, you CAN put the desk together without one of the middle shelves and put your PC tower on the lower shelf, no problem. Wood looks good too.", 
    "I had been looking for something like this for months but everything was well over $500 for this style. I finally found it on sale and ordered immediately. My husband was able to put it together with minimal help from me in about 30 minutes. It would have been faster but the screw holes were off by just enough to be frustrating. We were able to make it work though with a little extra force. The color is a tad darker than the picture. I didn't really notice until I went back and looked at the pictures. I am not really a fan of the texture of the wood, it seems feux-scraped. Maybe it is, I don't know, but it is very \"ripply\". Not terrible, but I couldn't write without putting a note pad under my paper. I won't be using as a writing desk so I am not too concerned with that, however. Also, the screws wouldn't go in all the way. Maybe that is because the holes were slightly misaligned, but you can see them a bit from the front of the desk. (But not noticeable unless you are neurotic like me.) Those two things would be my only complaints.A great desk if you are looking for something that is sturdy at a decent budget price. I plan on getting a shelving unit to match.", 
    "This is so cool. A great piece that doesn't take a lot of space visually. We've had a lot of compliments. The customer rep helped pick this out online to coordinate with another piece we purchased, which we also love.", 
    "Great desk. We wanted a modern/rustic desk for our sunroom now that our daughter is doing school work so she isn't tucked away in an \"office\" room. This desk is beautiful. The shelves are a great size. The desk is big so it fits our **** plus there is plenty of room for school work. It is a great piece of furniture and well built. Great addition to the house.", 
    "very nice desk with open shelves and 'textured' wood surface. I like that there's no drawer as I like lots of space to cross my legs.", 
    "Very nice desk. Well made. Easy to put together. Looks great!", 
    "The desk was very rustic in it's style and went well in my country home. Was super easy to assemble.( I did it with out my husband's help)", 
    "Great desk! Love the look and function! Only challenge was putting it together. 2 holes were not exactly aligned, so I could not screw those in! Luckily they weren't main structural parts :)", 
    "I really love the look of this desk with its rustic tabletop and more industrial legs. I wanted something with wood boards or planks, and the tabletop has just that. I also liked the size of the table, since I need space for books to be open for reference while I'm writing on my computer. So many desks sold here are smaller. It was easy to assemble. I did it on my own in about 45 minutes to an hour. I am pleased with this desk would highly recommend it if this is your style.", 
    "I am using this for some of my lighter woodcarving/painting. It is an excellent work space and it looks beautiful.", 
    "Easy to assemble in just a few minutes. Hubs thought it would be too modern for him but it's modern/rustic and he really likes it very much. Perfect size, shelving is great for storage bins or baskets. Very happy I chose this over one of the others similar on the site.", 
    "We anticipated a difficult assembly...but it was so easy. I think we were done in 30 minutes without any problems. We love it!!", 
    "This desk is just the ticket if you're looking for something in a small home office. Assembly took just under an hour (one screw missing) with easy instructions. It looks great in my home office. I love the style, the finish on the wood and the shelving. Price wasn't bad either. A similar desk at ******** ***** sells for double. Thank you Overstock.", 
    "My biggest problem with ordering furniture through online website is the shipping experience. The product is no doubt traveling long distances and mishandled by the carrier on a regular basis. I feel its the responsibility of Overstock to ensure the product is packaged in a way that it doesn't get damaged in any way before it's received by the purchaser. The desk had two shelves with corners chipped!! We didn't return because of the shipping hassle and we thought what prevents this from happening again! We are happy with the quality of the product but not satisfied with Overstock in general.", 
    "This desk is solid, sturdy & looks great. I was able to assemble it by myself with no problem. The top is very heavy & good quality. The desk looks more expensive than it is. Be warned the box is very heavy. If you are considering this desk, you won't be disappointed.", 
    "Comparable to high end store furniture. Must be assembled, but quick and easy. Very sturdy and fits with the latest style. You won't be disappointed.", 
    "Extremely easy and fast assembly. Very sturdy yet not too heavy to move. I love this desk!", 
    "I love this desk. I much prefer the shelves it has instead of drawers. It took me maybe 30 minutes to assemble it! It is just what I needed. I look forward to purchasing a matching bookcase to match it.", 
    "My disappointment wasn't that all of the parts were not included. We were short two washers. My complaint is that there is not a photo view of the wood on the top of the desk, which is beyond \"distressed\". It is rough and snags clothes - similar to a picnic table. The desk looks okay from a distance, but because of the \"rough saw\" texture, it looks like fake wood. I didn't see a review that mentioned the rough and uneven texture, but if you don't mind having a desk that is not at all smooth, then it will be okay. I am sad that the photo was not true to what the wood is really like. Bummer. I guess that's why I don't buy furniture online.", 
    "Top is heavy, interesting distressed wood. Some assembly, but even a novice can handle it. Really has a rich and substantial feel. Have several pieces from Tribeca Home and like them all very much!", 
    "Item received quickly and in perfect condition (box too... if you can believe it!)Was quick and easy to assemble. It took me less than 30 minutes.Longest part of assembly was putting the locking washer and washer onto each of the 28 bolts... the rest went quickly.Finished product looks great in our home office.", 
    "I love this desk! It was really easy to assemble and it looks fantastic! Wish it was a little less expensive but well worth it! Great quality too!", 
    "This is great looking desk for the money. The wood top and shelves are very thick and have a rough finish, and it was easy to put together.", 
    "Absolutely love this desk! The quality is great, especially for such a low price.", 
    "I will buy from this supplier aIn...fast service also", 
    "Not a bad desk at all for the money. A very spacious desk, which I am thoroughly enjoying.", 
    "Love this desk! Easy to put together. Reasonably priced for the quality.", 
    "This desk fit exactly with our casual rustic elegance licit area that we built. I wanted a desk that could blend in with a style matching living room and dining. It is very sturdy and extremely easy to put together.", 
    "Really great desk, wanted something different and looked everywhere! Couldn't beat the price and free shipping! Looks great and was pretty easy to assemble. I ended up getting the console to match for my office. Looks great, casual and unique", 
    "this desk is exactly what it says it is. it is very sturdy and well built. took less than 10 minutes to put together. i love the look and have since bought the tv cabinet and a side table for the same room. love it and could not be happier!", 
    "This desk is perfect. It is extremely sturdy and such a wonderful addition to our office. Looking to purchase the matching bookcase in the near future.", 
    "I had been looking at farm tables at local antique stores and the starting price point was close to ***. I found this table on overstock and after reading the reviews decided to place my order. I loved how it looked on the website but after putting it together it completely surpassed my expectations for style and quality. It is the focal point in my office and as I will be starting grad school in Jan I am looking forward to spending some quality time at this desk!", 
    "I purchased these desks for our small office. Beautiful, sturdy desks, easy to assemble and just the right size!", 
    "This was my first time ordering from Overstock and I was please with the integrity of the customers reviews and speed of delivery. The desk will not disappoint. I loved the price and style. I looked at other desks that cost more but decided I liked the styling of this desk. It's pressed wood but is solid craftsmanship and the finish is very nice. I advise the next purchaser to unpack the desk and let it air out for a couple of days due to the strong chemical smell. It was easy to assemble. My only issue was I think it got damaged during the shipping. I didn't want to return it because it was a small chip on one of the shelves and it was easy to hide. Not a big deal. Love this desk especially for the price!", 
    "The desk is perfect for us. My husband is a collector of \"stuff\" for his ship models and the shelves with baskets will work for his need for \"handy space\". The desk is solid, easy to put together and is interesting to look at. The finish is a rich darker wood tone on the top with all the shelves matching. There is some inconsistency in the end planking on the desk top as it is a different tone which you can see on the picture, but it isn't something that is readily noticed after awhile. The metal is dark black. The quality is what we expected from prior reviews.", 
    "I love this desk! Very easy to put together. Heavy and sturdy. I use baskets in place of drawers for storage. The shelves are large and roomy. Desk top is beautiful and plenty of space for everything. A nice change from the usual home office furniture. I use this every day.", 
    "Missing a piece of tool that make the product as a completed item.", 
    "This desk is not american made. It's garbage. I expected a solid wood desk with a nice finish. unfortunately, that is not the case. this piece is press board with a wood like cover.", 
    "This would have been a great buy had the color not been so different than the image."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Myra-Vintage-Industrial-Modern-Rustic-Storage-Desk/7883916/product.html?recset=414d6021-4630-4d25-a812-7124b342b74f&refccid=MCXUWA2QZEJZD6SBRSQFR5ZV54&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/7883916/TRIBECCA-HOME-Myra-Vintage-Industrial-Modern-Rustic-Storage-Desk-52d11e4a-a887-45b0-b01b-b730c364c5d8_600.jpg"
  ], 
  "description": "Add modern rustic form and organized function to your home or\noffice space with this storage desk by Tribecca Home. Crafted of\nmetal and oak with a weathered black sand finish, this handsome\ndesk provides an ample and spacious workstation for any task. With\na large desktop and four open shelves, this vintage and industrial\npiece can house your computer, printer, books, files and lamps.Materials: Poplar wood, metalFinish: Black sandOption color: Brown, bistre brown, greyType of desk: Home/officeNumber of shelves: Two (2)Inside shelves height: 11 inchesDimensions: 30.25 inches high x 60 inches wide x 28 inches\n  deepMaterialMetal, Oak, WoodFinishWeatheredDesk TypeComputer Desks, Ergonomic Desks, Writing DesksAssemblyAssembly RequiredColorBrown, GreyProduct FeaturesIncludes Hardware"
}