{
  "name": "TRIBECCA_HOME_Dixon_Rustic_Oak_Industrial_Occasional_Table", 
  "price": "EUR 132.11", 
  "reviews": [
    "I like the table but I agree with other reviewers that the wood veneer looks too orange and not a faded rustic brown like the living room photo, it does however match the last top view image in the gallery. I may try to stain it a darker brown to give it a more natural wood look.The top wood piece is a solid piece of pine wood with a veneer textured surface over the top and sides. I think the veneer surface has too much of a sheen to look \"Rustic.\" I honestly think the pine wood surface would have been a more \"Rustic.\"I also wish the black metal frame was a stark black, it has a slight dark greyish/brown tone. I may spray paint it a solid black since I was trying to match our black metal chimney. But overall we're happy with the price and modern industrial look, it's an upgrade from our old composite wood coffee table.", 
    "This table looks pretty alright. It's not super sexy or unique looking, but it's okay. The base is made up of individual pieces that you screw together (as opposed to a welded steel frame). It was easy to put together and included everything you needed, and it feels really solid once assembled. It is kind of big, so think about the height of your sofa compared to an 18\" tall coffee table. I believe the top is MDF with a veneer- it is solid and heavy. The veneer looks and feels like solid oak. (Oak like the ugly bathroom cabinet from the apartment you lived in in the late 90's. ) So, it doesn't look fake or plastic, which is great, but it also doesn't look like beautiful warm teak or trendy reclaimed barn wood or anything like that. Just a matter of personal taste I guess. Because it is a veneer, I don't know how easy it would be to sand and refinish. But you could easily replace the whole top with the aforementioned barn wood if you wanted to! I'll probably live with it for a while and see how I feel, but right now I'm just really not in love with the way it looks.", 
    "I love the design of the table, but the veneer wasn't what I expected.", 
    "I love the shape of the table, but it is much bigger than I thought (my error not focusing on the dimensions), it looks really solid, but the top is not what I expected : its an ugly brownish color, so I covered it in my own way with paint.", 
    "I originally fell in love with the box coffee table at West Elm, but I did not want to pay so much. Luckily, I found this table, which looks almost exactly the same in aesthetics and quality! In terms of color, the wood veneer is a maple color and does not look cheap. The added bonus was that the table was very easy to assemble.", 
    "I love this table - easy to assemble and looks great in my living room. My only grief is that the wood was a little more orange than I anticipated, but with time, that'll darken up with use. I may be able to scuff it up a bit and add some darker stain, too.", 
    "Luv this table very sleek simple & classic. My decors been heading towards rough weathered rustic but this tables got me going back towards simple classic rustic. I know I'll have this one for years. Easy assembly but solid! Top is mid-century smooth veneer. Pottery barn style.", 
    "Really easy to assemble, color and measurements fit the description of the product.", 
    "Larger than I expected. it'll take up most of an 8x5\" area rug. The wood matches the picture. modern.", 
    "Wood top is lighter than pictured. Easy to assemble and good-sized coffee table.", 
    "Great table, nice finish and color on the wood. Super easy to put together!", 
    "I was very nervous ordering furniture online but had not been able to find the table I wanted at the pricepoint I wanted. This table was better than expected. The wood is a good match for my antique oak entertainment center. And the style is a simple, clean look that offsets more detailed furniture I have in the room. It gives my room a contemporary look and keeps it from becoming to staid. I love it SO much that I just ordered the matching end table which was not available when I got the coffee table. And it was a snap to assemble. I recommend it.", 
    "Table arrived quickly and was slightly difficult to put together but figured it out and had it assembled in about 30 minutes. Purchased it for our living room and since we don't spend a lot of time in there didn't want to spend a lot of money. It's big (as I expected) so we don't need side tables which also saved us money. Modern, stylish and appears to be real wood - so it's sturdy. I would recommend this table!", 
    "Well desigend and manifactured", 
    "Love this table. Looks expensive and we get a ton of compliments. It's on the larger side but we don't mind.", 
    "This is a very well built, sturdy coffee table that looks great. The pictures on the website very accurately represent what the product looks like.", 
    "Arrived quickly and was easy to assemble. The top resembles a laminate and not as rustic as I had imagined. I may take some sandpaper and chalk paint and give it my own unique finish. For the money, if I only use it for a couple of years, I'm okay.", 
    "Good price and sturdy table. Very easy to assemble. Color is a little warmer than pictured. Otherwise a very good buy!", 
    "I wanted an industrial-loft style coffee table that was sturdy and pretty kid-friendly with high style. This is it! I looks like a high-end table from a pricy decor store. The price is right and it makes my place look finished and sophisticated. While it is a medium brown in person (I thought the wood would be blonder from the photo), the wood grain is beautiful and the metal adds a nice, metro-chic look to my living room. Coordinates nicely with my other dark-wood furniture and cream carpeting. Thanks Overstock! Came quickly and stunning!!!", 
    "It really is a lovely table for the price, I love the metal but I hoped the wood a little nicer in person.", 
    "Gorgeous industrial coffee table. It was relatively easy to put together. Only giving it less than 5 stars because the top is a slightly different color than I expected. I expected a sort of muted ashy wood color but it's more oak colored. Still love it!", 
    "I LOVE these tables. They are real wood on top and have the metal leg frame. Aren't too heavy to move by myself though. Love them."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Dixon-Rustic-Oak-Industrial-Occasional-Table/9791714/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9791714/TRIBECCA-HOME-Dixon-Rustic-Oak-Industrial-Occasional-Table-e98cf57d-adfd-4c54-9fe4-b53c1089f5be_600.jpg"
  ], 
  "description": "Create an aura of industrial chic in your living room when you choose this rustic occasional table from Tribecca Home. This spacious table has plenty of space for your favorite coffee table books, a vase of fresh flowers or a favorite piece of art, with room left over to set down your coffee cup or cereal bowl. Pair the clean lines of this table with your modern or shabby chic decor and enjoy the way the oak veneer warms up your room. Metal framing adds stability to the table, while the thin legs and open design create a sense of space.Choose from matching coffee and end tablesSturdy construction of black sand metal, pine wood and wood veneers promises durabilityBrown finish creates a rustic lookCoffee table dimensions: 8 inches high x 48 inches wide x 24 inches deepEnd table dimensions: 24 inches high x 24 inches wide x 22 inches deepStyleCasual, Industrial, Rustic, VintageMaterialABS, Metal, Veneer, WoodTypeAccent Tables, Cocktail Tables, Coffee Tables, End Tables, Side TablesFinishWood FinishShapeRectangleAssemblyAssembled, Assembly RequiredColorBrownProduct FeaturesEco-Friendly"
}