{
  "name": "TRIBECCA_HOME_Myra_Vintage_Industrial_Modern_Rustic_Bookcase", 
  "price": "EUR 330.28", 
  "reviews": [
    "Great shelving! Easy to put together however EXTREME caution is needed when handling the shelves. There are notches cut into each corner of each shelf that fit into the metal \"legs\". I broke each piece off simply by picking up the shelves and trying to put into place. As always, Overstock customer service was wonderful and sent replacements within the week.", 
    "I ordered 3 bookshelves to sit side by side in our living room and they look great - exactly what I was looking for. It should be noted that the wood shelves are planked and scraped, giving a rustic look. The finish is smooth and can be dusted easily. A couple of shelves were not as perfect as the others, but overall the quality is good for the price. I am happy with my purchase and with my experience shopping at Overstock.com.", 
    "I shopped and shopped online and off for an affordable industrial book shelf and I was not disappointed. This product arrived and was exactly as depicted in the write up. Well packaged, no breakages, easy assembly. I love the rustic, industrial feel of the product. The only caution, beware the styrofoam padding cause you will have little static styro balls everywhere - assemble in the garage!", 
    "If you've seen the catalog that begins with a B and ends with d's this is very similar to the tower they show for $369. but that one has two more shelves and the quality of the components is likely to be better. For my purposes this is perfect; it suffices in form and function. I put it together myself in minutes, easily.", 
    "Like all the other buyers of this product, we wanted to buy a bookshelf with industrial look and found other stored to be very expensive. We took chance on this product and found it to be good looking, stable and it serves the purpose. The entire package was very lightweight which made me concerned about stability of the shelf but surprisingly it is very stable and does not move at all esp with tons of books that we keep on it. Only 2 small problems. One, it smelled really bad initially for a day or two but after that the smell completely went away. Two, there are no pre-drilled holes for the screws either in the bottom or top shelf but I was able to screw in with ease though needed wife to hold the shelves in place while I was doing that.", 
    "After reading a few of the reviews about the shelving having broken corner pieces upon arrival or breaking upon assembly, I was a little hesitant. However, the look of the piece was striking and perfect for the space I wanted it for, so I ordered it. It arrived on time and very well packed. I see the possibility of the wood shelving corners being compromised if someone were to pick the shelf up by the corner or force it into its' space while assembling. I was very careful in unpacking and assembly to insure there were no mishaps with the corners. The bookcase was in perfect order and truly easy to assemble. It looks great. I would love to have another bookcase along with the matching desk. If I had one con it would be that the height between shelves is about 14-16\", which is quite a bit of space. Otherwise, it's the perfect piece for the space and we love it!", 
    "One shelve was broke when delivered, but instead of messing around and sending it back, used some wood glue and put it back together. They were very simple to put together. My 16 year old son put them together in about 15 minutes! I ordered 2 shelving units. They look good and are holding a lot if books! I gave a 4 due to fact shelf was broken at delivery.", 
    "I purchased two of these to flank the sides of my sofa in my den. I love these bookcases. They fit perfect in my den and they have more than enough space for all my books and what-nots. Even though these shelves aren't very expensive they do not look cheap at all. They are very nice and I think they add a lot of style to the room. I would recommend this bookcase to anyone who wants a good solid piece but doesn't want to break the bank getting them.", 
    "This is a piece I will enjoy showing off. It is simple. I like the clean lines. This piece is timeless.", 
    "I purchased two of these about a year ago and have loved them. Highly recommend!", 
    "Works perfect for my kitchen!", 
    "Mine arrived with no damage thanks to the fitted Styrofoam around all shelves. You will need an allenwrench as its not in bag with the screws. All other parts were included. The actual shelf size is 12 1/4\" deep x 24 3/8\" across. The color almost has a red or mahogany tint to it. Very warm and distressed finish. I guess it depends on the finish you get as the description offered gray, brown or dark brown. I wasn't given a choice when I put it in cart but I'm so happy with the finish I received. I ordered 2 bookcases and they both match so I'm happy. No broken notches on mine but I was careful and didn't force the shelves in place. Just follow the order of the directions and the predrilled holes will make assembly very easy. I put one on each side of my big tv and it looks amazing. Think you'll feel the same about this item. 100% satisfied", 
    "I purchased 2 of these Bookcases for my Dining Room, although I'm using them for dinnerware; not for books. They were packed well to avoid damage and went together fairly easily. All parts were accounted for. They are very attractive and sturdy shelving units. They were a good value and are a well-liked useful purchase.", 
    "Very happy with this purchase. Bought four units for our downstairs family room. They look absolutely fabulous. Sturdy, well-made, easy to put together.", 
    "Looks better in the images on overstock, overall cheaply made, you could probably find better or at least similar quality at Homegoods, Tj Maxx or Marshalls for less.", 
    "Textural and architectural details combine to make a visually interesting set of solid shelves. Easy to put together. The thick wood shelves have a re-claimed, rustic, hand sawed look. Warning: this is not fine furniture. One shelf was a little too rustic as it had a large crack and an uneven surface, but that got buried under a row of books. Made in china.", 
    "Just as pictured. both rustic and modern are great words to describe it. easy to put together, so easy It was done without the instructions because they were misplaced, only to be found after it was assembled. YOu will need a Phillips screw driver. The shelves are high, so if you want to use it for books, you will need e book ends,or really tall books!", 
    "I love this bookcase. Super easy to assemble...so I bought another...they are sturdy and really cool.", 
    "We saw this or one very like it at a local furniture store, but it was a lot more than we were willing to spend for what we needed. But on a hunch, I decided to see if Overstock had the same thing. If this isn't the same, it's so close we couldn't tell the difference and we decided to purchase it. It was easy to put together and exactly what we wanted. It's a little flimsier than we thought it would be, but not sure if the one in the store was any different, as we didn't lift or move it. But it's sturdy enough and LOOKS really sturdy.", 
    "I am very satisfied with these bookshelves - so much so I am going to buy another one.", 
    "I was looking for a bookcase that I could display my NFL footballs (2 ) and a full size NFL helmet. My husband and I put it together with no problems. While I still need to purchase display cases for the helmet and footballs, I staged the items in their boxes and everything will fit just fine.", 
    "This is a very nice bookcase. excellent value!!! I would expect to pay such more for.this bookcase anywhere else. Very simple assembly as well.", 
    "Functional, stable, holds lots of items and shelf depth is adequate", 
    "Bought this bookcase to match my new TV stand I bought at a local furniture shop. Using it with wicker baskets to hold my DVD collection. Easy to put together. Quality is excellent. Great look. I would recommend this bookcase to anyone looking for a really nice piece of furniture at a cheap price. Delivered on time with all parts and instructions in box. Craig", 
    "These are perfect for my needs. I did not want heavy-looking all wood book-cases as I have wood floors and a large wood mantle in my living room. They are strong, easy to assemble and I like the design w/crossbars on the back. I especially like the open, airy feel and the size of the shelves.", 
    "The wood on these shelves looks kind of cheap close up, and is very light and brittle. One corner of a shelf was completely broken off. I used the Overstock online chat to talk to customer service, and they offered to send me another shelf or give me a $20 credit. I was able to glue the shelf and it looks fine, so I took the credit. The shelf was someone narrower than I expected.", 
    "I bought 2 of these to stand on each side of my tv cabinet in the livingroom. they are exactly what I thought they would be and I love them.", 
    "Really nice shelf, looks much more expensive, knocked one star off for initial smell. Very strong smell of gasoline first few days I believe coming off wood finish.", 
    "I received this unit a week and a half ago, put it together in 10 minutes and within minutes of putting it in its place, had to put it outside. It smelled so bad. I was nervous to keep it inside. It has been outside since. I am hoping that the smells dissapate the longer I have it out there. I am looking forward to having it inside as it looks perfect. Too bad for the delay.", 
    "has to be built but not difficult...good quality", 
    "Rustic, functional, sturdy topped with a great price point! I choose the 'brown' and it is rich in color, not too dark not too light. Have the entire line in my office/library and they are working out great! Easy to essemble too!", 
    "Love these bookcases. So well built and sturdy but not bulky. Love them in our home office.", 
    "Sturdy and looks amazing in my living room. Looks way more than I spent", 
    "I only gave them four stars because one of them came without the predrilled holes on the top shelf. When I contacted O.com I was told they did not come with the holes drilled. Imagine their surprise when I respond by telling them that we already had one put together and it did have the holes. We also ordered the desk and media center from the same line and they all go together the same way. Neddless to say we are getting a new shelf today. As for the bookcases they are great. Easy to put together tall and attractive if you like this look. It is all for a home office. I would recommend anything from the TriBecca line. It seems to be well constructed and the materials are nice.", 
    "Nice quality, sturdy...good looking home accent piece. Traditional/rustic/Tuscan. Easy to assemble. Wish I would have purchased 2. Quickly shipped and received. Don't hesitate.", 
    "I have this in my kitchen. I love it", 
    "It's beautiful and easy to assemble. I love it!", 
    "quality is excellent, well built and looks fabulous", 
    "Very sturdy and nice looking.", 
    "This is a wonderful sturdy shelf that is very easy to put together, all in all very pleased!", 
    "I am very pleased with the quality of this product. I will be ordering another one. I was easy to put together.", 
    "I purchased two of these bookcases and they were easy to assemble. They look good in my room.", 
    "these shelves were easy to assemble and look/feel sturdy. Very pleased with them.", 
    "Loved the look. Easy to assemble.", 
    "Sturdy and stylish. Held up for over a year and blends fantastic with any decor", 
    "Nice addition, easy to put together", 
    "My husband just built this yesterday for our office. The bookcase is beautiful and looks a lot more expensive than it is!", 
    "Color and size perfect for my space. These shelves are functional and well priced. Shopped around quite a bit. They work beautifully. Thanks overstock.", 
    "Easy to put together, looks nice. Overall a good value for the money. The only negative is the finish on the shelves looks a bit fake, but covered with boos and other items, you'd never know!", 
    "We initially used these as bookshelves in our office, but now we have them as accents to our king bed. Both looked fantastic!", 
    "I love this series of rustic office furniture. It's very stable and solid and easy to put together.", 
    "Subtle chic- I get complimented on this piece often. My mother in law loved it so much she bought one for herself. Love the industrial look", 
    "Just love the look of this bookcase!", 
    "I love the bookshelves. They cost very little but add so much to my living room. For the price they're build well and sturdy", 
    "These are great shelves. We used to stage a kitchen and they were a huge hit!", 
    "Sturdy and well-made! Would purchase again!", 
    "I love this bookcase! It looks amazing in my living room. Matches the other pieces perfectly too.", 
    "Love these shelves. They finish off my living room. I wasn't sure when I ordered the first one so I waited until ordering a second one. Easy to put together and the brown bisque color matches the reclaimed wood mantle on my fireplace. Using a drill for assembly made them easy to put together.", 
    "This piece is easy to put together and is great quality for the price.", 
    "I love this shelf. It's well made and easy to put together. It looks beautiful with my other decor and fits well in my small space.", 
    "We needed a specific size in the space and these fit the bill perfectly. The wood was the right color, they are sturdy and have just the right balance of looking industrial and modern for the \"northwest contemporary\" look we were going for.", 
    "We purchased two bookcases and are very happy with them. They are extremely easy to put together, sturdy and look great!", 
    "I really was impressed with this bookshelf. I've gotten many compliments. Great purchase!", 
    "I bought two of these after deciding mainly on the basis of size and price. There are so many similar products available, you can be pickier than I was. One of the pieces went together well. The other tips forward quite a bit and will need to be fixed with something more substantial than a matchbook. the awful smell (probably a pesticide needed to import from China) is dissipating. The mismatched warped boards don't really matter since they will be covered with books or objects. Bottom line, not quality furniture but a very easy purchase.", 
    "I get compliments from everyone who sees it. It is sturdy and was supper easy to put together. I am thinking of getting another one.", 
    "We had to do some sawing to get one of the shelves to fit properly but overall it looks great!", 
    "Been happy with he purchase", 
    "The look is nice on this piece so I rated it good. It works well as a decor shelving unit. Doesn't work well as a bookshelf because it's an open concept but for decor and AV equipment, it works fine. The wood is a slightly uneven grain and easy to scratch when you put together with the metal pieces.. Was easy to assemble.", 
    "It looks great and fits very well with our rustic modern theme.", 
    "I love the look and sturdiness of this bookcase. It is very easy to assemble.", 
    "I am a single senior citizen and was able to put this together alone in about 30 minutes. Excellent instructions and it fit together perfectly!", 
    "I absolutely love this piece...it looks very high quality, it was super easy to assemble and the price is unbeatable. It's actually a fairly light piece of furniture, I highly recommend attaching it to whatever wall it's up against, as it is a bit top heavy and could possibly be a tipping-over hazard.", 
    "Super easy to put together and looks great! Its a little wobbly until the cross bars are added but once they are, its firm.", 
    "LOVE these! Easy for one adult to assemble, sturdy materials, gorgeous in my room.", 
    "Very easy assembly and great looking!", 
    "I bought this bookcase for my family room. I like the way it looks but I would not buy it again, the quality is not good. I had to replace two shelves, the corner of the shelves break easily.", 
    "I was disappointed in the quality.", 
    "Easy to put together, just make sure the holes that hold together the \"X\" piece on the back align before tightening the screws.", 
    "Again, another modern piece of furniture & we are very pleased about. In fact we bought two of these!", 
    "Not only was this easy to put together but is looks great. Because of the open shelves it doesn't look like it takes up a lot of space.", 
    "Arrived well-packaged. The wood is a bit distressed, so expect some rough spots. Assembly went well. A little unstable on the hardwood floor (but it could be the floor itself), so I had to use a small pad underneath one leg, and it's fine. I'd purchase it again; the price is reasonable.", 
    "I set it up myself without a problem. Heavy and substantial. Does not look cheap", 
    "Materials are definitely cheap and the packaging is disgusting - mounds and mounds of styrofoam. That said, very easy to assemble and sturdy, attractive.", 
    "This bookcase matched well with the desk. Both pieces are stylish and sturdy.", 
    "Sturdy and beautiful. Easy to put together, did it by myself in one hour. Goes great with our rustic, industrial decor.", 
    "Exactly as pictured, easy to assemble. Has a modern, rustic look. Great addition to our living room", 
    "Solid shelf. Great looking. Put it together in less than 15 minutes.", 
    "The bookcase is tall and nice looking but difficult to assemble and not as sturdy as I would like. The instructions state it needs to be anchored to the wall which is not permitted in the apartment. Concerned it will tip over. Do not purchase if you have small children.", 
    "a little difficult to assemble but it works", 
    "Love it!!! Looks wonderful.", 
    "This is a great bookcase. I ordered it for my son's room and it looks perfect. I was able to put it together in less than 20 minutes and it is very sturdy. Very happy with the price as well.", 
    "it's exactly what we needed. simple to assemble. looks great.", 
    "I really like this new shelf. A few of the shelves are not exactly flat, but that is OK. Also the character on the wood for the very top is facing up and I think it should be facing down, since no one actually can see the top of this piece of furniture. I would buy it again. Looks great in my opinion and I'm a pretty picky individual.", 
    "Very well packaged and easy to assemble. Wood shelves were expensive looking and great vintage look for the bargain price", 
    "This bookcase is very sturdy & well built. I like rustic to a point because I don't care for items taken from behind someone's garage and call it repurposed, so I was a little cautious when I saw \"rustic\". The bookshelf is very classy & I intend to purchase another one.", 
    "Clean look and lots of space between shelves. Great piece.", 
    "We bought two of these plus the bookshelves. When it arrived (promptly in 4 days) my husband looked at the boxes and said 'if this takes more tools than we own to put together we are sending it back. In fact it took two of us less than one hour to assemble both desks and the bookshelves. All it took was the one small ikea looking tool that was included in the packaging. Very nice heavy wood peices that look great in our house.", 
    "They look fantastic, arrived in excellent condition and were easy to put together", 
    "While assembling, three of the shelf corners broke off. It took very little pressure for this to occur. I continued putting it together since I could turn the bad corner toward the back and the shelf still had enough support to be useful. Take great care during the assembly to avoid my mistake.", 
    "I looked at similar bookcases from VERY high-end retailers. This bookcase is so close in design and character to those very expensive industrial types that I feel like the queen of bargains! Quality is good excellent. I'd recommend this piece highly!", 
    "Looks soooo much more expensive than it is.", 
    "Does what it needs to do while looking good. To me, being a lightweight shelf is an advantage as I can easily move it around if I want too. I store books, a printer, and board games on it and it does the job.Would rather give 4.5 stars, just docking a little off because of the price for what it is and the materials it is made out of. The materials are far from the worst, but nor are they the best. Would recommend to anyone to get though (and have done so to a couple of friends already)!", 
    "I bought the book shelf, desk, and end table. Super easy to put together. Sturdy. Looks great. Love it!", 
    "Love Love Love This! We bought 2 of these. They were really easy to put together. The only issue I had was 1 set was missing 4 screws. It took a while (can't remember how long) to finally get the screws in. I ended up going to The Big Box Store and bought 4 screws for $. You can't see them so no big deal.", 
    "I'm not a very handy person, but this was so easy to install I was very happy with the result. I like it so much that I'm ordering another one today to make it even bigger. Great look but the only thing that I didn't like was the smell it gives off. Very strong, but hoping it diminishes as its now standing an airing out.", 
    "Beautifully constructed bookcases and easy to assemble. Lots of compliments from friends and family. Great quality for the price!", 
    "I like the wood quality of the shelving, especially how the wood has an uneven surface. The wood quality of the top piece wasn't very good. The metal is pretty low quality; there's a reason you can't find \"black sand metal\" on google or anything. The two crossed wires in the back have a slot for a bolt, but it just connects the two wires and doesn't screw into anything. The shelf itself is unstable, too.", 
    "I ordered 2 of them and they look perfect in my livingroom. They are a great wood color and very sturdy.", 
    "Tribecca, you are awesome! This is the third piece of theirs and I am more impressed each time. This is such a popular look now and makes a statement. Packaged good and heavy sold pieces. Love it!", 
    "Nice, slim and perfect for the bedroom", 
    "Husband put together in 10 minuets and I love it", 
    "Just added this bookcase to the tv stand that matches, and it makes it look even better. I have gotten so many compliments on the industrial loft feel that I was going for in getting both of the Myra shelves. Very easy to put together and shipping was quick. The only issue was that the screws for the bottom shelf were too short. They just spun around and did not lock the shelf into place making the whole shelf unstable. It was easily fixed by going to the hardware store and getting a longer screw. I got two inch screws, and even though the come through a bit, it isn't noticeable. I would definitely recommend this line of products to anyone.", 
    "This is an excellent option for living or office. Only the tops of the shelves have the textured look, the side edges do not, but this does not detract. very sturdy and functional", 
    "Great style, really cool- very happy!!!", 
    "After reading other reviews I decided to purchase two of these shelves. Knowing that the edges of the shelves break easily, we were very careful with them and none broke. They were easy to put together and are beautiful. I think they cost too much for how they are made, but it's the look I wanted.", 
    "First, some of the boards will be warped. This is not a defect, just how these boards are fabricated. Given this nature of the bookcase, some of your decorative items might not sit steadily on the boards.But for us, it worked out fine. The assembly was easy enough.", 
    "Great piece in my living room, easy to put together in minutes! Love the color of wood. Good purchase!!", 
    "I purchased this for the bedroom. I also got a matching \"TRIBECCA HOME Myra Vintage Industrial Modern Rust 3-piece TV Stand Set\" to go in the living room. It is fairly easy to assemble and rather sturdy once all the screws are in place. It looks great in the space and is exactly as pictured here. I do not know about the pricing of such items, it seems a little on the expensive end, but I bought it anyhow. The packaging kept it snugly in place, though the styrofoam used in the packaging left white flakes all over the place.", 
    "This is a small and narrow shelving unit but perfect for where we needed it in a Chicago apartment. It looks like we paid more for it than we did. Highly recommend.", 
    "Unable to attach crossbars on back because item arrived with holes drilled in wrong place on one of the metal side pieces. Too much of a hassle to disassemble and return, so stuck with unstable bookcase.", 
    "This product is sturdy and has a very rustic look to it. I've gotten many compliments on it.", 
    "Decent quality. Very nice modern look. Love mine. Oneself a bit warped.", 
    "If you are looking for a industrial metal and wood bookcase this is absolutely great. I have several heavy books and this is perfect for the bedroom. The only thing is the cross bars for the back of the unit do not fit properly. They are not necessary for the structural integrity of the unit but they do not fit so that is why I have it four stars and not five. Overall a great book case.", 
    "My husband and I purchased this when we moved to our new home. It is much more durable than it appears when pictured alone and empty, and is both an imposing, yet not overwhelming, addition to our living room. I would highly recommend.", 
    "Love this shelf. Easy to put together, great quality and exactly as per the description.", 
    "Really nice shelf. Looks good in my kids living room.", 
    "I purchased this rustic bookcase as decorative pot and dish holder to display in my dining area and I and everyone who sees it loves it! Assembling it was extremely easy...didn't need the husbands' help at all! I would definitely buy a larger piece by the same maker. Highly recommend!!!", 
    "an unbelievable piece of furniture for the price! shelves are deep and perfect for a number of books/decorations.very happy with the purchase and it came in 3 days!!", 
    "Great look, easy to put together, just what we needed.", 
    "This is perfect and I love this piece. The price is great and it looks like it was so much more expensive. Exactly what I was looking for.", 
    "Using them for display in retail space. Adds to the modern, industrial look.", 
    "These are great. They look like they are very well made. Saw the same type bookcases for nearly double the price in other stores/catalogs!", 
    "This was so easy to build and looks fantastic!", 
    "Was able to assemble this myself, looks great with one focal piece per shelf. No durability or stability issues other than how it sits on the carpet, but it can be mounted to the wall if needed. Mine hosts a record player, basket of records, pictures, and a few wooden boxes. I love the visibility the open-back creates. Frees up a lot of space in the room.", 
    "The bookshelf is stylish and modern. Very well worth the price. The only slight complaint is that the very top shelf was scratched. Fortunately it faces the ceiling so no one will ever see it. I would definitely recommend.", 
    "Industrial rustic and chic while still being HIGH END quality. My husband put this together rather quickly and didn't seem to have any trouble, the wood is a nice warm color and feels finished and durable. The metal does not seem like it will chip or rust but of course only time will tell. I would definitely recommend the bookcase.", 
    "Impressive. They are flat, sturdy, look great. Great price. Compared to other sites these are much less expensive and look great.", 
    "Look like high end shelving from PB", 
    "I own a number of pricey pieces from a store that rhymes with Hestoration Rardware. But I honestly don't care where my stuff comes from as long as it looks well constructed and quality. This shelf looks perfect amongst my far more expensive pieces--and garners many compliments and questions from guests about where it came from. I've had it about a year and it has proven a quality piece. It was easy to put together and a total deal. Love it.", 
    "Love the shelves easy to put together great looking good value for the money", 
    "I bought this item to match with 40 inch bookcase and even though I bought them a year apart the are identical colors and styles. Only difference is this piece is about an inch taller than the 40 inch one, but I have them spread apart in the room overall very satisfied, well built and sturdy.", 
    "These are great shelves. Really easy to put together. Nice and sturdy.", 
    "I bought this bookshelf along with other matching pieces for my daughter. It's sturdy, beautiful, really good quality and affordable. I love the industrial look of the wood with the black metal. This is nice, clean line furniture, not bulky at all. This is great furniture for someone just starting out in their first place, or retirees. It's timeless and lends itself to different styles of decorating. You won't be disappointed, it's even nicer in person that the pictures convey.", 
    "The bookcase arrived promptly and took about 40 minutes to put together by a single person. The shelf is sturdy and also looks really nice. No complaints here.", 
    "I like the industrial style, and this was exactly what i was looking for...I hope to have some flex with this item, as i bought 2 and the TV stand which can also work just as a book shelf by itself...It was a great price...", 
    "Love the rustic look of the shelves in combination with the metal uprights. Easy to put together by myself. Packaging was great. Very happy with this purchase.", 
    "We love our new shelves. They were easy to put together and look great in our brick/exposed beams apartment. The quality of the material is great for the price! Much better than the $*** shelves we were looking at in one of the fancy urban furniture places! Loved the free delivery! and the sale price!", 
    "Architectural lines and the perfect height; stunning finishes. Very happy with the purchase and may be getting another soon.", 
    "Looks just like higher end items that are similar", 
    "it was easy to put together and sturdy - perfect for that space that is just a little too narrow for most bookcases", 
    "Excellent quality and price! Really love this piece. Also purchased the coordinating entertainment piece! Great purchase. Highly recommend.", 
    "very attractive, sturdy, high quality, excellent value", 
    "Great industrial-like bookcase. Perfect size for my office. Love the X on the back of the unit. Saw same bookcase on another home decor website and it was more expensive and they charge for shipping. So happy I found this one on overstock...with no shipping charges. Great buy!", 
    "this continues to be one of my favorite pieces of furniture. You will be totally pleased.", 
    "This is a very nice shelf and came as described. Was not difficult to put together and had all the pieces. I love it!", 
    "This self is beautiful!!! I love finding items that are knock offs of the items in catalogs that I am obsessed with (*______* and *______* *____*). I actually like this shelf better than the ** version that is a whopping ***** ****** ******* more! The shelf arrived in a timely fashion and was super easy to assemble. The quality is awesome for the price. The shelving has a reclaimed wood look without all the rough edges. It looks just like the picture on the website. I couldn't be happier with my purchase and I am super picky!", 
    "I started out ordering 1 of these shelving units and liked it so much that I ordered 3 more. They are very easy to assemble. The shelves are nice and wide allowing storage of most anything you could need to store. I have used them to \"coral\" my quilting supplies which includes lots of fabric, patterns, magazines, books etc. They helped me turn an impossible mess into a well organized room. Color me a happy quilter.", 
    "Looks fantastic and displays my serving ware just like a pottery barn catalog. Only wish it were a teensy bit taller, but once I stacked bowls on the top it had the height I needed.", 
    "I purchased 2 of these to go on either side of my TV credenza. The wood is solid and they were simple to put together - It took me about 20 minutes per shelf unit. The boxes arrived with no damage in a timely manner. They look just as pictured.", 
    "Easy to put together and matched my TV stand perfectly. It looks just like it is pictured.", 
    "The bookshelves were easy to assemble. We ordered three, each took about 10 minutes to put together with just one person needed. The quality of the shelves is better than we had expected, given the low cost--they were real wood and significantly less than \"name brand\" stores selling MDF shelving.", 
    "Rustic and beautiful looking - nice and sturdy. This shelf looks like something from ***** and ****** or *********** ********. We love it and it's a beautiful addition to our bedroom. If this is the look you are after, it's well worth the buy.", 
    "Bought this for a Leasing office for a display area. Was very pleased with this purchase. Color was just as pictured and the quality good, it was easy to assemble, size is as stated. Looks great and and looks like a quality piece. We have had many compliments on it. I would recommend it highly.", 
    "Excellent buy. Very sturdy, love the style- definitely on trend.", 
    "I found half a dozen other similar bookshelves which were smaller and more expensive. This one is tall, sturdy and inexpensive. Some of the other reviews spoke about the shelves breaking, but I'm not really sure how that's possible. I mean it's wood, it might split if you hit it just right, but not breaking\" like a piece of glass. Total set up was about 15 minutes. I did it with my 4 year old \"helping\" me :) Great value and it looks exactly as pictured.", 
    "I bought two shelves for my den. The metal color was not really what I expected. It was a black color and I thought in the picture it looked more like metal/silver color. The wood is nice though, it looks distressed and is a good color. Overall I kept the shelves because they work for what I need and were a good price, but I think there are other shelves out there that are probably more higher end looking. I needed this size, which is really nice. They were pretty easy to assemble and were delivered very quickly.", 
    "I had purchased one of these bookshelves for a breakfast nook, and loved it so much I got another for my home office. They are made very well, and look great in both rooms! Love them!", 
    "Great looking bookcase! It's exactly what we were looking for but for much less than other high-end stores. The colors are just as pictured and the quality is great. We purchased two of them and placed them in our family room. We love them!", 
    "On the pro side this bookshelf is good looking, stylish, and sturdy enough for what I want to use it for. On the down side, it did have a funny smell (which went away) right after unpacking; while I think it's strong enough to hold up indefinitely for decorative use, it does wobble a bit even when even when everything is tightened.I love the look of the shelf - it has a very stylish and modern look, but does not look out of place in my very old and traditional home. It works with a lot of decors and is useful for tying together other modern and traditional pieces of furniture. If you get really close and inspect the parts you do start to realize that the quality is not as good as it seems from afar, so in my opinion this piece is best used in areas that aren't necessarily the focal point of the room. That being said the quality is still pretty good and sturdy, so it will work in any room.Assembly took 15 minutes without any help. I use it to hold some plants and some small sculptures; the size and quality is just perfect for that.When I unpacked it there was a weird off-gass smell that I didn't like at all. The smell faded in an hour or so, but it makes me wonder what kinds of chemicals might have been used in treating the wood. I'm not very sensitive to those kinds of things, but if you are, it's something to consider.The individual pieces are all strong and look durable, but for some reason the fit and finish is such that there is still some wobble when you put it together. It's not enough that it detracts from the usefulness or beauty of the piece, but it is there. If you're using this for purely decorative use (which I imagine most buyers are) the quality is more than enough. If for some reason you envision this as a heavy-use kind of thing you might consider looking elsewhere.Overall I love it!", 
    "Great product. Easy to put together and looks great as a unit with the TV stand. You won't be disappointed.", 
    "Great industrial style, pretty sturdy, terrific value. If you really look, you'll see it's not an extremely high quality piece. But it looks great, and everyone who see it really loves it.", 
    "I bought this to match the coffee table and it matches perfectly while still looking \"unique\"TOTALLY happy with the price, delivery and packaging....It took about 15 mins to assemble - it's 8 screws and 5 bolts.", 
    "love this bookcase, I was skeptical about buying it because of the price but this is a great value. it looks great and is definitely worth it!", 
    "I decorated a townhouse for a friend of mine recently and we purchased two of these shelves for her kitchen. Everyone who walks in RAVES about them, even though she has a sectional from **** Just goes to show that you don't have to spend a lot to have beautiful taste!", 
    "Although I did not put books on this piece, it is a perfect design to fill my space. I own the Myra Vintage tv stands and table and this matches perfectly. Easy to put together and the wood will last for years. Very simple, natural look.", 
    "Very rustic looking piece of furniture! We got this piece to display some vintage items and it looks really nice in the living area where we hang out most of the time. Friends have given us compliments and I've seen it at a local furniture store for twice the price on sale. You can't go wrong with this Tribeca bookcase!", 
    "This bookcase looks much different than the picture. We were expecting a more patina color to the metal posts. However, the black is nice, too. It has a very rustic, industrial look, which worked for us.", 
    "Looks great! Good quality. Some problems with imperfections on the wood shelves. Overstock did a great job of providing replacement parts. I would highly recommend, and hope for the best on the imperfections. My end result is an excellent looking unit! Bought two more...", 
    "I have always been so pleased with Overstock's quality. And this purchase is no exception. I have seen similar pieces in boutique furniture shops that are triple the price, and the quality looks the same. Great buy, I bought two to flank our couch in the living room. Great, stylish addition to the room.", 
    "I bought this book shelf after I had bought the matching desk. It is really easy to put together and the quality is outstanding. It is far less expensive than something I could buy from Pottery Barn and better quality. I'm very pleased with this purchase.", 
    "I was looking for a large open air bookshelf to use as a component tower. This works perfectly and actually looks very nice. Very sturdy yet simple to put together.", 
    "Great bookcases. Very well designed and well built. The wood is distressed and weathered giving it a nice rustic look. It was simple to assemble and an excellent price for the quality.", 
    "I have been looking at these shelves for months trying to decide if they would fit into my rustic decor. When they were discounted on Black Friday I took that as an omen and ordered them. I purchased two to flank a french door leading to the lake. I am so glad I did, these shelves are the perfect blend of rustic and industrial. The wood is rustic and rough and the design of the metal braces with the wire support not only make the shelf beautiful but sturdy. Very easy to put together!", 
    "Easy assembly put together in less than 30 minutes. anchor included to secure to the wall which was a plus for our growing household. Comparable to similar companies but for half the price and similar quality. Smaller than the picture looks so make sure to measure space.", 
    "This matched my desk so I had to buy it. It is very nice looking. I think I was expecting a bit more, but still a great bookshelf.", 
    "Only problem I had was the cross bars in the back putting it together. Other then that I would like to have another one or 2 in my house. Very pretty with the grain of the wood looking rustic!", 
    "Extremely easy to put together! Best part about the set up was that it used a phillips screwdriver, not a cheap allen wrench! Took me, by myself, less than 15 minutes. Named 'industrial' but can honestly go with any decor. I'm very happy with this product", 
    "Modern. Rustic. Contemporary. Great Value! We bought a pair of these book shelves and assembled them fairly quickly when they arrived. The wood is rustic looking in texture and color. very nice. The cross bars in the back aren't noticeable, but help the shelves with sturdiness and help level the legs which is a nice touch. One shelve came damaged, overstock had great customer service in this situation as well. We enjoy them!", 
    "I got these bookcases because they look like the ones in the B D catalog for a 1/4 of the price. I'm thrilled with the look of them. They are rustic / country and a piece that doesn't overpower the room. Not sure how sturdy they are but for the price, definitely a great piece.", 
    "The shelf is made of good quality material. The self in easy to assemble, looks great.", 
    "As described. Quick shipping and set up very simple.", 
    "I love the look and stability of this shelving unit. It should be advertised as a DISPLAY SHELF and not a books shelf as the shelves are spaced far apart and books look small. It is well made and looks great.", 
    "This bookcase really met our expectations. It looks like in the picture, with very nice distressed wood finish. The iron bars could be a little more refined, but after all the price is absolutely great. Installation was easy. The only warning is to make sure that the iron sides have the screw holes on the same side! We're thinking about buying another one.", 
    "This looks really nice with the TV stand. I bought them together. The quality was good to excellent, different streaks of color got is a \"good\" instead of excellent. Very sturdy", 
    "Took a chance on this book shelf by Ethan Home...love it. It fit our narrow wall perfectly and was easy to put together! We have received multiple complements and even had a friend purchase for themselves!", 
    "Nice and unobtrusive for a space where you expect these shelves to receive light use. They work very nicely for me because they are not heavy and substantial. You may have a hard time getting the screws in because there are no holes started, but it wasn't bad for assembly overall.", 
    "Loved these shelving units!! They look and feel a lot more expensive than they are. Super easy to put together and a style that can go anywhere from modern, to transitional to traditional.", 
    "We love the end result of these units --- we bought two. They are great when they are done, but did have a couple of issues with holes lining up and the top board on one of the pieces arrived warped so it is not flush.", 
    "This bookshelf looks terrific in an office entryway. The wordless instructions were clear and I assembled the entire unit in less than half an hour. The process is a bit wobbly until the cross braces are in place, but once the unit is assembled, it's a strong and attractive bookshelf.", 
    "These shelves are excellent value and very nice to look at. They are sturdy and easy to put together. We bought two sets for our living room and get tons of compliments on them. The price is much lower than I found anywhere else for similar products. Another great o.co purchase! We just bought a new house and have bought most of our furniture from this site and with club o rewards have been getting things for free along the way, can't beat that!", 
    "Love this bookshelf! We put this in my sons bedroom where there was limited space and it was a perfect fit. It is much narrower than a typical bookcase, which is why it was ideal for us. We also really loved the quality of the wood and the rustic appearance of it, plus it was really easy to put together. The ONLY complaint I have is that it definitely has a \"smell\" to it when you first take it out of the box. I've had it for about two weeks now and the smell seems to have gone away. Otherwise, we could not be happier with our purchase!!", 
    "The Ethan Allen Shelves have a great look to them. They are very solid and very easy to assemble. They shipped quickly and they have a great modern and rustick look. The wood grain on each of the shelves is a nice finish and is also good. The shelves are a walnut color and go very well with even espresso colored furniture. I bought three of them and put them side by side with leather furniture and it looks fantastic.", 
    "I needed a bookcase that would fit a small wall in a NYC apartment, but still hold a decent amount of books. And this bookcase fit the bill. It is very sturdy (and comes with a strap to attach to the wall so that it doesn't tip), and I was able to put it together in about 30 minutes.", 
    "I'm very happy with this piece. Overstock is a good company, love that shipping is either free or very cheap. This was pretty easy to put together and is sturdy assembled and looks awesome in my bedroom. Considering another and am on the waiting list for the end tables in the same collection. I'm pretty picky and do recommend this item", 
    "I love this bookcase so much that I am now ordering the end table.", 
    "What you see in the description and picture s what you get. I really like the look of the open bookshelf, and the shelves are solid wood. On assembly: two holes were pre-drilled in the wrong spot, so I had to re-drill them, but it was no big deal and took me probably 15 minutes from opening the box to putting my books on the shelf. Love the bookshelf, would buy another and definitely recommend to others!", 
    "These shelves are great and very easy to assemble. We put them in our home office and they look great.", 
    "I love this product. We received the shipment and my spouse assembled it. Since we just moved, he has been assembling many things lately and said the bookcases were the easiest to assemble so far. The quality is great and they were exactly what I was hoping they would be. I may order two more for the upstairs.", 
    "I ordered 2. of these after reading the reviews. Like others I had desired the ones from ******** but didn't want to pay the price. These are not as high quality as those but look excellent and work perfectly as a substitute. We are very pleased and happy with them. My husband (who is not vey DIY ) had no trouble putting them together. They came in good shape.", 
    "This is a great book shelf, though a little over priced, hence the three stars. I give it four for ease of assembly and instructions clarity. Not UNHAPPY, just thought it would be a bit nicer for the money.", 
    "Bookcaseswere delivered as promised. Easy assembly except one of the top shelves did not have the pre-drilled holes to attach to frame. Luckily, husband id super handy and was able to take care of final assembly. Very happy with my purchase. Great value.", 
    "This is a great piece of furniture for the money, especially compared to some of the higher end brands that make similar products. It was easy to assemble, except I could not get the final screw in on the back - but that might have been user error. The wood is solid, it looks great in our sitting room, the only thing I didn't like was that it had an oily/greasy smell for the first few days. This wore off eventually though!", 
    "The Myra bookcase looks great in our new house. The style is very similar to something I was interested by another company for a quarter of the price. I'm very happy with the product.", 
    "I have been shopping for modern shelves like these for a few weeks. I had found them in major furniture stores at prices from $*** to $****. When I bought at Overstock I felt like I was giving in and sacrificing value for cost... boy what a surprise. The shelves are what I was looking for, without the additional cost of \"the brand\". Don't you hate it when you see a product and you know the only reason it is so expensive is because of it's brand, not quality... ? You get satisfaction buying these shelves because it is what you want and quite reasonably priced. For the price of 1, at W*** E**, I got 2 from Overstock!!", 
    "Constant compliments. Very striking and interesting", 
    "I'm very happy with these shelves. They seem to be well made and are comparable to similar shelves that are much more expensive. The wood appears to be solid and the finish looks nice. The only downside is that the finish smells horrible and the packing was not great. One of the shelves arrived broken but Overstock sent a replacement right away. The bad smell goes away in a few days but makes me wonder what chemicals were used. It didn't smell like a typical stain."
  ], 
  "link": "http://www.overstock.com/Home-Garden/TRIBECCA-HOME-Myra-Vintage-Industrial-Modern-Rustic-Bookcase/6743626/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=19", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6743626/TRIBECCA-HOME-Myra-Vintage-Industrial-Modern-Rustic-Bookcase-4a2a5da5-c76e-465a-b984-f86cf1a43ec2_600.jpg"
  ], 
  "description": "Tall and narrow, this modern bookcase from Tribecca Home adds\nstorage to your home without wasting floor space. Dark metal bars\nsupport the bookcase's pine wood shelves, creating an appealing\nblend of natural and manmade textures. Four rubber feet prevent the\nrustic bookcase from sliding and protect your flooring from\nscratches. Includes: One (1) bookcaseMaterials: Pine wood, black sand metalFinish: BrownShelf height: 16.5 inchesDimensions: 74.5 inches high x 26 inches wide x 15 inches\n  longStyleIndustrial, Rustic, UrbanMaterialWoodFinishBrown Finish, Grey FinishShelf TypeBookshelvesAssemblyAssembly RequiredColorBrown, GreyFurniture Frame MaterialWoodGallery MatchYesGallery RoomAdagio Ambiance, Anna's Loft, Brandon Club Court, Cascadia, Lorimer, Quiet Taos, Snow Dove Drive, Tapas at Midnight, Urban BordeauxNumber of Shelf4"
}