{
  "name": "Upton_Home_Wall_Mounted_CD_Rack", 
  "price": "EUR 45.31", 
  "reviews": [
    "I bought two of these racks based on their size and on the generally good reviews I saw on overstock. They are okay, but I have several issues with them. First off, I'll say that I agree that the mounting hardware they provide may not be strong enough. The plastic drywall lugs they provide are strong enough if you have decent drywall and they worked fine in mine, but the screws seemed awfully small and I didn't trust them, so I used my own screws. If you can locate the studs in your wall, wood screws directly into the stud would be an even better option.A major issue I have with the unit is that the slots are designed only for standard jewel cases. I have several double cd's in the old wide jewel cases and it won't hold these. Don't even think of trying to fit a specialized box set into these. I didn't buy this with dvd's in mind, but if you are, buy something else, they won't fit.As far as workmanship, they are pretty basic...molded metal wire....but sturdy enough. They arive with no further assembly required. They aren't exactly a design dream, but they look okay I suppose. I keep my living room relatively clutter free and the days of displaying my cd collection as part of my living room decor ended in college. I bought these to hang inside a closet and they work quite well in this fashion.In short, if you have a relatively small cd collection of only standard size jewel cases or the thin cardboard sleeve type cases and want a rack that can be hung in a relatively tight space, I would recommend this. It would function fine in a college dorm room for example. The workmanship and design isn't quite of the quality that I would hang it up in a home theater or living room, but for the price, the functionality is adequate.", 
    "Love the design plus it saves floor space for other things. Holds a good amount of cd's and a great price.", 
    "Wish I had more of these!", 
    "I never expected this item to be so well-built to be as heavy as it is. I put it near a corner, and it looks really good.", 
    "Looks good.. works for my rack of cds", 
    "Perfect solution just wish it held more cd", 
    "My dad asked for a rack to hold his cd's for father's day this year, and when I saw this, I thought it looked interesting and unique. It turned out to be exactly that, my dad loves it, it's up on his wall now :)", 
    "It looks great, out of the way storage as it hangs on the wall. I wish it held more CD", 
    "Easy to mount, visually appealing, more decoration than any simple media storage unit.", 
    "I ordered 2 and hung them cross ways instead of diamond shaped so that I could read the cd titles without having to tilt my head. Worked very well for me. The rack holds A LOT of cd's and looks good. My daughter immediately noticed it when she came to visit and said it looked good.", 
    "Came assembled and in excellent shape. Easy to hang and load. Looks great on our wall and does hold nearly 100 CD's. Could easily see people using 2 or 3 of them for large collections. Would find it very useful for people with limited floor space. Have been using regularly since we bought it and see no signs of the paint chipping or wearing. Wanted something different in a CD holder and am quite satisfied with this one.", 
    "This rack looks nicer in the picture than on the wall.. CD's fit awkwardly. Perfect for a teens room. However, it's pretty cheap looking for $$$.", 
    "The CD wall mount has been really good for our spare bedroom that is small so space is important.", 
    "Sturdy and great looking rack that holds a lot. Came fully assembled. Took seconds to install. We simply put screws right into the wall stud.", 
    "I liked this product very much. It has a modern feel to it and already comes built.", 
    "Sturdy and was installed quickly. When filled, the disk boxes give this storage unit an art like effect. Very pleased!", 
    "This is compact and neat. it is the 2nd one I bought, it holds as much as the bulky wood racks and it looks much better and takes a lot less wall space", 
    "I bought this for my place of business -- we needed to replace a floor rack that people kept triping over it is hung on the wall which make for more floor space -- we will see if it works out or not. Four Stars because it is it's a rack we will see how things work out.", 
    "I love this CD rack! It looks great, holds a ton of CD's. Very easy to use. Well made. I get lots of compliments on it. I love that it does not take up floor space. I placed it on my wall in no time and have been happy ever since!", 
    "THIS CD RACK IS WONDERFUL AND HOLDS MANY MORE CD'S THAN I THOUGHT IT WOULD. PLUS IT LOOKS VERY DECORATIVE IN MY DAUGHTER'S ROOM. A DEFINITE MUST FOR ANY PERSON LOOKING TO ORGANIZE THEIR CD'S.", 
    "Looks like something for the garage as opposed to hanging on the wall. The marketers for the product should be commended for their talent by the manufacturers, scolded by consumers.I would return it, but destroyed the box and don't want to invest any more money in gas and purchase of a new box and shipping to return it. garage sale or trash it is.", 
    "easy, nice and convenient. Cheap but needs a firm wall to be mounted on", 
    "This CD storage rack is an attractive, easy to mount and practical way to store your CD's. The package arrived timely, and it adds an area of interest to a wall space and is unique. I definitely recommned this item.", 
    "Received shipment in a timely manner and in good condition. Looks great on my wall.", 
    "It was not what it looked like, not a square as a thought it was. Did not feel like it was worth the money. I would have returned this item but someone else in the family decided that hey wanted it.", 
    "This is a great product. Sleek and Convenient too. I purchased for my son's room but now my husband wants to take the other two. Well worth the money and classy too. Great job O.", 
    "I really liked the rack - looks sleek and matches contemporary furnishings well. You have to have a concrete wall to put it on, though - with CDs it is quite heavy. Excellent service from Overstock - as usual. Recommend!", 
    "We were looking for something to get our CDs off the floor and away from our soon-to-be-crawling child. This rack was a good deal. It is sturdy and holds a lot of CDs. It is very easy to install but we did take the advice of another reviewer for this product and bought more stout wall anchors. The anchors included with the rack look pretty wimpy.", 
    "I am so happy I took the chance and ordered two of the wall media holders. I have never liked the media storage units that are a piece of furniture. This is so perfect to cover a space on the wall but not taking up more floor space like furniture would. I love it!!", 
    "It was just what I needed the quality was very good and just the right size. Perfect and easy to assemble.", 
    "I had a bit of a problem hanging it, however once I got it on the wall it looks great and holds most of my CD's. I had purchased one locally but it fell off the wall after I put CD's in and I had to return that.", 
    "The purchase was seamless and aside from a minor set back with my apartment's flimsy wall (I decided to use a stronger, locally-purchased anchor instead of what came in the shipment, so strong that the first one went right through the entire wall!) the installation was easy and it looks like it's built-in. Price could be a little less in my opinion, but overall, it's a great product.", 
    "It is really good and very easy to assemble. It looks very good and we have no broblem maching it with our furniture. Thank you very much.", 
    "No assembly! Just as described. I like the look on my walls because you see CDs floating on your wall, rather than a CD RACK! Pleased as always", 
    "I bought this CD rack for my son when he moved into his apartment. It looks great hanging on the wall and quite a few people commented on it and said it was really neat.", 
    "Love it! Arrived safely, easy to mount and once mounted looks like an abstract art form more than a cd rack. Highly recommend."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Upton-Home-Wall-Mounted-CD-Rack/2554960/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=18", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/2554960/Wall-Mounted-CD-Rack-99653925-fd8f-48ea-b2d9-bf1777de95b8_600.jpg"
  ], 
  "description": "Create a modern and functional interior setting with this chic CD rack. This interesting accessory will help you store and organize your CD collection more easily. With its contemporary design, this eye-catching piece will become the center of attraction when you host parties or family gatherings. This simple yet functional CD rack provides extra space for you to store your favorite CDsEach media shelf can easily hold 12 CDsThe total storage capacity is 108 CDs.This rack's sturdy frame will remain elegant and stylish for many years to comeThis piece can be assembled quickly, so you can start enjoying it right awayModel: MS0168.Set includes: 1 CD rackMaterials: SteelFinish: BlackDimensions: 25.75 inches high x 19 inches wide x 5.25 inches deepStyleContemporary, ModernMaterialSteelFinishBlack FinishShelf TypeMedia Cabinets, Wall HutchesAssemblyAssembly RequiredColorBlackNumber of Shelf9"
}