{
  "name": "Upton_Home_Calais_Double_Drawer_Storage_", 
  "price": "EUR 120.20", 
  "reviews": [
    "failed to get review"
  ], 
  "link": "http://www.overstock.com/Home-Garden/Upton-Home-Calais-Double-Drawer-Storage/11180518/product.html?recset=fc38abe0-93d5-4b5d-b829-253be83d8555&refccid=DE2ZZDKTIPOYK3SDQ7XYI3GAKE&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/11180518/Upton-Home-Calais-Double-Drawer-Storage-0bbc253d-d9c4-470c-a5f9-de8045e76087_600.jpg"
  ], 
  "description": "This versatile Upton Home storage table features two gray fabric drawers encased in a smooth white shell. Wooden handles adorn the spacious, removable drawers; slide them out for easily accessible grab and go storage or keep them closed and have a tidy spot for magazines or leashes. Utilize as a cocktail table, craft room catch-all, or below a TV for media accessories. Upton Home, Traditional Furniture to Design Your Life.\rMaterials: Solid wood, particle board, veneer, polyesterFinish: White, natural, taupe, soft grayFabric: Tightly woven polyester, smooth matte polyester liningConvenient multi-use, anywhere storageFeatures (two) 2 removable, interchangeable fabric drawersLofted on flared spindle legsMidcentury modern meets coastal styleOverall: 19.25 inches high x 35 inches wide x 16.75 inches deepTop: 35 inches wide x 15.75 inches deepShelf: 5 inches high x 16.5 inches wide x 15 inches deepDrawers: 4.5 inches high x 16 inches wide x 14.5 inches deepClearance: 12.75 inches high x 27 inches wide x 8.25 inches deepFootprint: 34.25 inches wide x 15.5 inches deepApproximate weight: 25 poundsSupports up to: 50 pounds (top), 10 pounds (per drawer)Shape: RectangleType: Accent TablesStyle: Mid-Century, ModernMaterial: Polyester, Wood, VeneerAssembly: Assembly RequiredExact Color: WhiteFinish: Grey Finish, Taupe Finish, White Finish, Natural FinishColor: WhiteStyleMid-Century, ModernMaterialPolyester, Veneer, WoodTypeAccent Tables, Cocktail Tables, Coffee Tables, Console TablesFinishGrey Finish, Natural Finish, Taupe Finish, White FinishShapeRectangleAssemblyAssembly RequiredColorWhite"
}