{
  "name": "Walnut_Five-tiered_Corner_Bookcase", 
  "price": "EUR 140.23", 
  "reviews": [
    "This is a nightmare to assemble!!!! Plus all of the pieces did not fit together properly! Angry that I can't return so I ended up throwing the entire item in the trash!", 
    "Not terribly difficult to assemble. The color is a VERY dark espresso, almost black. I was expecting a walnut color from the item listing. Too dark for the room I bought it for, but I'll find somewhere else to use it. It's cute, I like the style.", 
    "The bookshelves are very well made and interesting looking. A little wider than I thought. Didn't go in the small space, but I found another. Recommend carefully measuring for widest area.", 
    "exactly what we needed for a small entryway into our master bedroom", 
    "Not that easy to put together but it is nice.", 
    "Great addition for corner or small area.", 
    "It was a little frustrating putting together at first, but when we finally got the instructions straight. It was well worth it. I love the look it adds to my living room area."
  ], 
  "link": "http://www.overstock.com/Home-Garden/Walnut-Five-tiered-Corner-Bookcase/9366853/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=3", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9366853/Walnut-Five-tiered-Corner-Bookcase-11b0170d-86ef-4a89-b103-7ee02b024ba6_600.jpg"
  ], 
  "description": "Store your hardcovers in modern style with this five-tiered corner\nbookcase. Featuring a compact, bottle-shaped design, this bookcase\nallows you to maximize space in an unused nook or create a stunning\nfocal point along a wall. Display photo frames, plants,\ncollectibles and other decorative items at eye level while placing\nheavier items closer to the bottom.Constructed from durable MDFFinished in espressoFive shelves provide ample storageMeasures 61\" H x 12\" W x 12\" DStyleModernMaterialMDFFinishBrown Finish, Walnut FinishShelf TypeBookshelvesAssemblyAssembly RequiredColorBrownFurniture PatternSolidNumber of Shelf6Storage TypeBookcases and Shelves"
}