{
  "name": "White_Finish_Large_Corner_Wall_Mount_Zig_Zag_Wallmount_Shelf", 
  "price": "EUR 54.14", 
  "reviews": [
    "This was easy to assemble and hang. To give an idea of shelf size, a baseball cap is the largest item we displayed. The reason it did not get 5 stars is because of the finish. It looks more gray than white.", 
    "Very cheap material. It would not stay together with the screws provided. Used wood glue and the screws but it was still wobbly. There are three screws with anchors that hold it in the wall but they are visible once you've screwed them in. Also, most of the other screws are visible, they are flush with the wood not en-caved. Husband did a lot of modifications on it to make it work. Looks better in the picture.", 
    "pain in the butt to put together and stay together but looks nice", 
    "We ordered these for a lake cabin. They were hard to put together because the screws were not long enough, and they kept falling apart. They look pretty cheap, and if I had ordered them for our home, I would have returned them. We just needed some small wall storage at our cabin so we kept them. They don't look great, but they serve the purpose.", 
    "A great addition to my loft apartment where space is always a consideration,stylish and oh so functional for my nic nacs and flame less candles, thanx", 
    "Would like it if it came with stickers to camouflage screws", 
    "This shelf is perfect for my bathroom!! I don't have much floor space but I was in need of storage space and this shelf does just that!!", 
    "Nice idea but not an exact fit/finish in the end. Oddly, for white, it appears more of a blueish hue - something to consider if you are going against a white wall as we did. Also, don't plan on using the wall mounts provided - they will barely hold the shelf on drywall. Use a something like a toggle anchor (metal) instead (though this will require use of different screws to mount). I'd still buy it again for our specific need but ours was very specific and the height/width was exactly what we needed.", 
    "The quality of this shelf is great! However I cannot use it properly because they did not give me enough screws and anchors so I had to use what I had in my toolbox. Needless to say, it did not workout very well and now my shelf is very lose on my wall. I added a nail and that didn't work. Now I can only keep light items on the shelf. Since I cannot use this shelf for what I want to, it received 3 stars. If I had enough screws and anchors I would give it 5 stars."
  ], 
  "link": "http://www.overstock.com/Home-Garden/White-Finish-Large-Corner-Wall-Mount-Zig-Zag-Wallmount-Shelf/9620691/product.html?recset=489f3128-9e6a-4723-bfca-263787d08f0b&refccid=MUJWSM3B5JWYFBSG7YBNTHP6N4&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/9620691/White-Finish-Large-Corner-Wall-Mount-Zig-Zag-Wallmount-Shelf-47c0ee17-ffe3-4966-8dc3-b5113e24e8eb_600.jpg"
  ], 
  "description": "Take advantage of an unused corner in your home by turning it into\nan attractive display with the help of this intriguing zigzag\nwall-mounted shelf. Show off your family photos, knickknacks and\nspecial keepsakes with style on this shelf that provides varied\nopportunities to view your treasures.Wall-mounted, medium-density fiberboard shelf is finished\n  with laminate for easy maintenanceChoose between white and espresso laminate to match your\n  interior decorHangs in a corner with no hardware visible to present a clean\n  lookFive shelves give you plenty of room to display your\n  treasuresAll hardware includedMeasures 48.5\"H x 7.75\"W x 7.75\"DMaterialWoodAccent TypeDecorative ShelvesColorWhite"
}