{
  "name": "WYNDENHALL_Normandy_Ladder_Shelf_Bookcase", 
  "price": "EUR 171.63", 
  "reviews": [
    "I thought the assembly of this product would be like another bookshelf by the same maker. It was until I had to drill the holes to place the bracket supports and also discovered the phillips screws with a round head actually requires a special screwdriver or drill bit. I assembled the bookshelf without the special screw driver/drill bit. (Two holes were required for the bracket supports and only one hole was pre-drilled.) Insert all the Cam Lock Pins in both side rails first, then place shelves one at a time, and last insert and tighten Cam Locks as each shelf is placed. The product is made from all pine wood and is heavy. It does require the tipping restraint if not weighed down on the lower shelves with heavy books or heavy weighted knickknacks or if there are small children in the house. I have heavy enough books for the lower shelves and no small children. The top shelf is ideal for pictures or knickknacks. The bottom two shelves fit extra tall books. As the shelves progress upward, the shelf space becomes shorter. I wish that the measurements for the shelves were included in the description on the site. Here are mine: bottom shelf, 14.75; next shelf, 13; middle shelf, 11.75; next shelf, 10.125; top shelf has no limit. (All in inches.)", 
    "I had no problems with he pacaging. No issueswith scratching like other reveiws. I put it together in a half an hour with a 4 year old and an 18 month old helping. You would have to be an idiot to complain about the assembly of the shelf.", 
    "Arrived well-packaged. Assembled easily. Finish is even and smooth. Quality is above and beyond what I dared to hope for. Highly recommended.", 
    "It took me forever to find a ladder shelf that I liked. I am so happy that I looked here- there were many options, but this one was the best- AND I got the last one! We are very happy with the quality of this shlef. Would definitley recommend!", 
    "This is a nice bookshelf. When assembling there are little metal Ls with two holes and a bunch of wood screws that are supposed to secure the shelves to the frame. I found it impossible to screw in the wood screws so I left these off. It's still stable without them.", 
    "I love the shelves! I am actually on here to order another one as we speak! I have had so many complements since their addition to my home. They took about 30 -45 minutes to assemble but I did not do them myself so I cannot speak on the level of difficulty. The only complaint would be that to or three of the the screws and nuts broke when they were being tightened however they sent extra so it was of no inconvenience. They are very sturdy and work great for books and as a display shelf. I was on a budget as I had to purchase many items of furniture and I am so glad I took the risk of ordering offline with these (i'm the kind of person who wants to see it in person). I highly recommend these shelves to anyone interested!", 
    "Beautiful bookcase! Lots of space for storage. Fairly easy to assemble. Nice quality wood. I love this addition to my living room and have received many compliments. I searched many stores and websites before I found this bookcase. The size, color, and value are just what I was looking for.", 
    "Item as described. It is a gift. Very fast shipping. The shipping was free. I would order from this seller again.", 
    "This book Case looks great and is really easy to put together. I put 2 together in 20 minutes and my living room looks that much better for it.", 
    "I love EVERYTHING about these bookshelves except that they seem to have some sort of super-powerful dust attracting qualities.I bought 2 for my large master bedroom and FINALLY after 16 years organized all my books. I love that the big photo albums fit on the bottom shelves, old yearbooks and oversized on 2nd to bottom and then all the way up to trade paperback on the top shelf. I didn't anchor them, but they are very solid -- not tippy at all.I liked them so much I bought 2 for my tween daughter's small bedroom. the larger and deeper bottom shelves work great for toy bins, 2nd shelf for picture books, 3nd shelf for chapter books, above knick knacks and SO MANY stuffed animals! She loves them too.", 
    "I ordered two of these bookcases after shopping around for quite some time. They arrived in a timely manner, well-packed without any problems. The bookcase is easy to put together (it took about 1/2 hour), and when assembled, is a nice, sturdy piece that fit right in with my room decor. You only need a phillips head and flat head screwdriver to assemble, and all the pieces are in numbered bags that make it easy to know where to use each piece. My only regret is not ordering a third one while it was on sale.", 
    "easy to put together; really attractive; holds a lot more than you would think", 
    "Easy to set up and looks nice. Recommend if its your style", 
    "Love my bookcase. Easy assembly.", 
    "Love my new bookcase! Easily assembled too!", 
    "Nice piece for my home office. Easy assembly.", 
    "Bought two units as their description was they were made if solid wood and not \"engineered\" products. The assembly was pretty easy and I am pleased with this purchase.", 
    "Challenging to put together if you don't have strong hands. I ended up having to use a drill as the screw holes did not line up if they were even there. But overall the quality was good though there were some scratches that probably can't be avoided when you ship an item. It was packaged well.", 
    "I love the look, better than a standard bookcase. I almost didn't buy it because that extra bar on the top shelf looks out of place. Turns out I didn't use it. It's for attaching it to the wall for safety, but I don't have small children around and don't have anything too heavy on it, so I didn't put it on, and it's working just fine, and it looks much better without it.", 
    "These serve our purpose for now. Look ok on either side of our fireplace.", 
    "Easy to put together and looks great. Also very light so if you have kids i would suggest anchoring it top the wall.", 
    "Easy to assemble and looks nice. Sturdy.", 
    "Very easy to put together. solid construcion, solid feeling. I would have given it five stars but one of the shelves had a stratch on the front. We are going to cover it with stratch cover or permanent marker. I put three heavy wicker baskets on two of the shelves. Photos and books on the other shelves. It looks really nice. I would recommend it", 
    "Talk about a space to put things. Wow this is easily one f our best buys in a long time.", 
    "We love these shelves. They went together easily and are solid wood.", 
    "Cumbersome assembly is much easier with two people. Overall it's a nice piece of furniture..", 
    "Excellent quality and easy to assemble", 
    "they are cheaply made. I bought two stupid me.", 
    "Love this ladder bookcase. Easy to assemble and looks great!", 
    "The bookcase looks fine assembled. Assembly is not hard, just time consuming. Also the pilot holes for the back slats were marked, but not drilled, so needed to drill holes before installing those pieces. When assembled it's fairly stable even on carpet without being anchored to wall. It's a functional piece.", 
    "I wanted additional storage but didn't want to block the natural light coming in through our sunroom windows. This bookcase worked perfectly. Sturdy enough to hold books and some decor items. We placed it across a corner of the room. If you have small children you'd want to position it where it could be anchored to the wall for extra safety.", 
    "Easy to put together and quite sturdy. It's serving its purpose and definitely looks like a quality buy.", 
    "I love this bookcase. It was easy to put together and the wood stain is very nice. I like that there are extra wooden braces in the back of the top shelves which makes me feel like my items are more secure.", 
    "Easy to assemble and look great", 
    "I have ordered a lot of furniture where assembly is required. I have never been more impressed than I am with this product. The thoughtful care put into the packaging ensured that I would not have any scratched wood or broken pieces (and I did not). The instructions were so easy and everything was separated and labeled thoroughly, with extra pieces just in case. Seriously - this was a total breeze to put together and they look beautiful in my office.", 
    "We have three of these in the den....they are quality and look great with our mission style desks! very happy with color and delivery.", 
    "This bookcase is great! Assembly was a little bit lengthy but it's made of solid wood and it looks nice. We didn't anchor it to the wall, so we put heavy objects on the bottom. It holds a good number of books, and our keepsakes fit well too. Perfect in our small apartment.", 
    "Nice bookshelf, very solid.", 
    "I'm really quite happy with this bookcase. I use it for my extra little knick knacks and just a few books on the bottom shelf. I'm actually quite proud to say I put this together in a few hours by myself. I usually have my husband put things like this together. But I decided to give it a try one day when he was gone. This seems to be really good quality and I love the look of it. I would definitely order this again!", 
    "Purchased 2 and they are just what I was looking for! Look beautiful and are able to display all my pieces and photos.", 
    "Great bookshelves. My husband and I put these together ourselves.", 
    "I purchased this shelving because I needed a place to display family photos. It works perfectly and is a very nice addition to our office room.", 
    "This is a great piece for our downstairs office/den. Easy to assemble.", 
    "Easy to assemble. Fun to decorate.", 
    "Easily put together looks great in bathroom", 
    "Easy assembly, looks great", 
    "excellent quality for the price ,i buy to for my home office ,very easy to assemble", 
    "My son put it together and kept saying what a fantastic piece of furniture!! Wood!!! Solid!!! And it's so sturdy an Looks like a million bucks!! Can't wait for people to see this I'm so proud to own!!!!", 
    "This is a nice piece, but hard to put to together and if you don't get fittings in just right is very unstable.", 
    "very nice, rich looking, easy to assemble, bought 2", 
    "Although I received the wrong color (I may have inadvertently ordered wrong), this is a nice bookcase. My cats jump on it from time to time and it hasn't toppled over, but if you have liitle kids in the house you should secure it to the wall. Overall, a great buy.", 
    "I love it. It is a good size. Perfect for my apartment", 
    "Nice solid shelves. Took a little time to put the first one together, but the second one went much faster. I think they look great ( I got the brown ones) and they feel sturdy.", 
    "I ordered these shelves and had them delivered to a vacation home. They're made of real wood, they were rich in color and a good quality. I didn't assemble them myself, but my Dad didn't complain, so it must not have been difficult. I would buy them again.", 
    "i found this product to be better than described. the material was a hardwood, not some flimsy stand with mdf, but all materials were solid wood. it was also easy to build, it went up really fast. it looks great in my living room.", 
    "need to fit hands into tight spaces to assemble but great quality and sturdy!", 
    "LOVE IT! Sturdy and looks great!", 
    "received quickly. put together easily. good value.", 
    "Very nice addition to the den. Unlike many ladder bookcases, you can actually put books on this one. 😊", 
    "Functional, sleek designed bookcase that does not take up much visual space. Great, solid wood. Goes well with my decor. I would give it 5 stars except we had to make about 3 holes that were missing in the wood.", 
    "Am very pleased with this ladder shelf bookcase. Easily assembled & works perfectly for the space I have.", 
    "It was an easy two person build. It would have been slightly more difficult for one but certainly doable. It was exactly as described and you can't beat it for the price. The top shelf displays and supports an 12lb piece of coral beautifully.", 
    "Needed for small office. Utilized bottom shelf for books. Placed objects and photos on the others. Not a substantial piece. Was not meant to be utilized in that fashion.", 
    "This bookcase is just the right size for the space that I needed to use it in. The case was fairly easy to assemble and quality was good and just looks like the picture.", 
    "Very sturdy and easy to put together. It looks great! Well worth buying!", 
    "Fairly easy to assemble, although a little time consuming because of the various pieces. The bookcase looks really nice. Is modern and eye catching. Color is very dark brown as shown in picture. Took me months to figure out which one I needed. But am glad I selected this one. Am happy with purchase.", 
    "This is a nice-looking ladder shelving unit --- especially for the price. But I had a heck of a time putting it together. Some of the holes were not drilled as well as others so inserting the screws to a LOT of muscle and some - no matter how much muscle I used - didn't go in as deep as they should have. I tried my small electric screwdriver which didn't help. Someone else mentioned that a special screwdriver was needed. Well, I put it together with a regular Phillips head one and it worked fairly well. Anyway, once it was done it looks good and is stable. I am not attaching it to the wall as it seems to be fine without that added protection but I don't have kids that might bump into it. So I'm giving this a 4 only because of the headache in putting it together.", 
    "Super easy to assemble, great guailty Nice accent", 
    "It is beautiful and looks expensive. There was only one spot that was missing holes, but the wood is soft, so it was easy to get the screws in anyway. There is a wall connection included in the pack, so take the people complaining about it being wobbly with a grain of salt. They didn't use what was provided to them. my only real compaint is that there are a million stickers and they are really hard to get off. Still, gonna buy two more.", 
    "This bookshelf looks exactly like it was shown online. The quality is good.I am using it in my den to showcase pictures. The bottom shelf is wide enough for picture albums.", 
    "I ordered one of these shelves 2 years ago because it looked stylish, would serve as a functional piece of furniture and I knew that I may want to purchase a second one when we moved into a home with more space. I have since ordered a second shelf as we've accumulated more books and moved into a bigger house and because I really liked the first shelf. The assembly was very easy.", 
    "its a pretty bookshelf. easy to put together.. ppl ask about it a lot!", 
    "These are beautiful when complete but we ran into a plethora of problems building them. (we bought 3 sets) The screw holes don't all line up and it caused splitting in some of the wood. Thankfully I have a handy father in law who was able to make the necessary adjustments and repairs. The color is very dark and appears almost black even though it is an espresso color according to the site. The shelves are great though, very sturdy and look great in my living room.", 
    "A-1 quality materials, super nice and easy to assemble.", 
    "Easy to put together and they look great. Hold plenty!", 
    "I love this bookcase! This is the second one I've purchased. Each daughter has one now. Works great for books, larger photo/scrap albums and any other knick knacks. It's sturdy and the rich color is just beautiful.", 
    "Love the color, the look. All pieces fit together nicely. Very easy to assemble and is very sturdy.", 
    "This bookshelf looks great. Pretty easy to put together. Great buy.", 
    "I downgraded it, because the wood is kind of soft. Fairly east to put together, though. A nice addition to my living room.", 
    "These are very nice and sturdy. Good value for the price. Very easy to put together.", 
    "No matter how tight I tightened the screws, the shelf was always extremely wobbly, and I was constantly terrified that it would topple over. In fact, I tightened one of the screws so tight that it broke through the wood. Just overall not great quality.", 
    "The quality is similar to Ikea stuff, seems sturdy. Wanted something to put my stereo on along with records and CD's. This works great, records fit nicely on bottom 2 shelves. Double stacked CD's on top shelf. Did have to remove back brace on middle 2 shelves to make stereo components fit, but no big deal. looks nice and fit the bill for what I was looking to use it for.", 
    "Exactly as pictured and a perfect complement if this suits your decor!", 
    "I put it together myself, which is no small feat. For someone stronger than I it should be fast and easy. It all worked perfectly except I could not get the brackets on. There did not appear to be holes for them. The bookcase seems sturdy enough without the brackets. I wish the instructions had more exact illustrations. I have the bookcase in small bedroom, and it looks good. The openness of it is great.", 
    "It looks very nice, fits in well with everything.", 
    "this is perfect in my living room. The reason for only 4 stars is that one of the shelves had a huge gash in it. Other than that, I love it. Easy to assemble.", 
    "Looks great, easy assembly if you have a cordless drill.", 
    "nice quality and very good pricing", 
    "Good quality wood, easy to assemble and the price was great. Planning on ordering a 2nd", 
    "This was in great condition, looks fantastic in my office.", 
    "This was easy to build, solid and looks great in my living room. Wonderful piece of furniture for the price. It arrived intact and fits beautifully. Very sturdy, too.", 
    "Very beautiful - great quality!", 
    "Easy to put together, very clear directions! This bookcase has a great look and can hold more books than I thought. Great purchase.", 
    "I needed a compact bookshelf for my loft area and this is perfect! It arrived quickly, I love the color and it was easy to assemble. I am happy I purchased this and would definitely recommend.", 
    "Top notch display stand ,versatile", 
    "I bought two. So far, so good. They look nice next to the tv on the wall.", 
    "people call me the nic-nac queen, and my shelf took care of showcasing my valuables............", 
    "This was easy to put together and looks perfect in our great room.", 
    "This bookshelf is perfect for a smaller space. Living in a cabin, it's tough to find a spare wall & this works. The color is what is described & my husband had no trouble putting it together. It arrived a couple of days before expected too! We will be buying another in the future for our guest room.", 
    "solid construction. matched well with Linon Tavern Faux table and seats. ez to put together as each part is well engineered to fit.", 
    "I couldn't be happier with this purchase. Good quality shelving for the price. So easy to put together, boyfriend and I had it up in less than an hour. The only reason I'm giving this 4 stars instead of 5 is due to the stickers that were placed on the shelves, labeling the parts and warning of mounting it were very hard to get off and took some of the finishing off of the product. Overall though, no complaints, seems very sturdy and adds a nice touch to the living area. I would highly recommend this item.", 
    "Very pleased with this purchase. Quite sturdy, easy assembly and a nice dark finish.", 
    "ugh.. bought 2 sent one right back. would have sent the other but my sons had already put it together... You get what you pay for with this; When I was in college I might have thought this was great but, but compared to some of the nicer furniture we've collected over the years, this just is poor in quality, finish, construction. It smelled a little oily or like smelly petroleum based stain..", 
    "Sturdy and a nice color. From the Bottom shelf up as follows; bottom accomdates up to 15\" then 13\" then 11-1/2 then 10-1/2 and the top shelf is open. Hope this helps.", 
    "There were some scratches on a couple shelves, intended to ask for more to be sent, but I'm in the middle of move, and could not bother to rebuild it, and deal with return labels.it still looks very nice in the room", 
    "This bookcase was easily assembled and very sturdy. It is also quite attractive.", 
    "I first purchased two and then came back and purchased a third. The shelf is really easy to put together, seems very steady and holds quite a bit. It was exactly what I needed in our bedroom.", 
    "I am generally very satisfied with this bookcase. It was inexpensive, yet met all of my requirements. It is stylish and will fit in many decors. 1. Assembly was a bit tricky. The instructions are very sparse and mostly in the form of cartoons to eliminate the need for multiple languages. The cartoons are poorly drawn. I had to back track because I missed a point in the cartoons.2. Part of the assembly requires \"L\" brackets to be installed under the shelves for support. The shelves and vertical supports did not have the pre-drilled holes required to install the brackets. After many tries, I gave up trying to install the brackets, which left the shelves less sturdy than designed. It is \"sturdy enough\" for my purposes, though I am intentionally not putting heavy books on the top shelf.", 
    "Not easy to assemble, the instuctions are photographs and part numbers. Once it was assembled it was wobbly. If you have to use screws and L-brackets to assemble it, that is not a good sign. Lovely design and real wood but it's pine, I think. Thank God it was going next to a wall and had lots of books on it; one good nudge and that would be the end of it.", 
    "This is the perfect bookcase for my office. It's sturdy and offers a lot of room for displaying books and other knick knacks. I may order a second one.", 
    "Shelf is attractive and doesn't have the heavy appearance of bookshelves due to the open shelves and ladder, stepped-back arrangement of shelves. It also holds a lot as far as volume and, apparently so far, weight. The structure itself is light and can be moved easily. It took about an hour to put together - no awkward pieces or handling and was easy to do on my own. The downside - and it is significant - is that the shelf wobbles from side to side and does not have a solid feel. I have not yet installed the wall restraint, and that may help, but the structure on its own is not sturdy and I would not buy it again. (Actually intend to stop purchasing furniture that comes in pieces overall).", 
    "Shelves assembled easily, and look beautiful.I purchased two sets, and set them side by side in an addition to my house. They are filled with plants.Have received many compliments", 
    "Upon arrival it was package good. There were no scratches and the color is true to the picture. The assembly was pretty simple. Goes together faster if there are two people. Comes with a anchor to prevent tipping, but you do not need it if you do not have small kids. Very nice and sturdy.and holds alot of stuff .I looked around for about 3 months before this purchase great value and quality.", 
    "My dad is an engineer and it took him a few hours to figure out how to put this bookcase together so that it would be sturdy and not wobbly. The instructions that came with this bookcase were really vague and not very helfpul. My dad needed a drill to put the pieces together, the instructions did not clearly indicate where the metal brackets should be placed, and the shelves did not have clear or accurate markings to indicate the position of the brackets. Despite the confusion, once together, this bookcase looks very nice in the space.", 
    "Pretty sturdy. Must of course be mounted against a wall. Takes an extra pair of hands to start assembly.", 
    "I think this is a good value overall because it's big enough to handle a lot of books and things you want to display (a lot of ladder bookcases are more narrow), and it looks nice, but once we set it up we were a bit disappointed with its wobbliness. All of our screws are tightened fully and it still can be easily shifted around (before you load stuff on it) like a poor-quality bookcase. The assembly was challenging, since the instructions are done in that ridiculous pictures-and-#s-but-no-text way and there are a LOT of screws. The first one took my father and I a couple of hours and some experimenting at the beginning. The 2nd one took him less than 45 minutes on his own. We decided not to use the wall brackets so that I could move them more easily and they are very stable once you put stuff on them. I have approximately 28 books on the bottom three shelves (84 total) and will use the top two shelves for much lighter things like frames. Also the box it came in was very tall and thin and was about 25 lbs. It wasn't that heavy but it was quite awkward to bring up stairs on your own, just FYI.", 
    "Easy to assemble. Stylish. They should not put stickers on the wood as they are very difficult to remove. You can put a lot of stuff on this shelf.", 
    "Great product. Easy to put together. Looks wonderful in my bedroom. Has lots of shelf space", 
    "Loved it! The only downside I found was that the pre-made wholes were not all done correctly, so it was hard to screw the shelves together", 
    "Easy to assemble. Very nice looking when done and met our needs very well.", 
    "This bookcase is exactly what I wanted. I wanted something that was trendy, stylish, and easy to put together. Took me less than an hour to put together and I love it! Looks really good in my living room/family room.", 
    "Easy to assemble. Looks great. I've received so many compliments on the shelf - very happy.", 
    "Everything about this bookcase is just right for the empty brick wall space in our living room! Easy assembly, but still feels very sturdy. Definitely helpful if you have a handheld electric screwdriver to save some time.", 
    "I wanted something different than a linen closet for the master bath. Love this ladder shelf unit. It is a rich dark brown. It easily holds adequate towels and personal care items (in pretty baskets). None of the hardware shows which gives it the look of nice furniture. We have 9' ceilings so I wanted some height and this looks perfect. It was very east to put together. The cams all worked beautifully and it feels very secure. It can be attached to the wall if small children are around. Overall, I highly recommend this unit.", 
    "Fits the space perfect, very versatile. The assembly was easy and the shelf is pretty sturdy, more than I think I thought in my head.", 
    "Never ordered from Overstock before but delighted with the speed, price and quality of this bookcase. .Easy to assemble, very sturdy. We have lots of books and luckily we ordered two bookcases so we're doubly happy.", 
    "The piece feels pretty sturdy and looks nice, but the wood is darker than I expected. It's very close to espresso.", 
    "I purchased this product for my living room, not only because it was the style I was looking for, but mostly because it was slightly larger than similar shelves I'd found. It's the perfect size for the space I needed it for & the price was the same or cheaper than the smaller ones.", 
    "great price, was easy to assemble ,great quality ,it looks great.....", 
    "i am very satisfied with the bookshelf and the fast service that it was delivered", 
    "I'm deducting two stars for fragility and difficult assembly, with three stars for a great looking finished product at a reasonable price. This bookcase is lovely to look at if you can manage to finish the assembly without breaking it. Holes for the first two steps were all correctly placed, but as other reviews have mentioned, tiny holes for the support brackets were missing altogether in some places. Trying to screw in screws adjacent to already secured shelves without going in crooked was nearly impossible. Don't misplace the screwdriver with force when screwing, or the finish will come right off the shelves. Overall, I would reluctantly recommend this product because it looks nice, and I was glad to find a self-standing bookcase with tiered shelves at a decent price. However, it is a pain to build.", 
    "I was not expecting much from this bookshelf, even with the great reviews, but I needed something and this was a perfect fit in the space I needed shelves. I was surprised to find that it was very nice wood and had very clean lines. It took about 45 minutes to put together but it wasn't hard to do at all. I love it! I put heavy items on the bottom shelves to keep it from tipping, but I can't see that happening easily even if I did overload the top shelves as it is very stable.", 
    "The shelves are very stylish and match the colors shown online. Setup is straight-forward and easy with only a screwdriver (although a drill would have been faster). Only drawback is heat because it used fasteners instead of scews to hold the shelves in place, its lateral stability is not great. I'm probably going to reinorce the shelves with brackets for more stability. Overall though, not bad for the price.", 
    "Bookcase is great quality and value for the price. Very sturdy and not cheap materials like you would find in some stores. A little difficult to put together - needed an impact driver for efficiency. But that is part of it being a quality piece. Overall very happy with the piece.", 
    "I love my bookcase. It is durable, fashionable and exactly as it is shown in the photos. For the price, you can't beat it. I had to put it together myself which I enjoyed and found that the instructions were easy and concise. I would definitely recommend this bookcase as it is one of my favorite items in my home! :)", 
    "I thought this was a great bookcase for the price. It was solid wood and strong when put together. I put it in my kitchen and filled it with cookbooks; it looks great and fits a lot of books. I was worried about the open sides and seeing the book covers, but I think it adds to the look.", 
    "Make sure that you look at the measurements - The picture depicts it as looking bigger than what it is. Also, I thought it would be a more sturdier bookshelf - but I would not place heavy items on it - I bought it for my books but I will have to rethink that plan.", 
    "nice shelves. good quality. a little darker brown than I expected but easy to put together. seem sturdy", 
    "It did not take long to put together by myself. It is very sturdy and looks very nice in my living room. I highly recommend this product.", 
    "I needed something for my master bedroom to use near my wall-mounted TV (for cable box, etc.) and this works perfectly! The unit arrived in very good shape and was packed well, nothing appeared missing or damaged. However ladies, unlike other reviews it took me 3 HOURS to assemble. I am neither a carpenter nor a construction worker, however I am capable of reading instructions. You will need two types of screwdrivers, the flat head and Phillips (not included). I had no problem inserting all the Cam Lock Pins into both right & left sides A. All holes were pre-drilled and lined up well. Then I attached the shelves to the right side A and then the left side A. I did run into a slight problem here as not all the Cam Locks tightened correctly. When attaching the bottom shelf don't forget to add the wood dowel to the center. It's not mentioned in the direction steps, however it is in the illustration. My biggest problem came when attaching the brackets -- there were absolutely no pre-drilled holes in my unit! I had to rely completely on the illustration and I had to predrill my own holes prior to inserting the necessary round head screws, which was difficult and time-consuming. Attaching the back bars to the finished unit was easy and I did not bother with the tipping restraint. Assembly was involved but not impossible, I managed to do it entirely by myself and I am quite satisfied with the finished product. I would recommend this unit to others.", 
    "This is a great shelving unit. There is a ton of room on it, more than I thought, so I'll probably have to buy some more items to display on it. Its good quality and clean wood/lines. For some reason I was thinking this unit would have the \"distressed\" style to it, but it doesn't, its clean and modern, so if you're looking for that distressed look, this isn't it, but I am still happy with it.", 
    "The product was excellently packaged so that contents were well protected. I had the same assembly problems as other reviewers with wrongly drilled holes but they were not difficult to overcome. The finished product looks very good. This replaced an old bookcase, and what I like best, because of its ladder design, is that both the height and depth of the bottom shelf provide a place for all of those \"coffee table\" books that so seldom fit on regular bookcase shelves.", 
    "I fell in love with this book shelf when I found it. It has a beautiful finish to it and it pretty easy to assemble. Cam locks to put it together break somewhat easy when wrenched on too tight. I love the finished product but I would recommend that the company should not put huge stickers on the wood. It's very hard to get off! Other than that I love it! Looks great!", 
    "I bought this a few weeks ago and after putting it together the other day, I am very pleased with the bookshelf. I was quite hesitant to buy a bookshelf without seeing and feeling the quality in person, but I lucked out with this one and am very pleased with it. It feels sturdy, and holds quite a lot of books and has more shelf space than I pictured it would. The quality of the wood seems very good and it doesn't feel like cheap, flimsy particle board. It looks great and has a nice rich brown color to it with a nice wood grain pattern, and is every bit as nice in person, as it is pictured. The only thing to be weary of is when attaching the shelves to the side walls, make sure the cam locks are catching the screws and don't force it too much. I put the screws in too deep and the cam locks weren't catching and I broke one and bent another. Luckily there was one spare so I was ok. Otherwise, it was fairly straightforward to put together, and the instructions were pretty good. Overall, I'd highly recommend this and it was the cheapest price I found anywhere online for this exact bookshelf.", 
    "The bookcase is well finished, and not very difficult to assemble. Some of the joiners do not match up well, so the bookcase ended up a bit rickety. It holds plenty of weight, but I'm glad that it ended up in a corner, where the wall supports it. Not really happy that it didn't go together really tightly, but it's good enough for my purposes. Looks good, in spite of this, and it's reasonably priced, so it's worth the risk of not lasting forever, like a solid wood piece would.", 
    "-Just be careful not to forget the 2 different types of washers which go unto each screw. -Do not tighten screws until it is all put together. Tighten to 90% -You are not actually screwing into the wooden frame but into a threaded metal sleeve which you must carefully drop into the holes. Align the holes and drop down carefully, slide the screw in and try screwing it in. If the sleeve moves out of alignment, try turning the screw counterclockwise and it should realign.", 
    "Easy to assemble and sturdy for light weight. It did have a scrape on one of the shelves but it was on the bottom so could be assembled so it was not seen.", 
    "Easy to assemble; Looks great; Sturdy and good quality", 
    "Looks great! Didn't take long to put it together - 35 minutes. The height of the shelves decreases as they go up. It looks great when it's full of books, vases, etc. I keep my printer on the bottom shelf and it's a great fit. If I had more room I'd order another to put by its side. It's not the highest quality solid wood but you won't finder better for this style and price.", 
    "I have searched high and low for ladder shelves like these and have had zero luck at the local big box stores.....higher prices, smaller units and poor quality is all I came across. The Normandy Ladder shelves exceed all expectations - quality and size being two of the main factors!!! The color is true to the picture, the build is excellent and very easy to assemble anyone can do it! I have had numerous compliments already as they are very stylish and have given me a ton more shelving space to decorate with! Thank you Overstock once again!!", 
    "I like the open feel of the bookcase, I did not want a solid sided shelving, it would be a bit stodgy.. I had a problem with the rear slats, the screws supplied were too short. I ended up going to Home Depot and buying a box of #6 1inch wood screws which did the trick. The bookcase is very sturdy", 
    "We are very pleased with this bookcase. It arrived quickly and was easy to assemble. It looks great in our guest room!", 
    "I searched tons of stores and website for the perfect bookcase for my space before I stumbled across this one. I was looking for something solid and sturdy (not pressboard). This is very sturdy and was so easy to put together. The color is just as it was in the picture and the dimensions were spot on also. I love my new bookcase, it adds functional storage and great style to my home!", 
    "The brackets included with the shelving unit do not line up with the shelves. The wood is very hard and the holes are pre-drilled only on one side. And yes, I've checked every possible side for a mistake I may have made along the way. Following the directions, the instructions wait until the last step to tell you to put the brackets on????? Really, instructions a bit out of order. Ridiculous to go back after the entire unit is assembled to attempt to drill the other holes needed to even use the brackets .. ....so I suppose it's wobbly for life. ugh.", 
    "Great price. No damage. Solid and easy to put together. Recommended!", 
    "Easy to assemble. Color is as appears. Sturdy yet light weight. REAL WOOD!", 
    "Not too big even if a have large books. The style is very simple so it can match with different kind of decoration. I love it", 
    "I'm impressed with the quality of this shelf for the price. It was in good shape when it arrived, assembly was relatively quick and simple, and the finish on the wood is nice and even. It's a solid, heavy piece of furniture once put together. Very happy with it.", 
    "This was my first purchase of furniture from Overstock, and I have to say I am VERY satisfied. This is a BEAUTIFUL bookcase. The quality is incredible. It is solid wood, and it is a very sturdy piece. It weighs more than I though tit would, and the finish is beautiful. (It is even finished on the backside, so you could have it free standing in a room, not against a wall if desired. I am truly satisfied with this, and I would recommend it to others in a heartbeat. have it in my home office and it looks great.", 
    "Very happy with this purchase. Easy to assemble, I did it by myself! Very good quality, sturdy. Looks more expensive than it was & have received many compliments on it. I will be buying another one.", 
    "We are very pleased with the bookshelves. It did take a while to put together but worth the effort.", 
    "I am extremely happy with the lovely tobacco brown color of my bookcase.", 
    "A very nice piece to compliment my mid century office furniture. Easy to assemble and well made. One screw hole was stripped so I did not give it 5 stars. That was a minor issue and overall we are very pleased.", 
    "nice for the $. Would buy again and refer a friend", 
    "This bookshelf was just what we needed....something functional but also nice looking without dominating the room. And the product for the price was excellent! Thanks!", 
    "I use these as book and display shelves. I put heavier books on the lower shelves. I display my collectibles on the upper shelves. I am very pleased with this product and actually bought another one!", 
    "easy to assemble and works well in my office . AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA", 
    "This shelf is lovely, and fits the space that I needed - within a skinny hallway. I was able to put together this entire shelf in about 2 hours but it could have been less time if the pre-drilled holes were in the correct locations and/or were better drilled. I had to use my drill to make the holes big enough for the nails to fit. It looks nice and has alot of space. The shelves were very dusty when arrived. They are a great addition to my house and hold all of my books nicely.", 
    "quality is good.for this price is very good buy.The color more like espresso,darker.easy to put on.I put it on my kitchen ,looks nice.", 
    "I really like the shelf. It looks nice - pretty much like the picture, and is not wobbly like other taller bookeshelves.", 
    "I thought the shelves were all the same size. It turns out one is wider because it a desk with shelves."
  ], 
  "link": "http://www.overstock.com/Home-Garden/WYNDENHALL-Normandy-Ladder-Shelf-Bookcase/6689614/product.html?recset=a1849ff5-d3f6-498b-87b2-12255297db23&refccid=ALBCW543V6XKDNSHVQTDXQOVSI&recalg=828,512&recidx=15", 
  "img_url": [
    "http://ak1.ostkcdn.com/images/products/6689614/WYNDENHALL-Normandy-Ladder-Shelf-Bookcase-8aa03876-a289-41a8-9b7e-43fa80f53001_600.jpg"
  ], 
  "description": "The Wyndenhall Normandy ladder shelf bookcase lends itself to\nstoring and displaying all the items in your personal treasure\ntrove. This sturdy 5-shelf bookcase can be used in a variety of\nways to highlight both large and small items, and the unique design\nmakes it easy to set up and move. This pine wood bookcase comes\nwith a black or brown finish that creates a bold, austere\nappearance in any room. Colors: Rich tobacco brown , blackFrame materials: Solid plantation grown pineFinish: Dark tobacco stain or black stain with protective NC\n  lacquer finishFive (5) shelves offer ample room for storageExtra large for ample storageDimensions: 63 inches high x 30 inches wide x 16 inches\n  deepStyleContemporary, Modern, TransitionalMaterialPine, WoodFinishBrown Finish, LacquerShelf TypeBookshelves, Display, Ladder, StorageAssemblyAssembly RequiredColorBlack, BrownFurniture Frame MaterialWoodFurniture PatternSolidNumber of Shelf4"
}